[
  {
    "contact_name_1": "Sree subhiksha M K",
    "contact_name_2": "Mavikka S",
    "hall": "G601",
    "one_line_desc": "An amazing technical event filled with fun and enthusiasm which carves out your inner skills and tests your knowledge on circuits. Ready for the event? Indulge yourself in the electrifying and fascinating event laden with tricky puzzles and riddles.",
    "description": "",
    "round_title_1": "",
    "round_desc_1": "Participants will be given 15 technical questions in a paper.The questions can be in the format of quizzes, crossword puzzles etc.Answers for every question will be coded into some format and a map containing it will be given.Participants have to find the correct location using the code and map it in the given map.",
    "round_title_2": "",
    "round_desc_2": "The participants will be given a set of questions. The circuits with missing component, tricky riddles can be the questions.After finding answers from each question, they have to find a codeword as per the rules.From the codeword, they will have to build the circuit using the given components.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0000",
    "category": "Circuit",
    "eventName": "Technozarre",
    "contact_mobile_1": "9655212171",
    "contact_mobile_2": "9629201942"
  },
  {
    "contact_name_1": "DHARINI N",
    "contact_name_2": "ALFRED MELWIN S",
    "hall": "G401",
    "one_line_desc": "PhyzTronz is a team event consisting two rounds which will take you through the expanse of physics. Round one  will contain a crossword, from which keywords need to be taken so as to from a complete law or postulate by a  famous scientist. In the second round, the qualified participant teams will be displayed a phenomenon related to  physics. All teams may guess the answer and will be graded based on the accuracy of the answer. The team that  gives the best answer will get all the points auctioned for the question.",
    "description": "",
    "round_title_1": "Link to Lead",
    "round_desc_1": "A crossword puzzle with hints will be given to the participant teams. They have to fill the ",
    "round_title_2": "Auction Bridge",
    "round_desc_2": "An everyday phenomenon will be displayed to all the teams and every team can take their guesses ",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0001",
    "category": "Gold",
    "eventName": "PhyzTronz",
    "contact_mobile_1": "88074 74027,94862 02945 (WhatsApp)",
    "contact_mobile_2": "9361230385"
  },
  {
    "contact_name_1": "Arvind V",
    "contact_name_2": "Madhav N",
    "hall": "J310, J311 , K block mechanical department EDC lab",
    "one_line_desc": "Off the ground, around the world",
    "description": "The Aeronautical Association is hosting a new event to showcase your knowledge of air vehicles. Take 3 rounds and show off your aeronautical knowledge and design skills.",
    "round_title_1": "PicTalk",
    "round_desc_1": "The participants will see a picture relating to aeronautical. Within three minutes, the participants must identify the image and provide a description of it. Each participant will get different pictures. There won't be any elimination",
    "round_title_2": "Parachute Creative model",
    "round_desc_2": "Learning about gravity and air resistance with parachutes is quite beneficial. They are also a fantastic way to kill time, particularly once you start experimenting with various weights and sizes. Why not attempt a bigger, more complex parachute instead if you already know how to create a small one?",
    "round_title_3": "Design your aircraft model",
    "round_desc_3": "“Creative solution for creative ideas” Come on it’s time to unleash your designing skills and show us the magic of your creation. A 2D part drawing (Aircraft) will be displayed on the screen and the participants will have to create a 3d model using CAD software at their convenience. Time limit is 1 hour.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0002",
    "category": "Kriyative",
    "eventName": "Quest for Avians",
    "contact_mobile_1": "6381657824",
    "contact_mobile_2": "7606882547"
  },
  {
    "contact_name_1": "Golbert S",
    "contact_name_2": "Boopalan S",
    "hall": "G309",
    "one_line_desc": "Draft your leanings to spun your Knowledge            Do you have a keen interest towards textiles.Then this event is for you! This event is mainly designed to test the technical knowledge on textiles and also helps to attain the knowledge. It is a team play with maximum of 2 members. This event totally consist of four rounds Quizzle & LogoGrab , Gamble your knowledge, Rebus with Machine and Tap & Talk.",
    "description": "",
    "round_title_1": "Quizzle & LogoGrab",
    "round_desc_1": "Quizzle contains a wide range of questions which may include multiple choice questions, fing the blanks, cross word puzzle and assertion & reason. It has 30 questions and participants have to complete it within 25 minutes. A set of incomplete logos and set of clues about several clothing brands will be shown to the participants along with a set of clues. The participants are to find the appropriate brand logo within the stipulated time of 1 minute per logo.",
    "round_title_2": "Gamble your Knowledge",
    "round_desc_2": "Gamble your Knowledge is a round where you can challenge your knowledge against your opponent. In this, opponent of every team will be chosen randomly and the team who has to challenge will be chosen by tossing the coin. The question will be given and toss won team will challenge the opponent and should answer within the time.",
    "round_title_3": "Rebus with machine",
    "round_desc_3": "The picture of the machine is given to the participants as a jigsaw puzzle and they should solve it. After solving, participants should explain about that machine and its process for few minutes and should answer the question being asked.",
    "round_title_4": "Tap & Talk",
    "round_desc_4": "Tap & talk is a rapid fire round with advanced technical questions. In this round, the question will be displayed and the participants will tap the buzzar and answer the question. Negative marks will be given to every wrong answer and the opportunity will be passed to the team who pressed the buzzar secondly.",
    "eventId": "EVNT0003",
    "category": "Brainiac",
    "eventName": "MasterMinds",
    "contact_mobile_1": "9585756505",
    "contact_mobile_2": "6380173346"
  },
  {
    "contact_name_1": "JAYA SRI DHARAN M",
    "contact_name_2": "PAVITHRA B",
    "hall": "J – 410,411,412",
    "one_line_desc": "Math-2-hunt is a team event, consisting of three rounds which will surely awaken the young Ramanujan inside everyone. The first round consists of solving a few questions among which zero is the answer for some questions. To win this round, all the zeros should be found. We the Indians are the best at handling Zeros. Round 2 contains Questions filled in a box, every team has to take a question randomly and solve it. It also contains Bonus and Devil questions. Mathematicians don't believe in Devil, they just smash it. Last but not least. Round 3 contains simple mathematical calculations. But the twist is that calculators will not be allowed. Common young mathematicians, unleash the Ramanujan hiding inside you.",
    "description": "Math-2-hunt is a team event, consisting of three rounds which will surely awaken the young Ramanujan inside everyone. The first round consists of solving a few questions among which zero is the answer for some questions. To win this round, all the zeros should be found. We the Indians are the best at handling Zeros. Round 2 contains Questions filled in a box, every team has to take a question randomly and solve it. It also contains Bonus and Devil questions.  Mathematicians don't believe in Devil, they just smash it.   Last but not least. Round 3 contains simple mathematical calculations. But the twist is that calculators will not be allowed. Common young mathematicians, unleash the Ramanujan hiding inside you.",
    "round_title_1": "Zeros makes you heroes",
    "round_desc_1": "It will be a 2 vs 2 pair. A team will be provided with 45qns . In that 45 qns, 25qns will have Zero as their answer. The participants have to select questions randomly and solve it. ( *no need to solve all the 45qns * ). One who got all zeros within the time limit or one who got more zeros within the time limit will be considered as a winner.",
    "round_title_2": "Fade out the devil",
    "round_desc_2": "Questions (easy to tough) from all the nooks and corners of mathematics are printed in small pieces of paper and filled in a box. Teams which perform good in round 1 are promoted for this round. They have to take the questions randomly from the box and solve it. For every solved question + 20 point. Answered questions will be isolated, they won't be circulated anymore. Every unsolved question will result in - 5 points. They can be returned to the box so that others can solve it.",
    "round_title_3": "Unleash the 'Ramanujan'",
    "round_desc_3": "Only three teams will be finalized from the round 2. Now the teams are split into individuals. Simple addition, subtraction, multiplication, division questions will be given. Calculators and other electronic calculating devices won't be allowed. Small pieces of paper will be provided for calculation.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0004",
    "category": "Brainiac",
    "eventName": "MATH-2-HUNT",
    "contact_mobile_1": "9791974104",
    "contact_mobile_2": "8248159951"
  },
  {
    "contact_name_1": "Anusri.P",
    "contact_name_2": "Abinivesh.G.A",
    "hall": "G block -[ round 1 -G 602 , Round 2 - G 601( for tasks)]",
    "one_line_desc": "An intriguing technical event based on a popular game show, this event tests the knowledge of the  participants in diverse fields such as electronics, programming, mathematics, science and so on. The  participants must use all their technical prowess in order to answer mind-boggling questions and move on  to the next round where their fate is decided by their luck as well as their skills. Spin the wheel, use your  wit to complete the given tasks quick as lightning and compete against your opponents to reach the top of  the scoreboard and win the game!",
    "description": "",
    "round_title_1": "Are you a fan of solving Sudoku and word puzzles? Then this Wordoku-based round is just for you! ",
    "round_desc_1": "Answer the given mind-boggling technical questions to get the required letters for the Wordoku puzzle. ",
    "round_title_2": "A technical twist to the popular game show 'Wheel of Fortune'. Guess the letters for the Hangman-type ",
    "round_desc_2": "questions displayed before you. But before you guess, you must spin the wheel to know your fate. You ",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0005",
    "category": "Management",
    "eventName": "Fortunatrix",
    "contact_mobile_1": "9080424132",
    "contact_mobile_2": "8667466930"
  },
  {
    "contact_name_1": "Naveen Jayakumar A",
    "contact_name_2": "Jeevanand R A",
    "hall": "J313 or J314",
    "one_line_desc": "Are you a Mechanical engineer with passion?, Indian Institution of Industrial Engineering is  coming with an event to show case your core skills!! Participate in the 3 rounds and communicate  your ideas effectively and show case the engineer out of you!!",
    "description": "Are you a Mechanical engineer with passion?, Indian Institution of Industrial Engineering is  coming with an event to show case your core skills!! Participate in the 3 rounds and communicate  your ideas effectively and show case the engineer out of you!!",
    "round_title_1": "MechQuiz",
    "round_desc_1": " Which contains basic Mechanical questions, components name identification, questions about ",
    "round_title_2": "Connectionzz",
    "round_desc_2": " Find out the name of the Mechanical components by connecting the pictures",
    "round_title_3": "Show the engineer out of you",
    "round_desc_3": " Problem statement related to Mechanical is given to the selected candidates and preparation time is ",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0006",
    "category": "Core Engineering",
    "eventName": "Mech Maniacs",
    "contact_mobile_1": "8220312992",
    "contact_mobile_2": "9962711103"
  },
  {
    "contact_name_1": "ELLAKIYAA A",
    "contact_name_2": "GOKUL RAM C",
    "hall": "K-Block 1st floor Civil UG Computer LAB and K-Block 1st floor Civil Seminar Hall",
    "one_line_desc": "Civil engineering association presents you an intriguing event, 'SCAN PLAN AND RECON', an arena where you plan with precision and quote your estimation!",
    "description": "An interesting event to bring out the Civil engineer in you. All you need for this event is knowledge in AutoCAD software, innovative ideas and the talent of justifying your ideas. If you have a knack for all this, Come and grab your opportunities.",
    "round_title_1": "ROUGH SKETCH",
    "round_desc_1": "Participants should prepare a Line sketch for the specified type of building with the",
    "round_title_2": "PLAN.dwg",
    "round_desc_2": "To make a 2-D plan with the drawn line sketch (in ROUND1) in AutoCAD within the",
    "round_title_3": "BUDGET ASSESSMENT",
    "round_desc_3": "In this round the selected participants from the previous round will have to prepare an",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0007",
    "category": "Core Engineering",
    "eventName": "SCAN PLAN AND RECKON",
    "contact_mobile_1": "7598436113",
    "contact_mobile_2": "9361135851"
  },
  {
    "contact_name_1": "Kamalesh KM",
    "contact_name_2": "Tej Asswin S",
    "hall": "G508,G509",
    "one_line_desc": "A chance to unleash the fashion designer within you. The event is of two rounds. A theme should be selected from a given set of themes, then it’s all set. You can start shopping across the various different online shopping sites, but make sure you stick with the given budget for shopping. Show your creative side of creating the best look. After shopping create a costing sheet and collage of the garment by filling it in the given presentation template.",
    "description": "",
    "round_title_1": "In this round the teams should select a theme from a list of given themes and a budget will be given on the spot to all the teams to do shopping. In the given time, start shopping across the various online shopping sites by collecting pictures of the garments/ accessories along with its price. Make sure that, it is within the given budget. Arrange the selected pictures in the given template and also attach the price & link of the garments in the powerpoint or canva template. 15 teams will be short-listed to the final round based on the total look of the garment created and relevance to the given theme.",
    "round_desc_1": "For example, if the given theme is “beach”,the budget is Rs 50000, you have to shop a loose fitted shirt with a boxers along with any other matching components and accessories within the given budget (eg: t-shirts, shoes, coolers, chains etc….)",
    "round_title_2": "",
    "round_desc_2": "This round gives you the stage to explain your ideas. In this round selected teams should present their collected garments and accessories through presentation mode. Presentation should be done within 3 minutes. Judgement will be based on the relevance to given theme, budget spent for the garments and the innovation in styling the look. In addition, the explanations material composition and design elements(print, embridery,etc...) will be awarded with extra points",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0008",
    "category": "Kriyative",
    "eventName": "Pro Shopper",
    "contact_mobile_1": "86677 65257",
    "contact_mobile_2": "80123 26847"
  },
  {
    "contact_name_1": "Ahilesh R Ram",
    "contact_name_2": "Sanjana Ragavan",
    "hall": "G-602",
    "one_line_desc": "Robotics has come a long way, from being a story to reality. The imagination has come a long way to where we are now witnessing AI-driven autonomous machines receiving citizenships as digital humans. The main objectives of robotics are represented by intelligent machines that can assist personage in their day-to-day lives and keep everyone safe and secure. The evolution of robotics can surrogate for humans and replicate human actions. Over the years, robotics and artificial intelligence have made a quantum jump. Our event embodies the same idea into reality by expanding our understanding of robotics and its vast application in various walks of life. The event is specially curated for curious minds interested in the design and modeling of robots. This time-sensitive contest will surely put your minds to the test and scrutinize your passion in this field.",
    "description": "",
    "round_title_1": "",
    "round_desc_1": "The first round is a technical presentation round where the students will be asked to provide the design concept along with the specifications of the components used for the maze following robot . Candidates will be asked to present their work to the judges, and they will be reviewed based on creativity, technical skills, clarity, time management and presentation skills. The event will be conducted for a time duration of 2 hours and the teams must come up with their best work within the time constraint.",
    "round_title_2": "The selected teams will be asked to design and build robot to negotiate a maze in the shortest possible time.",
    "round_desc_2": "The maze-solving robot has to find an escape route by following the walls of the maze. The robot is placed in the far corner of a large, randomly drawn maze consisting of square segments. The goal is to reach the centre of the maze in the fastest time possible, across several attempts. The Robot which will start on the START tile and reach the FINISH tile in the shortest time will be nominated as the winner.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0009",
    "category": "Kriyative",
    "eventName": "Maze Runner",
    "contact_mobile_1": "9047442244",
    "contact_mobile_2": "6369953122"
  },
  {
    "contact_name_1": "Vishaal Harikrishna K",
    "contact_name_2": "Divyashree M",
    "hall": "G 401",
    "one_line_desc": "A team event that will awaken the physics enthusiast in you.",
    "description": "02",
    "round_title_1": "Connection",
    "round_desc_1": "Paper chits containing words related to physics will be placed in a bowl. Each team will get to pick one chit. They have to frame new words from the last letter of the chosen words and so on, much like antakshari. The teams that frame the maximum number of sensible words related to physics, without repetition within the given time will be qualified for the next round.",
    "round_title_2": "Pair Share ",
    "round_desc_2": "Each qualified team will be called to a separate hall in turns, where a concept will be displayed to one team member, who will describe it to the other. The other team member has to identify it. Teams will be ranked based on how many concepts they identify correctly within the given time.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0010",
    "category": "Brainiac",
    "eventName": "PhyzPro",
    "contact_mobile_1": "9486794986",
    "contact_mobile_2": "8554965245"
  },
  {
    "contact_name_1": "Anupama.S",
    "contact_name_2": "Shruthi Rajeshwari G S",
    "hall": "Y301",
    "one_line_desc": "Unlash the power of your engineering expertise and join us for a thought-provoking event and debate on future the future of technology!",
    "description": "Are you an engineering student looking for a new challenge? Then join us for an exciting technical event! TRAZE. This event will give you an opportunity to showcase your skills and gain valuable experience. We promise an engaging, informative, and inspiring experience that will equip our participants with the knowledge and skills needed to excel in their respective fields.",
    "round_title_1": "The first round is an exciting and quiz round with a twist! This event will challenge participants to test their",
    "round_desc_1": "knowledge of the most cutting-edge technology and engineering topics. The twist is that the answers will",
    "round_title_2": "The second round is a fun and exciting debate event. Teams of two will compete against each other in a",
    "round_desc_2": "debate about a topic of their choosing. Each team will have a representative who will be arguing for the",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0011",
    "category": "Gold",
    "eventName": "Traze",
    "contact_mobile_1": "9894480931",
    "contact_mobile_2": "6380455530"
  },
  {
    "contact_name_1": "Nithiin",
    "contact_name_2": "Suvan",
    "hall": "Cc lab",
    "one_line_desc": "A fun filled technica event. It's a Race so don't you dare slacken!",
    "description": "A series of events where you will be judged by how fast you complete it before the others.",
    "round_title_1": "",
    "round_desc_1": "Blind coding: where i will be asked to code a question without access to display of what u are typing. Qualifiers will be based on how fast they can type it correctly.",
    "round_title_2": "",
    "round_desc_2": "Typing, coding and debugging: it will be conducted in ninja warrior style where u will required to complete all the tasks in the given sequence and the qualifiers will be based on the entire time taken",
    "round_title_3": "",
    "round_desc_3": "CS trivia: A quiz on basic and important questions on GitHub and computer science",
    "round_title_4": "",
    "round_desc_4": "Shark tank: Develop a solution for a given problem and pitch the solution to the judges in the most satisfying fasion",
    "eventId": "EVNT0012",
    "category": "Coding",
    "eventName": "Treasure hunt in metaverse",
    "contact_mobile_1": "+91 87602 41337",
    "contact_mobile_2": "+91 86670 95585"
  },
  {
    "contact_name_1": "Dhanushiri D",
    "contact_name_2": "Nandira Devi R",
    "hall": "G304",
    "one_line_desc": "Increase your velocity of pleasure!!  The fast you act, the higher chances to top!",
    "description": "Increase your velocity of pleasure!!  The fast you act, the higher chances to top! The first round tests your responsive time and your rapid ability to solve problem The second round examines your strength in physics and your writing ability",
    "round_title_1": "> Each question is presented for 15 to 20 secs approx. to the participants.",
    "round_desc_1": ">Each participant is given 5 to 10 secs approx. to solve a question.",
    "round_title_2": ">The shortlisted participants are given a case study (in a sheet), for which questions will be asked based on the case study.",
    "round_desc_2": ">Each participant is given 5 min to go through the case study and 10 min to answer the questions asked (questions can be of any type, not particularly MCQ)",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0013",
    "category": "Brainiac",
    "eventName": "Scienza",
    "contact_mobile_1": "6382234992",
    "contact_mobile_2": "7540045233"
  },
  {
    "contact_name_1": "Harinni A R",
    "contact_name_2": "Benson Rayan D",
    "hall": "J311, J313, J314, J413, J414, J415",
    "one_line_desc": "You have the answer. Just get quiet enough to hear it !!!",
    "description": "Forenscist is a team wise event where two rounds will be conducted. The first round will be the selection round which is like to find the imposter in the game within the time limit. Selected teams will further enter the main event of the Forenscist. In second round a plot will be given, the teams should solve the case and find the killer within the time limit.",
    "round_title_1": "",
    "round_desc_1": "A team of three to four members will participate in this round. A theme based room will be set up, where participants will be given to observe the details in the room. Following that the teams will be answering a series of questions based on the theme. The questions will serve as a knockout mode of elimination of the teams and only one of the teams will proceed to the next round.",
    "round_title_2": "",
    "round_desc_2": "In this round the participants are provided with a case file of a crime and are given a chance to interrogate various suspects for a limited duration. The participants are allowed to discuss within themselves and come up with the criminal. The final answer should be reported by completing the case file with all the necessary details.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0014",
    "category": "Kriyative",
    "eventName": "FORENCIST",
    "contact_mobile_1": "7358322522",
    "contact_mobile_2": "9840560365"
  },
  {
    "contact_name_1": "HARINNI A R",
    "contact_name_2": "BENSON RAYAN D",
    "hall": "J 411, J413,  J414,  J415",
    "one_line_desc": "Be the mastermind behind your escape",
    "description": "Come and experience a live escape game which challenges your mind. Imagine a place where you are locked up and to escape this place figure out a way by solving the puzzles. Remember there is no room to escape without solving the puzzle. So are you ready to face this imagination in reality!",
    "round_title_1": "-Teams will be given clues with respect to the number locked locks",
    "round_desc_1": "-The teams are to use the given clues to unlock the certain number of given locks",
    "round_title_2": "- It’s time to capture your kingdom, by fighting with your enemies!",
    "round_desc_2": "- The teams who qualified round 1 are here to capture your kingdom.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0015",
    "category": "Kriyative",
    "eventName": "TRY AND TRUIMPH",
    "contact_mobile_1": "73583 22522",
    "contact_mobile_2": "98405 60365"
  },
  {
    "contact_name_1": "KATHIRAVAN R",
    "contact_name_2": "JANANI M",
    "hall": "K - 404",
    "one_line_desc": "Modelling of the fascinating engineering systems",
    "description": "Hello, avid automobile buddies! Here the Automobile engineering association brings you the event Auto-facsimile. The ideal event to unleash your knowledge and skills of automobiles with 2 rounds of the event with great exposure. The event provides you an opportunity to learn about the car and interact with fellow car geeks. You will get hands-on training in MATLAB and Simulink for modeling the vehicular subsystems. Even if you don't have prior experience, you are most welcome to the event.",
    "round_title_1": "In this round, the participants are tested on their enthusiasm towards automobiles. The participants are given basic automobile questions",
    "round_desc_1": "Arranging the puzzle pieces with respect to the concept.",
    "round_title_2": "",
    "round_desc_2": "The filtered participants will be provided sample models on the usage of MATLAB and Simulink for modeling the vehicular subsystems. Afterward, the problem statements will be provided to the participants. The participants have to create a model based on the problem statement in MATLAB Simulink. The Participant who is producing the viable model will be announced as the winner of the event by the judges based on the marking criteria.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0016",
    "category": "Core Engineering",
    "eventName": "AUTO-FACSIMILE",
    "contact_mobile_1": "6374794318",
    "contact_mobile_2": "93453 43055"
  },
  {
    "contact_name_1": "Nishanth G",
    "contact_name_2": "Thiruvenkata Krishnan B",
    "hall": "M503 and Scava Lab",
    "one_line_desc": "A QR based technical treasure hunt",
    "description": "Think customary treasure hunt without paper chits and witty one liners. In QRack IT there are QR's that must be unlocked using everything from straight forward sorting algorithms to sophisticated decryption strategies. And the combination of all of these hints, cunningly placed, will produce one coherent story.",
    "round_title_1": "",
    "round_desc_1": "It would be a 1 hour  treasure hunt round, the participants would be asked to choose from one of 2 themes. Depending on the theme, the teams would go for a scavenger hunt looking for a QR for their theme, and hold the QR for that in the final round.",
    "round_title_2": "",
    "round_desc_2": "This would be a 90 min round where the first 5 teams to complete the scavenger hunt first will be given a final coding challenge that they would have to solve with the help of the QR they have collected in round one. The teams would be provided with a problem in accordance with their theme.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0017",
    "category": "Coding",
    "eventName": "QRack IT",
    "contact_mobile_1": "8248855632",
    "contact_mobile_2": "9944692114"
  },
  {
    "contact_name_1": "ARJUNRAJ A S",
    "contact_name_2": "ARUNADITHYAN S",
    "hall": "G302",
    "one_line_desc": "Build your 'GREEN' Idea",
    "description": "GREENATORIUM is the event which mainly revolves around the core concept of the association i.e. “green building”. In the above event participants will be explained about the concept of green building and will be asked to design their own green building concept in a creative and innovative way using prescribed software or by conventional way of drawing. Then the participants are asked to present their design to the judge and the best and innovative design will be declared as the winner.",
    "round_title_1": "",
    "round_desc_1": "It will be an interactive group discussion round i.e. all participants will be asked to discuss on sustainable development and green energy (on spot). By this group discussion round participants can express their thoughts on the theme and can come up with innovative and interesting solutions. The students who performed in GD will proceed to next round.",
    "round_title_2": "",
    "round_desc_2": "In round 2 the shortlisted participants are asked to make their own blueprint of the green building using their own innovative thoughts and will be asked to present the same to judges and other participants.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0018",
    "category": "Brainiac",
    "eventName": "GREENATORIUM",
    "contact_mobile_1": "9150070745",
    "contact_mobile_2": "9345569911"
  },
  {
    "contact_name_1": "Yuvakrishna S",
    "contact_name_2": "Mohamed Afsar A",
    "hall": "G601",
    "one_line_desc": "Answer - roll the die - climb the hill",
    "description": 2,
    "round_title_1": "",
    "round_desc_1": "Quiz -  for top 40 members",
    "round_title_2": "",
    "round_desc_2": "Ludo game",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0019",
    "category": "Kriyative",
    "eventName": "Ludovic",
    "contact_mobile_1": "8883594555",
    "contact_mobile_2": "9095705511"
  },
  {
    "contact_name_1": "Naresh Parkav A",
    "contact_name_2": "Ashwin K",
    "hall": "IS Lab ( K Block 4th Floor )",
    "one_line_desc": "The biggest puzzle here is not the problem but the solution.",
    "description": "Show off your problem-solving skills by solving puzzles. Keep your senses sharp to pick any clues to figure your way out to reach the destination. If you and your buddy are comfortable with Command-Line and willing to challenge yourselves, grab a cup of coffee and figure your way out.",
    "round_title_1": "- Capture The Flag Style game",
    "round_desc_1": "- The game is comprised of 5 levels ",
    "round_title_2": "",
    "round_desc_2": "",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0020",
    "category": "Coding",
    "eventName": "CRYPTIQUE",
    "contact_mobile_1": "9500322233",
    "contact_mobile_2": "9087079672"
  },
  {
    "contact_name_1": "Sneha M.",
    "contact_name_2": "Sri Gurunandan R.",
    "hall": "M block CAD lab",
    "one_line_desc": "Pitch in your business idea",
    "description": "Number of rounds -2",
    "round_title_1": "",
    "round_desc_1": "Every team will be given 1 hour time to prepare  presentation for their startup idea. Presentation will be for 15 mins for each team. The contents to be covered will be given on spot in the event",
    "round_title_2": "",
    "round_desc_2": "After 1st presentation,  top 5 startup ideas will be selected and will again do a presentation for their startup logo and in depth details of how they will develop the products. From the top 5, the judge will announce the winner for the best startup idea.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0021",
    "category": "Management",
    "eventName": "The Startup challenge",
    "contact_mobile_1": "9944960771",
    "contact_mobile_2": "6382784499"
  },
  {
    "contact_name_1": "Swasthika Raksambikai",
    "contact_name_2": "Fredrick John J",
    "hall": "IT Main Lab",
    "one_line_desc": "Math-2-hunt is a team event, consisting of three rounds which will surely awaken the young Ramanujan inside everyone. The first round consists of solving a few questions among which zero is the answer for some questions. To win this round, all the zeros should be found. We the Indians are the best at handling Zeros. Round 2 contains Questions filled in a box, every team has to take a question randomly and solve it. It also contains Bonus and Devil questions. Mathematicians don't believe in Devil, they just smash it. Last but not least. Round 3 contains simple mathematical calculations. But the twist is that calculators will not be allowed. Common young mathematicians, unleash the Ramanujan hiding inside you.",
    "description": "FightByte is a 3 round, team based technical event for the coders among you. Starting with a chilling Rapid Quizz for our first round, participants will be tested on the basics of different languages The first round being a warm up round, the second round will test the participants intuition and confidence in their coding skills on a fast-paced blind coding battle. For the finale, it will be an epic CSS battle in which their reverse engineering skills to re-create PNGs with minimal code. Come join us and have fun making memories with your friends!",
    "round_title_1": "Rapid Quizz is a mcq based event where the participants will be tested on various programming languages. An incomplete question is given to the students to predict the missing code in order to obtain the specified output. This warm up round will help the participants relax and boost up for the further rounds. The conditions are as follows",
    "round_desc_1": "1. The teams that solve the maximum questions will be considered",
    "round_title_2": "Blind coding is an event where the participant will not get to look at their code for the entirity of the round. The monitors will be turned off and they will be required to code a given statement. The judging criteria to win this round will be based on the following conditions.",
    "round_desc_2": "1. The team with zero errors will be given the highest preference",
    "round_title_3": "Put to test your Front-end Skills in this glorious battle where you will be competing with the other battlers on the common objective of writing the HTML/CSS code to replicate the given target image in the least code possible.",
    "round_desc_3": "In order to achieve the maximum score in this game, you need to write the HTML/CSS code to achieve the given target design with the least amount of code. The given design can be written with different combinations of CSS concepts you know, but to be the victor, you have to think differently and come up with the appropriate HTML/CSS code for the target that beats the enemy battlers code length.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0022",
    "category": "Coding",
    "eventName": "FightByte",
    "contact_mobile_1": "7373516516",
    "contact_mobile_2": "9952660011"
  },
  {
    "contact_name_1": "A.R.ARUN",
    "contact_name_2": "R. SUNDAR JACOB",
    "hall": "N BLOCK GROUND",
    "one_line_desc": "Explore your Aerodynamics Skills",
    "description": "Aqua Jet, an entertaining event that requires both interest and skills in fabrication with a basic knowledge in aerodynamics, whereby one has to build plastic soft drink bottle that thrust water as a result of pressurized air to propel the rocket upwards.",
    "round_title_1": "The range of the rocket is tested and it has to travel a minimum of 80m.",
    "round_desc_1": "This round is eliminative whereby, only the top teams will proceed to the next stage.",
    "round_title_2": "This round tests the stability of rocket.",
    "round_desc_2": "Two chances will be provided for launching the rocket.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0023",
    "category": "Gold",
    "eventName": "AQUAJET",
    "contact_mobile_1": "9789589682",
    "contact_mobile_2": "7358541682"
  },
  {
    "contact_name_1": "Nandhagopal S",
    "contact_name_2": "Gokulharish M",
    "hall": "G-301",
    "one_line_desc": "Everyone get ready with your kitbags. Yeah, Robo Rush is a bot event. Let's hunt our hidden talents in us, This is the event where you can show your creativity and problem-solving skills to find the solutions for real-time problems, here's your chance to display it!",
    "description": "The goal of the contest is to construct your own robot that satisfies industrial needs. It is an industrial collaborative event where the winners are provided with an internship at Emerald Industries. The contest is to be held in two parts. The first part is that the bot can pick up & carry blocks, pass through obstacles, and push the blocks. The winning criteria are based on the number of blocks carried, the distance successfully pushed, and the time taken. Bot 'dimensions': 30x30x30 cm. Bot weight: less than 10 kg. The second part is to automate the silver idol’s eye-marking process. The bot needs to pick the idols or they can be manually fed at single time. Then, the idol’s eyes were marked by any of the processes without damaging the product. After that, the finished products were collected/gathered along a single side. Automation of the process, marking efficiency, capacity, and weight of the bot, determines the winner.",
    "round_title_1": "",
    "round_desc_1": "As described, the robot should leave the start zone to pick up the block (5x5x5 cm) from the block area1. Carrying the block, the robot must travel through the obstacles and irregular pathway (5 cm of ground clearance is preferable for the bot). After crossing the obstacles, the robot must travel over an inclined bridge, where it should place the block on the top flat surface of the bridge and push it down. Then, the robot must get down from the bridge through the other side for the next cycle. The number of blocks carried, the distance of the blocks pushed and the time taken are criteria for winning. The shortlisted participants can go for round 2.",
    "round_title_2": "",
    "round_desc_2": "In round 2, the robot must pick up the blocks from the block area2 which is at a height of 15 cm and carry it to the bridge by passing through the obstacles followed by pushing. The number of blocks carried from the block area, the distance of the blocks pushed, the time taken are criteria for winning. Incase of draw between two bots, the bot weight and dimensions would be considered for the winning condition.",
    "round_title_3": "Part 2",
    "round_desc_3": "It is the separate category of competition where the bot needs to pick the idols / they can be manually fed at a single time from the stacked up place at a height of 10cm. Then, the idol’s eyes were marked by any of the processes without causing any damage to the product. After that, the finished products were collected/gathered along one side. Automation of the process, marking efficiency, capacity, and weight of the bot, determines the winner.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0024",
    "category": "Gold",
    "eventName": "Robo Rush",
    "contact_mobile_1": "9080905838",
    "contact_mobile_2": "8610128273"
  },
  {
    "contact_name_1": "Vigneshwaran M",
    "contact_name_2": "Parthiban M",
    "hall": "K-403",
    "one_line_desc": "Visualize the data using the CAD and Excel",
    "description": "Attention to all Automobile fanatics! Here the SOCIETY OF AUTOMOTIVE ENGINEERS brings you the event CAD enhance. The ideal event to unleash your knowledge and skills on data visualization and cad modelling with 2 rounds of the event with great exposure. The event provides you an opportunity to learn the cad and data visualization software. You will get hands-on experience in the CAD software during the event. Even if you don't have prior experience, you are most welcome to the event.",
    "round_title_1": "",
    "round_desc_1": "In this round, the participants are given with few sets of data related automotive industry. From that data set, the participants have to create visualizations. The participants will be filtered out for the next round based on the visualizations they created. MS Excel will be used as a tool for visualizations.",
    "round_title_2": "",
    "round_desc_2": "The filtered participants will be provided with 2D engineering drawings of CAD models. The participants have to create the 3D CAD models from the 2D engineering drawings using CAD software. The Participant who is producing the viable model will be announced as the winner of the event by the judges based on the marking criteria.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0025",
    "category": "Core Engineering",
    "eventName": "CAD Enhance",
    "contact_mobile_1": "9942746948",
    "contact_mobile_2": "8778063573"
  },
  {
    "contact_name_1": "M DIVYASHREE",
    "contact_name_2": "KARTHI KEYAN N",
    "hall": "G 305, G306",
    "one_line_desc": "As electricity ⚡️ is the flow of the electric power🔋 /charge, we cordially invite 🙏 the circuit branches 💡to flow their remembrance 📚and ideation faab in our event.",
    "description": "ok",
    "round_title_1": "This round contains 2 parts. In the first part, one participant from each team will be given a sheet which contains 25 elements and they will be given time constraints (90 seconds) to memorize them. They will reveal the elements to their partner who will in turn have to write it down on the sheet of paper provided within the left-out time. ",
    "round_desc_1": "In the latter part the participants are shown 5 circuits, out of which they have to identify the additional components/elements which were not among the 25 elements given in the former part. ",
    "round_title_2": "This round contains 2 parts. In the first part, one participant from each team will be given a sheet which contains 25 elements and they will be given time constraints (90 seconds) to memorize them. They will reveal the elements to their partner who will in turn have to write it down on the sheet of paper provided within the left-out time. ",
    "round_desc_2": "In the latter part the participants are shown 5 circuits, out of which they have to identify the additional components/elements which were not among the 25 elements given in the former part. ",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0026",
    "category": "Management",
    "eventName": "ELECTORAPTORS",
    "contact_mobile_1": "8554965245",
    "contact_mobile_2": "7448452533"
  },
  {
    "contact_name_1": "Sriram A",
    "contact_name_2": "Vishnu P",
    "hall": "G 301",
    "one_line_desc": "Visualise Your Mechanism",
    "description": "American Society of Mechanical Engineers is providing an arena to showcase your intellectual skills and  mastery in Mechanical engineering through ‘Mechanical Maestro’. If you are brave enough to venture out  to showcase your expertise in solving real life problems and articulate the same in the best possible way, do  sign up to prove your mettle.",
    "round_title_1": "All the participants will receive a question paper consisting of 20 questions based on various concepts from ",
    "round_desc_1": "Engineering Graphics. The candidates should answer the same within 20 minutes and another 20 minutes",
    "round_title_2": "The participants who qualify for this round should create any mechanism using the ‘Make-it-Master’ kit and ",
    "round_desc_2": "provide a short presentation about the same without exceeding a duration of 5 minutes and the same would ",
    "round_title_3": "A problem statement would be provided for all the participants and they are expected to submit their solutions ",
    "round_desc_3": "in the form of a poster comprising of freehand sketches and necessary details for establishing a solid ground ",
    "round_title_4": "",
    "round_desc_4": "l.",
    "eventId": "EVNT0027",
    "category": "Core Engineering",
    "eventName": "MECHANICAL Maestro V2.O",
    "contact_mobile_1": "8754766235",
    "contact_mobile_2": "9361457231"
  },
  {
    "contact_name_1": "Subash T",
    "contact_name_2": "Vasanth Raja K",
    "hall": "G-404, G-405",
    "one_line_desc": "The Darwinian game is based upon the theory proposed by British naturalist Charles Darwin in which the fittest among different species will be surviving till the end popularly quoted as 'Survival of the fittest'",
    "description": "A team will be consisting of two heads. A total of four rounds will be conducted. The difficulty level of the quiz will be increasing gradually in the upcoming rounds. The questions will be from the mechanical background.",
    "round_title_1": "",
    "round_desc_1": "Round 1 consists of 10 questions with no lifelines. Out of 40 teams, 30 teams will be selected for the next round.",
    "round_title_2": "",
    "round_desc_2": "The selected 30 will undergo the next round of 10 questions with one lifeline (Phone-A-friend) in hand. If the lifeline was not used bonus points (two points) will be awarded. Out of 30, 20 will be selected to the next round.",
    "round_title_3": "",
    "round_desc_3": "The selected 20 will undergo the next round of 10 questions with two lifelines (Audience vote & Phone-a-friend) in hand. If the lifeline was not used bonus points (four points) will be awarded.",
    "round_title_4": "",
    "round_desc_4": "Final round (Knockout round), the selected 10 will undergo the next round of 10 questions with three lifelines (50-50, Audience vote, Phone-a-friend) in hand. If the lifeline was not used bonus points (six points) will be awarded. Any wrong answers lead to elimination.",
    "eventId": "EVNT0028",
    "category": "Brainiac",
    "eventName": "The Darwinian game",
    "contact_mobile_1": "6382516513",
    "contact_mobile_2": "9894822279"
  },
  {
    "contact_name_1": "R Kavin Aravindhan",
    "contact_name_2": "Bharath Kumar G",
    "hall": "GRD Lab & Software Programming Lab",
    "one_line_desc": "Innovation empowering society",
    "description": "“An invasion of armies can be resisted, but not an idea whose time has come.” We present to you TECHORYX, a hackathon to test your innovative thinking and creational skills! In this hackathon, participants will race against time to build a novel solution to the theme given, in order to claim their spots in the finals, where they will present their ideas to our eminent jury. This hackathon is not for the simple 'minded': the biggest and most enthusiastic minds can make use of this great opportunity to come together and create magic! Come on, let’s ideate, develop products and be the catalysts that bring innovation to the world!",
    "round_title_1": "",
    "round_desc_1": "Participants have to indulge in 5 hours of non-stop programming to develop either a web application or a mobile application based on the problem statement chosen, considering the event rules.",
    "round_title_2": "",
    "round_desc_2": "Shortlisted participants will have to do a 5 – 10-minute demonstration of the application, describing the planning process used to develop and design the application including a pitch for the solution.",
    "round_title_3": "",
    "round_desc_3": "NA",
    "round_title_4": "",
    "round_desc_4": "NA",
    "eventId": "EVNT0029",
    "category": "Coding",
    "eventName": "TECHORYX",
    "contact_mobile_1": "9094998300",
    "contact_mobile_2": "6385567601"
  },
  {
    "contact_name_1": "Abishek K R",
    "contact_name_2": "Pranav Ragav D U",
    "hall": "F201",
    "one_line_desc": "Binge watchers...... ASSEMBLE!!!!!!",
    "description": "Quizpicable Me, an entertaining quiz competition on cinefest. The contestants must have both nerdical and fa(n)ctual knowledge about sci-fi Movies, TV series etc, to outshine others. This quiz tests the technical knowledge related to cinema as well. Gear up for a fun-filled trivia.",
    "round_title_1": "",
    "round_desc_1": "First the prelims in conducted using Quizziz platform. Random screenshots from different movies, series, anime would be shown, and the contestants must choose the movie it belongs to from the given set of options. Top 8 teams would be selected based on scores and are invited to the college for the Finals.",
    "round_title_2": "The final consists of 5 rounds",
    "round_desc_2": "Round 1: “The Order of the Screenings” (Ref. Order of the Phoenix)",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0030",
    "category": "Brainiac",
    "eventName": "Quizpicable me",
    "contact_mobile_1": "9952346262",
    "contact_mobile_2": "8220131208"
  },
  {
    "contact_name_1": "Kavinesh M R",
    "contact_name_2": "Rithish M",
    "hall": "G407 or G405",
    "one_line_desc": "Are you interested in exploring your knowledge in metallurgical domain? Are u ready to invest your quality time to unfold your knowledge?   Hey Meta-minds get ready to explore your metallurgical knowledge through 'Metaract', an exciting event exclusively for you .",
    "description": "Metaract comprises of four rounds which includes technical puzzles, group discussion, timeline, and case studies. It mainly priorities the understanding of the facts of metallurgical domains. This event enhances the critical solutionizing, interpersonal skills, and competitive abilities amongst participants.",
    "round_title_1": "Interference Visuelle (duration: 1hr):",
    "round_desc_1": "A set of five videos each with a maximum duration of 2 minutes will be played regarding any metallurgical processes and techniques. The standard set of six question will be projected for each video. The participants will be given 40 sec to answer a question. Based on the score 65% participants will be taken to next round.",
    "round_title_2": "Discussion de Groupe (duration: 1hr):",
    "round_desc_2": "The participants advanced to this round are split into teams of eight. Each team will be assigned a topic related to metallurgy and will be allowed to discuss for 10 mins. A faculty will be present at the time of discussion to evaluate their performance based on technical knowledge, way of expression (body language, interpersonal skill), tolerance. 80% weightage will be given to the technical knowledge and the remaining 10% is given to their way of expression and tolerance. Three participants from each team will be screened to proceed to the next level. Based on the score 38% participants will be advanced to the next round.",
    "round_title_3": "Avancement (duration: 35 min):",
    "round_desc_3": "This round involves the students to arrange a jumbled set of process in the timeline. Participants will be split into teams of three. Each team will be given a set of three questions and are expected to sequence it correctly. Each participant from a team will be selected to proceed to the next level. Based on the score 34% participants will be advanced to the next round.",
    "round_title_4": "Scruter (duration: 1 hr):",
    "round_desc_4": "This is where the participants are given current problematic error overcoming situations. From which they must analyse the problem and get the idea to solve a circumstantial crisis. They will be given 10 min to think, 15 mins to document their solution and 5 mins to present their report. Based on the conceptual understanding, solution, presentation skills judges will select the suitable candidate as winner.",
    "eventId": "EVNT0031",
    "category": "Management",
    "eventName": "Metaract",
    "contact_mobile_1": "9361357737",
    "contact_mobile_2": "9944521395"
  },
  {
    "contact_name_1": "Kamalesh K M",
    "contact_name_2": "Tej Asswin S",
    "hall": "G509",
    "one_line_desc": "“UNLEASH THE SHOPPER IN YOU”",
    "description": "An event which evokes a sense of mystery, elegance, opulence and become the character of your dreams. Bring your shadow of the dark and showcase your creativity through mask styling. This would be a event which has creative rounds that will make you involved in creating your own fashion. Surf across various internet sources finds different style and create your own look by collaging them. Its consists of three rounds quiz, pro-shopper and masquerade. Each round tests your fashion sense and proper usage of elements and principles of design.",
    "round_title_1": "",
    "round_desc_1": "It is a quick quiz round (buzzer based), in which 40 questions will be displayed to the participants. The questions will be based on the fashion elements used on the garments, fashion styles and the fashion brands around the globe. Questions with star mark will contain more weight-age than the normal ones. Totally 20 teams will be selected for the next round. For tie breaker, separate round will be conducted for the teams (team’s star question’s answers will also be considered for this round).",
    "round_title_2": "In this round the participant should select a theme by themselves. In the given time start shopping across the various different online shopping sites. Makes sure that it is within the given the budget. Arrange the selected garments in the given template, also attach the price and link of the garment along with the template which will be given as a power point template or Canva template. The participants will be short-listed (around 10 teams) to the final round based on look and relevance of the garment to the theme.",
    "round_desc_2": "For example, if the theme is “beach”. The look can be of a loose fitted shirt with a boxers matched with a bright sunglasses.",
    "round_title_3": "",
    "round_desc_3": "10 selected teams will be provided with a plain A3 sized cardboard along with A3 sheets, scissors, glue, basic colours paint set and a brush. Participants can also use any other surface embellishments, colours (eg: acrylic/poster colours) for the mask creation. Mask can be created either in the form of full face mask or partial type mask (masquerade / breathing mask). All teams should complete the mask creation within an hour and it should be displayed at the end of the event. Judgement will be based on the creativity imparted in the design along with its complexity (design type, style complexity and the final look of the mask).",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0032",
    "category": "Kriyative",
    "eventName": "Pro-Shopper",
    "contact_mobile_1": "8667765257",
    "contact_mobile_2": "8012326847"
  },
  {
    "contact_name_1": "Dharanesh D",
    "contact_name_2": "Janani T",
    "hall": "Y 302",
    "one_line_desc": "The battle for 3s for the 4 th.      1C - cogitation , 2C - creativity, 3C - careful analysis for the 4 C - Champion .",
    "description": "During the first round , all participants will be given a crossword puzzle to solve in 20 minutes while answering technical questions. The top twenty teams will advance to the next  round. Round 2 delves into matching of famous tag lines with the products. The top ten teams will advance to the next round. Round 3 delves into marketing strategies for effectively advertising a given product. Come and join for us for this event to demonstrate your puzzle solving abilities and creativity in handling the given task.",
    "round_title_1": "",
    "round_desc_1": "Round 1 is based on puzzle solving. The technical questions will be asked and then the participants need to fit the answers in the given boxes and he needs to come up with the same alphabet if the alphabets are overlapped by the consequent questions. Top twenty teams will be selected for second round. Each question carries 1 marks .",
    "round_title_2": "",
    "round_desc_2": "Round 2 is based on finding tag line for the given products. Twenty products along with some famous tag line will be given to the participants. One who matches the tagline with the products will be qualified for next round . Top ten teams will be selected for third round .",
    "round_title_3": "",
    "round_desc_3": "Round 3 is about how the participants find new marketing skills to the particular product give by us . The judge will decide the winners , one who gives the new way of advertisement to the particular product.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0033",
    "category": "Gold",
    "eventName": "Tech-zap",
    "contact_mobile_1": "8778591254",
    "contact_mobile_2": "6381996676"
  },
  {
    "contact_name_1": "Rahul Prashanth",
    "contact_name_2": "Thirumurugan S",
    "hall": "G402",
    "one_line_desc": "FUTECH is an event based on electronics. This will test your analytic skill and hasty execution in that domain.",
    "description": "FUTECH as two technical and fun rounds, 1st you gotta solve some simple tricky question for a cross word puzzle then do a quick dare in between. People who did well, welcome to the 2nd round of FUTECH! The real fun of exploring partnership, communication and critical thinking when facing a technical problem.",
    "round_title_1": "",
    "round_desc_1": "The Participants will be given 1st set of questions which will fetch answers to the crossword puzzle then for the 2nd set of questions the teams will be given a simple dare which they have to do. Then the participants can finish the cross words. Based on the number of right answers, the time taken and how well they do the dare without hesitation. Marks will be awarded and eligible teams will be participating in 2nd round.",
    "round_title_2": "",
    "round_desc_2": "In this round, the participants will be tested on their analytical skills, communication and team spirit. From the team of two. One person from each team will be given a question according to which he/she has to build/draw an easy circuit based on the required output mentioned in the question paper. Then this circuit has to be conveyed to their respective teammate by physically mapping it on the floor (by walking in different directions marking the wires and placing the electronic components at a point/node by the given hand gestures). Then this mimed circuit map has to be closely analysed and drawn by the other teammate on the given pencil & paper. With the degree of closeness to the original circuit, the participants will be given marks and ranked accordingly by the covenors and judge.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0034",
    "category": "Circuit",
    "eventName": "FUTECH",
    "contact_mobile_1": "9101180943",
    "contact_mobile_2": "9894317044"
  },
  {
    "contact_name_1": "D Praneka",
    "contact_name_2": "Dhanushiri D",
    "hall": "G304",
    "one_line_desc": "Increase your velocity of pleasure!!  The fast you act, the higher chances to top!",
    "description": "Increase your velocity of pleasure!!  The fast you act, the higher chances to top! The first round tests your responsive time and your rapid ability to solve problem. The second round examines your strength in general science (physics and chemistry) and your  writing ability.",
    "round_title_1": "● Each question is presented for 15 to 20 seconds approximately to the participants.",
    "round_desc_1": "● Each participant is given 5 to 10 seconds approximately to solve a question.",
    "round_title_2": "● The shortlisted participants are given a case study (in a sheet), for which questions ",
    "round_desc_2": "will be asked based on the case study.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0035",
    "category": "Brainiac",
    "eventName": "Scienza",
    "contact_mobile_1": "8428865555",
    "contact_mobile_2": "6382234992"
  },
  {
    "contact_name_1": "Dineashkumar B",
    "contact_name_2": "Abhishek M B",
    "hall": "G401",
    "one_line_desc": "This will be a technical competition that attempts to develop young people's tech knowledge over a series of three rounds that will grow progressively harder and more engaging.",
    "description": "This is a technical event that aims to bring out the tech savvy in young minds. the event comprises of three rounds, which consecutively gets more challenging. All the rounds are engineered to accommodate participants from all technical departments, however prior knowledge in physics, Science or Coding is a prerequisite to the participants in the event",
    "round_title_1": "",
    "round_desc_1": "Participants are given multiple choice questions which are divided into three different sections; namely Quantitative based, Aptitude based and Coding based respectively. This round will be an elimination round where the general crowd will be filtered to find the tech savvy",
    "round_title_2": "",
    "round_desc_2": "In round 2 participants will have two options they can either select Coding question paper where they have to optimize frivolous and inefficient codes to meet the criteria or they could select Technical question paper where they must simplify the given circuits such that they consume less power and also give an optimal output",
    "round_title_3": "",
    "round_desc_3": "A list of inventions will be displayed and each participant will have to choose 5 inventions. A sheet with the facts about their respective selections will be given to the participants. Every participant have to give 3 statements; 2 false and 1 fact with respect to their selected invention while the other participants have to find which statement is true. The winner is the one who identified the most number of facts",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0036",
    "category": "Gold",
    "eventName": "ProTech",
    "contact_mobile_1": "9361079789",
    "contact_mobile_2": "9345472545"
  }
]
