[
  {
    "eventName": "Technozarre",
    "category": "Circuit",
    "one_line_desc": "Carve out your inner skills and test your knowledge on circuits.",
    "description": "An amazing technical event filled with fun and enthusiasm which carves out your inner skills and tests your knowledge on circuits. Ready for the event? Indulge yourself in the electrifying and fascinating event laden with tricky puzzles and riddles.",
    "round_title_1": "Round 1",
    "round_desc_1": "Participants will be given 15 technical questions in a paper.The questions can be in the format of quizzes, crossword puzzles etc.Answers for every question will be coded into some format and a map containing it will be given.Participants have to find the correct location using the code and map it in the given map.",
    "round_title_2": "Round 2",
    "round_desc_2": "The participants will be given a set of questions. The circuits with missing component, tricky riddles can be the questions.After finding answers from each question, they have to find a codeword as per the rules.From the codeword, they will have to build the circuit using the given components.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0000",
    "contact_name_1": "Sree Subhiksha M K",
    "contact_mobile_1": 9655212171,
    "contact_name_2": "Mavikka S",
    "contact_mobile_2": 9629201942,
    "hall": "G501 G502",
    "eventRules": "A team of 2 can participate in this event.(Minimum- 2 , Maximum - 2)\nParticipants should strictly adhere to the time limit.\nParticipants are not allowed to use the smartphones during the event.\nParticipants are not encouraged for any forms of malpractice.",
    "teamSize": "2",
    "date": "25",
    "timing": "9:30 AM - 12:30 PM",
    "closed": false
  },
  {
    "eventName": "Quest for Avians",
    "category": "Kriyative",
    "one_line_desc": "Off the ground, around the world, we roam!!",
    "description": "Here is a new event to showcase your knowledge of air vehicles. To all the future aviators out there, come and join us to flaunt your aeronautical knowledge and design skills.",
    "round_title_1": "PicTalk",
    "round_desc_1": "The participants will see a picture relating to aeronautical. Within three minutes, the participants must identify the image and provide a description of it. Each participant will get different pictures. There won't be any elimination",
    "round_title_2": "Parachute Creative model",
    "round_desc_2": "Learning about gravity and air resistance with parachutes is quite beneficial. They are also a fantastic way to kill time, particularly once you start experimenting with various weights and sizes. Why not attempt a bigger, more complex parachute instead if you already know how to create a small one? Participants will receive oil paper, thread, scissors, and 20*20 mm wooden blocks. Participants must assemble a parachute that will be tested using these. Each participant's flying time will be recorded.",
    "round_title_3": "Design your aircraft model",
    "round_desc_3": "Mech“Creative solution for creative ideas” Come on it’s time to unleash your designing skills and show us the magic of your creation. A 2D part drawing (Aircraft) will be displayed on the screen and the participants will have to create a 3d model using CAD software at their convenience. Time limit is 1 hour.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0002",
    "contact_name_1": "Arvind V",
    "contact_mobile_1": 6381657824,
    "contact_name_2": "Madhav N",
    "contact_mobile_2": 7606882547,
    "hall": "J310, J311, K-Block Mech CAE Lab",
    "eventRules": "Individual Participants",
    "teamSize": "1",
    "date": "24",
    "timing": "9:00 AM - 1:30 PM",
    "closed": false
  },
  {
    "eventName": "MasterMinds",
    "category": "Brainiac",
    "one_line_desc": "Sew or tack. Build the armour.",
    "description": "Draft your leanings to spun your Knowledge            Do you have a keen interest towards textiles.Then this event is for you! This event is mainly designed to test the technical knowledge on textiles and also helps to attain the knowledge. It is a team play with maximum of 2 members. This event totally consist of four rounds Quizzle & LogoGrab , Gamble your knowledge, Rebus with Machine and Tap & Talk.",
    "round_title_1": "Quizzle & LogoGrab",
    "round_desc_1": "Quizzle contains a wide range of questions which may include multiple choice questions, filling the blanks, cross word puzzle and assertion & reason. It has 30 questions and participants have to complete it within 25 minutes. A set of incomplete logos and set of clues about several clothing brands will be shown to the participants along with a set of clues. The participants are to find the appropriate brand logo within the stipulated time of 1 minute per logo.",
    "round_title_2": "Gamble your Knowledge",
    "round_desc_2": "Gamble your Knowledge is a round where you can challenge your knowledge against your opponent. In this, opponent of every team will be chosen randomly and the team who has to challenge will be chosen by tossing the coin. The question will be given and toss won team will challenge the opponent and should answer within the time.",
    "round_title_3": "Rebus with machine",
    "round_desc_3": "The picture of the machine is given to the participants as a jigsaw puzzle and they should solve it. After solving, participants should explain about that machine and its process for few minutes and should answer the question being asked.",
    "round_title_4": "Tap & Talk",
    "round_desc_4": "Tap & talk is a rapid fire round with advanced technical questions. In this round, the question will be displayed and the participants will tap the buzzer and answer the question. Negative marks will be given to every wrong answer and the opportunity will be passed to the team who pressed the buzzer secondly.",
    "eventId": "EVNT0003",
    "contact_name_1": "Golbert S",
    "contact_mobile_1": 9585756505,
    "contact_name_2": "Boopalan S",
    "contact_mobile_2": 6380173346,
    "hall": "G309",
    "eventRules": "Participants should have their college ID card.\nParticipants should keep up timing for every round.\nParticipants involving in malpractice are directly disqualified.\nDiscussion with other teams are strictly not allowed.",
    "teamSize": "1 - 2",
    "date": "24",
    "timing": "9.30 AM - 1.30 PM",
    "closed": false
  },
  {
    "eventName": "MATH - 2 - HUNT",
    "category": "Brainiac",
    "one_line_desc": "Mathematicians don't believe in Devil, they just smash it",
    "description": "Math-2-hunt is a team event, consisting of three rounds which will surely awaken the young Ramanujan inside everyone. The first round consists of solving a few questions among which zero is the answer for some questions. To win this round, all the zeros should be found. We the Indians are the best at handling Zeros. Round 2 contains Questions filled in a box, every team has to take a question randomly and solve it. It also contains Bonus and Devil questions.  Mathematicians don't believe in Devil, they just smash it.   Last but not least. Round 3 contains simple mathematical calculations. But the twist is that calculators will not be allowed. Common young mathematicians, unleash the Ramanujan hiding inside you.",
    "round_title_1": "Zeros makes you heroes",
    "round_desc_1": "It will be a 2 vs 2 pair. A team will be provided with 45 questions . In that 45 questions, 25 questions will have Zero as their answer. The participants have to select questions randomly and solve it. ( *no need to solve all the 45 questions * ). One who got all zeros within the time limit or one who got more zeros within the time limit will be considered as a winner.",
    "round_title_2": "Fade out the devil",
    "round_desc_2": "Questions (easy to tough) from all the nooks and corners of mathematics are printed in small pieces of paper and filled in a box. Teams which perform good in round 1 are promoted for this round. They have to take the questions randomly from the box and solve it. For every solved question +20 point. Answered questions will be isolated, they won't be circulated anymore. Every unsolved question will result in -5 points. They can be returned to the box so that others can solve it. Among them, few questions will have a RAM logo in them, which will be a bonus question. They carry 100 points each. Few will have other logos like, Devil questions. If they solve it, there will be no problem, else they will lose 50 points. Within the limited time, teams with highest points will be eligible for next rounds.",
    "round_title_3": "Unleash the 'Ramanujan'",
    "round_desc_3": "Only three teams will be finalized from the round 2. Now the teams are split into individuals. Simple addition, subtraction, multiplication, division questions will be given. Calculators and other electronic calculating devices won't be allowed. Small pieces of paper will be provided for calculation. Only using mind calculation, they have to solve it. Based on the time taken to solve all the given questions, the first three will be selected as winners.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0004",
    "contact_name_1": "JAYA SRI DHARAN M",
    "contact_mobile_1": 9791974104,
    "contact_name_2": "PAVITHRA B",
    "contact_mobile_2": 8248159951,
    "hall": "J – 410,411,412",
    "eventRules": "",
    "teamSize": "2",
    "date": "26",
    "timing": "9.30 AM - 1.00 PM",
    "closed": false
  },
  {
    "eventName": "Fortunatrix",
    "category": "Management",
    "one_line_desc": "Hey techies,Spin and win  the game using your technical expertise",
    "description": "An intriguing technical event based on a popular game show, this event tests the knowledge of the  participants in diverse fields such as electronics, programming, mathematics, science and so on. The  participants must use all their technical prowess in order to answer mind-boggling questions. Spin the wheel, use your  wit to complete the given tasks quick as lightning and compete against your opponents to reach the top of  the scoreboard and win the game!",
    "round_title_1": "Round 1",
    "round_desc_1": "Are you a fan of solving Sudoku and word puzzles? Then this Wordoku-based round is just for you! Answer the given mind-boggling technical questions to get the required letters for the Wordoku puzzle.Solve the puzzle correctly using the obtained letters, find the secret keyword and ace this round to move on to the next.",
    "round_title_2": "Round 2",
    "round_desc_2": "A technical twist to the popular game show 'Wheel of Fortune'. Guess the letters for the Hangman-type questions displayed before you. But before you guess, you must spin the wheel to know your fate. You might win points or may have to do tasks or even go bankrupt. Answer as many questions as you can and promptly complete the perplexing tasks to win points and get crowned as the winner!",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0005",
    "contact_name_1": "Anusri P",
    "contact_mobile_1": 9080424132,
    "contact_name_2": "Abinivesh G A",
    "contact_mobile_2": 8667466930,
    "hall": "G 601 G 602",
    "eventRules": "Participants should strictly adhere to the time limit.\nParticipants are strictly prohibited from using the internet.\nParticipants are advised not to indulge in any form of malpractice.\nDecision of the convenors/ judges will stand final.",
    "teamSize": "2",
    "date": "24",
    "timing": "9:30 AM - 12:30 PM",
    "closed": false
  },
  {
    "eventName": "MechManiacs",
    "category": "Core Engineering",
    "one_line_desc": "Showcase the engineer out of you!!",
    "description": "Eat, Work, Sleep, Repeat. This is what boring Engineers do, Instead Let's have some FUN! Are you the Mechanical engineer with passion? Let's play some game…….Participate in the 2 rounds and communicate your ideas effectively and showcase the engineer out of you.Let the game begin……..",
    "round_title_1": "MechQuiz",
    "round_desc_1": "Which contains basic entry level Mechanical questions, components name identification, questions about some popular and famous manufacturers and also find out the name of the mechanical components by connecting the pictures",
    "round_title_2": "Show the engineer out of you",
    "round_desc_2": "Problem statement related to Mechanical engineering is given to the selected candidates and preparation time is given to them. Each needs to present their own idea in front of everyone",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0006",
    "contact_name_1": "Naveen Jayakumar A",
    "contact_mobile_1": 8220312992,
    "contact_name_2": "Sri Charan",
    "contact_mobile_2": 9994526005,
    "hall": "J310 or J311",
    "eventRules": "Registered Participants may come with Laptop if available.\nJudges Decisions are final.\nStudents must attend the event with their College ID Card.\nUsage of Mobile phones is strictly prohibited during the conduction of the event.",
    "teamSize": "1",
    "date": "26",
    "timing": "9:30 AM - 12:30 PM",
    "closed": false
  },
  {
    "eventName": "SCAN, PLAN AND RECKON",
    "category": "Core Engineering",
    "one_line_desc": "Plan with precision and quote your estimation!",
    "description": "An interesting event to bring out the Civil engineer in you, 'SCAN PLAN AND RECKON'.All you need for this event is knowledge in AutoCAD software, innovative ideas and the talent of justifying your ideas. If you have a knack for all this, Come and grab your opportunities.",
    "round_title_1": "ROUGH SKETCH",
    "round_desc_1": "Participants should prepare a Line sketch for the specified type of building with the specifications provided(eg. Area of the plot, size of the rooms) and it should contain the necessary data for making a 2-D Plan in AutoCAD by following the NBC guidelines.",
    "round_title_2": "PLAN.dwg",
    "round_desc_2": "To make a 2-D plan with the drawn line sketch (in ROUND 1) in AutoCAD within the given time (45 mins) with all data for the construction with accurate dimensioning and using layers. Decorative blocks are not necessary, may be provided for appearance. Completing the plan fully before the given time will be appreciated.",
    "round_title_3": "BUDGET ASSESSMENT",
    "round_desc_3": "In this round the selected participants from the previous round will have to prepare an approximate estimation and an impressive pitch of their proposed plan as a contractor with maximum utility to impress the judges and to be crowned as winners. The cost per unit area of the materials to be used will be provided, by efficiently using the materials for the building. The estimation should be prepared without negotiating the quality of the building. Participants should present their estimate and justify the use of materials.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0007",
    "contact_name_1": "ELLAKIYAA A",
    "contact_mobile_1": 7598436113,
    "contact_name_2": "GOKUL RAM C",
    "contact_mobile_2": 9361135851,
    "hall": "K-Block 1st Floor Civil UG Comp Lab & Seminar Hall",
    "eventRules": "Participants are advised to come with laptop, if not computers with autocad version 2007 will only be provided.\nTime based events and rounds will be conducted on elimination basis.\nJudges decisions will be final.",
    "teamSize": "2 - 3",
    "date": "25",
    "timing": "9:30 AM - 3:00 PM",
    "closed": false
  },
  {
    "eventName": "Electri - Warz",
    "one_line_desc": "UNLEASH THE SHOPPER IN YOU",
    "description": "Looking for some festivity? Here you have fun filling rounds infused with technical ideas. In this technical event, kicking off the event’s round with some rejoicing tasks. The rounds will be of time based in which the participants should complete the questions in the specified timeline. All the rounds have intermediate technical questions steeped with.",
    "round_title_1": "Round 1",
    "round_desc_1": "A time based and fascinating round where you get to test your knowledge in our innovative 'world'! Big will not beat small anymore. Fast will be beating the slow”.How fast can you capture a picture in your mind?!!! Here is a game to find a needle in a haystack. Participants are asked to find a given component present inside a bunch of things within a given span of time. Are you good at solving your life problems? it's always ups and downs and here it is just across and down in crosswords. Along with the pictorial questions, crosswords are also given which are to be solved within the given time. Altogether based on scores and time the top 10 participants will be called for the next round.",
    "round_title_2": "Round 2",
    "round_desc_2": "Starting with the implementation, the best workout program available for real results is circuit design. Round 2 is a circuit based round. First 10 teams from the first round will participate in this round. \nIn this round, a simple circuit will be displayed to the participants. In the circuits, every component will be displayed one by one for a time limit and it will disappear. Participants will be asked questions from the displayed circuit. Totally 10 circuits will be in this round and the participants will undergo bidding. Participants are asked to bid their points to answer the question. Each team will be provided with certain points to start bidding. In case if the highest bidded team answers wrongly, bidded points will be deducted. Eventually the next highest team will get the chance to answer. Team with higher points will be selected as the winner.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0008",
    "contact_name_1": "Madhavan H",
    "contact_mobile_1": "9360738913",
    "contact_name_2": "Sandhiyaa K",
    "contact_mobile_2": "9025047396",
    "hall": "G-506, 507, 508",
    "eventRules": "50 points will be provided for each team. Each question carries a certain number of points. \nTiming for the bidding will be 60 sec for each question. \nEach team can bid for only one point at a time i.e. jump limit of point while bidding is 1 point.\nAfter the timing, teams cannot bid and one who bidded highest point at the end of 60th sec the team will be considered as the highest bid for the question. \nFor the first 5 circuits, teams will be asked to bid after the questions displayed, from 6th circuit after the completion of bidding the questions will be displayed. \nFor 6th, 7th and 8th circuit the keyword of the question will be displayed first and followed by bidding. \nFor the 9th and 10th circuit, the bidding will be completed before displaying the questions.\nIf the team answers correctly the point of the question will be added to the existing points of the team. for example, if a team having 40 points bid for 10 points and answers correctly to a question which carries 3 points, then the 3 points will be added to the existing 40 and the team will have 43 points \nIf the team answers incorrectly the bidded amount will be deducted from the existing point. If a team having 40 points bid for 10 points and answers incorrectly to a question which carries 3 points, then the bidded point(10) will be deducted and will be at 30 points.\nIf any two teams have scored same points, there will be a tie breaker question based on the answer of the question the winners will be selected. ",
    "category": "Circuit",
    "teamSize": "2",
    "date": "26",
    "timing": "10:00 AM - 4:00 PM",
    "closed": false
  },
  {
    "eventName": "Maze Runner",
    "category": "Gold",
    "one_line_desc": "Maze- Runner is for curious minds interested in designing and modeling robots through a time-sensitive contest.",
    "description": "Robotics has come a long way, from being a story to reality. The imagination has come a long way to where we are now witnessing AI-driven autonomous machines receiving citizenships as digital humans. The main objectives of robotics are represented by intelligent machines that can assist personage in their day-to-day lives and keep everyone safe and secure. The evolution of robotics can surrogate for humans and replicate human actions. Over the years, robotics and artificial intelligence have made a quantum jump. Our event embodies the same idea into reality by expanding our understanding of robotics and its vast application in various walks of life. The event is specially curated for curious minds interested in the design and modeling of robots. This time-sensitive contest will surely put your minds to the test and scrutinize your passion in this field.",
    "round_title_1": "Round 1",
    "round_desc_1": "The first round is a technical presentation round where the students will be asked to provide the design concept along with the specifications of the components used for the maze following the robot. Candidates will be asked to present their work to the judges, and they will be reviewed based on creativity, technical skills, clarity, time management and presentation skills.",
    "round_title_2": "Round 2",
    "round_desc_2": "The selected teams will be asked to design and build robot to negotiate a maze in the shortest possible time. The maze-solving robot has to find an escape route by following the walls of the maze. The robot is placed in the far corner of a large, randomly drawn maze consisting of square segments. The goal is to reach the centre of the maze in the fastest time possible, across several attempts. The Robot which will start on the START tile and reach the FINISH tile in the shortest time will be nominated as the winner.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0009",
    "contact_name_1": "Ahilesh R Ram",
    "contact_mobile_1": 9047442244,
    "contact_name_2": "Sanjana Raghavan",
    "contact_mobile_2": 6369953122,
    "hall": "G-602",
    "eventRules": " Round 1\nEach team can have a minimum of 1 and a maximum of 4 members\n Participants should be present in the informed venue before or on time.\n The participants will be given 15 minutes for presenting their idea which will be followed by a 5- minute question-and-answer session.\n Implementation of the robot via simulation or model will be an added credit\n Usage of internet resources is allowed however direct plagiarism of ideas is strictly prohibited.\n The decision of the judges will be deemed final and no correspondence will be entered into . \n Round 2 \nThe bot must be completely autonomous, no human involvement is allowed in any of the tasks.\n The controller unit should be embedded in the robot and cannot be placed outside the robot.\n The robot should be battery operated\n The robot shall not leave any part of its body behind while navigating the maze.\n The robot shall not jump over, fly over, climb, scratch, cut, burn, mark, damage, or destroy the walls of the maze.\nThe robot shall not be larger either in length or in width than the dimensions of the maze(20cm)",
    "teamSize": "1 - 4",
    "date": "26",
    "timing": "9:00 AM - 4:00 PM",
    "closed": true
  },
  {
    "eventName": "PhyzPro",
    "category": "Brainiac",
    "one_line_desc": "A team event that will awaken the physics enthusiast in you.",
    "description": "PhyzPro is a team event consisting two rounds which will take you through the expanse of physics. Round one is a fun event where every team must pick a chit containing a word related to physics. A new word, related to physics, is to be framed from the last letter of the chosen word, much like antakshari. In the second round, the qualified teams will be displayed a phenomenon related to physics. All teams may guess the answer and will be graded based on the accuracy of the answer. The team that gives the best answer will get all the points auctioned for the question.",
    "round_title_1": "Connection",
    "round_desc_1": "Paper chits containing words related to physics will be placed in a bowl. Each team will get to pick one chit. They have to frame new words from the last letter of the chosen words and so on, much like antakshari. The teams that frame the maximum number of sensible words related to physics, without repetition within the given time will be qualified for the next round.",
    "round_title_2": "Auction Bridge",
    "round_desc_2": "An everyday phenomenon will be displayed to all the teams and every team can take their guesses to identify it. Points will be awarded for every close and related guess. The team that guesses the most accurate answer will be awarded all the points that were given for the close guesses. The teams will be ranked based on the points they have by the end of the auction",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0010",
    "contact_name_1": "Dharini N",
    "contact_mobile_1": 8807474027,
    "contact_name_2": "Alfred Melwin S",
    "contact_mobile_2": 9361230385,
    "hall": "G 401",
    "eventRules": "Participants should not try to copy from the other participants.\nParticipants should not repeat words in their team answer.\nNo usage of electronic gadgets.",
    "teamSize": "2",
    "date": "25",
    "timing": "10:00 AM - 12:00 PM",
    "closed": false
  },
  {
    "eventName": "Traze",
    "category": "Management",
    "one_line_desc": "Unleash your elocution skills on the future of technology",
    "description": "Are you an engineering student looking for a new challenge? Then join us for an exciting technical event! TRAZE. This event will give you an opportunity to showcase your skills and gain valuable experience. We promise an engaging, informative, and inspiring experience that will equip our participants with the knowledge and skills needed to excel in their respective fields.",
    "round_title_1": "Connect the Dots!",
    "round_desc_1": "The first round is an exciting and quiz round with a twist! This event will challenge participants to test their knowledge of the most cutting-edge technology and engineering topics. The twist is that the answers will be drawn as patterns rather than simply being marked. Teams of two will compete against each other to answer questions on everything from coding languages to the latest in engineering advancements. The top five teams will move on to round two, and all participants will gain a greater understanding of the technology and engineering fields.",
    "round_title_2": "Face 2 Face",
    "round_desc_2": "The second round is a fun and exciting debate event. Teams of two will compete against each other in a debate about a topic of their choosing. Each team will have a representative who will be arguing for the topic, and a representative who will be arguing against it. The topics will be chosen on the spot, so participants need to be prepared to think on their feet.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0011",
    "contact_name_1": "Anupama.S",
    "contact_mobile_1": 9894480931,
    "contact_name_2": "Shruthi Rajeshwari G S",
    "contact_mobile_2": 6380455530,
    "hall": "Y301",
    "eventRules": "All participants must register for the event prior to the commencement of the first round.\nAll participants must adhere to the rules and regulations of the event.\nThe first round of the event will be a quiz. All participants must answer the questions within the allotted time. Usage of mobile phones is restricted in the first round.\nThe second round of the event will be a debate. All participants must present their arguments logically and in a manner that is respectful to all participants.\nAny form of malpractice will not be entertained and participants engaging in such activities will be disqualified.\nAll participants must adhere to the instructions of the judges throughout the event.\nWinners will be decided based on their performance in second round.",
    "teamSize": "2",
    "date": "26",
    "timing": "1:30 PM - 4:00 PM",
    "closed": false
  },
  {
    "eventName": "Treasure hunt in metaverse",
    "category": "Coding",
    "one_line_desc": "A fun filled technical event. It's a Race so don't you dare slacken!",
    "description": "This is a technical treasure hunt based on computer science fundamentals where participants have to navigate through the Metaverse (gather town) with their video and audio turned on to perform tasks like coding, debugging, typing contest, blind coding and all sorts of unique and interesting tasks to find the treasure in Metaverse. There will be a Ninja Warrior Style round to complete tasks like speed typing, coding, debugging etc. In the final round, participants will have to propose an app/website to solve given real world problem. Within the given time participants have to prepare and pitch the idea (shark tank style). This will be a perfect blend of technical and non-technical event. The participants have to form teams of 2-3 members.",
    "round_title_1": "Blind coding",
    "round_desc_1": " Participants will have to type the code for a given simple program without looking at what they type. If there are any syntax errors or typos, you have to start over again. teams with the shortest time to complete the task will qualify for the next round",
    "round_title_2": "Open Source Trivia",
    "round_desc_2": "Participants will have to answer questions based on open source projects embedded in each table in the metaverse. teams will have to navigate through the metaverse to answer all the given questions. Teams with the highest score and shortest time will qualify for the next round",
    "round_title_3": "Typing, Coding, Debugging, Version control and other tasks ( Ninja Warrior style )",
    "round_desc_3": "Participants will be given all the above mentioned tasks which will appear when they clone, commit, push to a repository in GitHub. Teams have to finish it as fast as possible. Every teams's time will be recorded.",
    "round_title_4": "Propose an app idea for the theme ( Shark tank Style )",
    "round_desc_4": "A unique problem statement will be given to every team and they will be provided time to discuss and think about solving the problem using an app/website. What are the unique features the app will have? How will they build the proposed app?.",
    "eventId": "EVNT0012",
    "contact_name_1": "Nithiin Kathiresan",
    "contact_mobile_1": "8760241337",
    "contact_name_2": "Suvan Balu",
    "contact_mobile_2": "8667095585",
    "hall": "E-Block (CC Lab Third Floor)",
    "eventRules": "Team size can range from 2-3 participants.\nParticipation is open to all engineering branches.\nParticipants should have knowledge on how to clone, commit, push, create pull request and issue in GitHub prior to the start of the event.\nThe evaluation for the first 3 rounds is based on how fast they complete the given tasks.\nThe evaluation for the final round is based on creativity, practicality, feasibility, and implementation plan.\nFor the final round, teams will be given 10 mins to think about an idea for the given problem, 5 mins to orally present their ideas and 5 mins for Q&A. These deadlines are strictly followed.",
    "teamSize": "2 - 3",
    "date": "25",
    "timing": "9:30 AM - 4:00 PM",
    "closed": false
  },
  {
    "eventName": "FORENSICIST",
    "category": "Kriyative",
    "one_line_desc": "You have the answer. Just pay attention to hear it !!",
    "description": "To all the Sherlock Holmes Out there, this event is yours!!. Put your recollection power and cognitive skills to the test and try to solve the puzzle of crime and mystery surrounding you. Join us in this enthralling adventure of finding your inner detective.",
    "round_title_1": "Detective Hunch",
    "round_desc_1": "A team of three to four members will participate in this round. A theme based room will be set up, where participants will be given to observe the details in the room. Following that the teams will be answering a series of questions based on the theme. The questions will serve as a knockout mode of elimination of the teams and only one of the teams will proceed to the next round.",
    "round_title_2": "Crimnalistique",
    "round_desc_2": "In this round the participants are provided with a case file of a crime and are given a chance to interrogate various suspects for a limited duration. The participants are allowed to discuss within themselves and come up with the criminal. The final answer should be reported by completing the case file with all the necessary details.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0014",
    "contact_name_1": "Abirami SS",
    "contact_mobile_1": "8892866668",
    "contact_name_2": "Kishore S",
    "contact_mobile_2": "6381984296",
    "hall": "J311, J313, J314 - Round 1 ; J413, J414, J415 - Round 2 ",
    "eventRules": "The teams are to finish the challenge within the given specified time.\nThe teams are to successfully eliminate the imposter with fair means.\nTeams are not allowed to sabotage another team.\nThe teams are expected to maintain decorum.\nThe teams are expected to play fair and not use unnecessary means.",
    "teamSize": "3 - 4",
    "date": "26",
    "timing": "9:30 AM - 4:00 PM",
    "closed": true
  },
  {
    "eventName": "TRY AND TRIUMPH",
    "category": "Kriyative",
    "one_line_desc": "Be the mastermind behind your escape!!",
    "description": "Come and experience a live escape game which challenges your mind. Imagine a place where you are locked up and to escape this place figure out a way by solving the puzzles. Remember there is no room to escape without solving the puzzle. So are you ready to face this imagination in reality!",
    "round_title_1": "Dare to Escape",
    "round_desc_1": "\tTeams will be given clues with respect to the number locked locks. The teams are to use the given clues to unlock the certain number of given locks.The teams that successfully crack the codes will move on to the next round of the event.",
    "round_title_2": "Conquer with Courage",
    "round_desc_2": "It’s time to capture your kingdom, by fighting with your enemies!.The teams who qualified round 1 are here to capture your kingdom. Each team will be given a state at starting of the game. You have to complete the task given,to conquer your neighboring states.Challenges between teams will be given and the winner owns the land of the losers. Challenges and tasks continue, till 1 team who conquers the entire kingdom and becomes the winner!",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0015",
    "contact_name_1": "POOJAA R",
    "contact_mobile_1": "9443288778",
    "contact_name_2": "BENSON RAYAN D",
    "contact_mobile_2": "9840560365",
    "hall": "J 411, J413, J414, J415",
    "eventRules": "The teams are to finish the challenge within the given specified time.\nTeams are to play fair and not use other means like force to unlock the lock\nTeams are not allowed to sabotage another team\nThe teams are expected to maintain decorum.\nThe teams are expected to play fair and not use unnecessary means.",
    "teamSize": "4",
    "date": "25",
    "timing": "9:00 AM - 4:30 PM",
    "closed": true
  },
  {
    "eventName": "AUTO - FACSIMILE",
    "category": "Core Engineering",
    "one_line_desc": "Socialize with fellow car geeks to model vehicular subsystems.",
    "description": "Hello, avid automobile buddies! Here we present you with the event Auto-facsimile. This is the ideal event to unleash your knowledge and skills of automobiles with two rounds of the event with great exposure. You will get hands-on training in MATLAB and Simulink for modeling the vehicular subsystems. Even if you don't have prior experience, you are most welcome to the event.",
    "round_title_1": "Round 1",
    "round_desc_1": "In this round, the participants are tested on their enthusiasm towards automobiles. The participants are given basic automobile questions\nArranging the puzzle pieces with respect to the concept.\nPasscode builder - Based on technical questions, have to identify the password of drive link.\nIdentifying the maximum number of dimensions for the given diagram.\nThis is the first filteration round",
    "round_title_2": "Round 2",
    "round_desc_2": "The filtered participants will be provided sample models on the usage of MATLAB and Simulink for modeling the vehicular subsystems. Afterward, the problem statements will be provided to the participants. The participants have to create a model based on the problem statement in MATLAB Simulink. The Participant who is producing the viable model will be announced as the winner of the event by the judges based on the marking criteria.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0016",
    "contact_name_1": "KATHIRAVAN R",
    "contact_mobile_1": "6374794318",
    "contact_name_2": "Janani M",
    "contact_mobile_2": "9345343055",
    "hall": "K - 403",
    "eventRules": "Team should consist of two members.",
    "teamSize": "2",
    "date": "24",
    "timing": "1.30 PM - 4.30 PM",
    "closed": false
  },
  {
    "eventName": "QRack IT",
    "category": "Coding",
    "one_line_desc": "A QR based technical treasure hunt",
    "description": "Think customary treasure hunt without paper chits and witty one liners. In QRack IT there are QR's that must be unlocked using everything from straight forward sorting algorithms to sophisticated decryption strategies. And the combination of all of these hints, cunningly placed, will produce one coherent story.",
    "round_title_1": "Round 1",
    "round_desc_1": "It would be a 1 hour treasure hunt round, the participants would be asked to choose from one of 2 themes. Depending on the theme, the teams would go for a scavenger hunt looking for a QR for their theme, and hold the QR for that in the final round.",
    "round_title_2": "Round 2",
    "round_desc_2": "This would be a 90 mins round where the first 5 teams to complete the scavenger hunt first will be given a final coding challenge that they would have to solve with the help of the QR they have collected in round one. The teams would be provided with a problem in accordance with their theme.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0017",
    "contact_name_1": "Nishanth G",
    "contact_mobile_1": "8248855632",
    "contact_name_2": "Thiruvenkata Krishnan B",
    "contact_mobile_2": "9944692114",
    "hall": "M503",
    "eventRules": "The teams would not run around the whole block\nReferring to google is allowed for solving the problems\nGetting help from non-participants is not allowed",
    "teamSize": "3 - 4",
    "date": "26",
    "timing": "9:30 AM - 12:30 PM",
    "closed": false
  },
  {
    "eventName": "GREENOVATION ",
    "category": "Kriyative",
    "one_line_desc": "Remodelling Sustainability",
    "description": "Participants, Congregate here to offer your unique and creative ideas on sustainability and a sustainable built environment. This event's objective is to encourage students to recognize a sustainable future by exposing them to a wide range of intriguing and thought-provoking challenges.",
    "round_title_1": "CONNEXION",
    "round_desc_1": "It is a fun round in which participants are provided with a series of pictures depicting the term used in green energy. By using the pictures as clue the participants are asked to guess or find the term.",
    "round_title_2": "GREEN LAB",
    "round_desc_2": "It is a group discussion round in which the participants will be shown a blurry picture depicting an environmental problem in them. Then the participants are asked to write down their own perception with solution in a note or paper. After writing down the solution participants are asked to discuss on the picture and come with a common solution incorporating solutions from all participants.",
    "round_title_3": "GREENATORIUM",
    "round_desc_3": "It is a construction-based event in which the shortlisted participants are made into group of 3 and asked to design a sustainable built environment by using the provided material. Here the participants are forced to think on innovative ideas to promote sustainable built environment and showcase the same in the 3D design.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0018",
    "contact_name_1": "ARJUNRAJ A S",
    "contact_mobile_1": 9150070745,
    "contact_name_2": "BALAMURUGAN A",
    "contact_mobile_2": 6379835837,
    "hall": "G302",
    "eventRules": "Round 1 &2 individual participation and round 3 group participation\nParticipants are restricted to use their mobile phones during event\nParticipants are asked to have prior knowledge on sustainable built environment\nEvent judges’ decision is the final decision",
    "teamSize": "1",
    "date": "26",
    "timing": "1:00 PM - 4:00 PM",
    "closed": false
  },
  {
    "eventName": "Ludovic",
    "category": "Kriyative",
    "one_line_desc": "A coalescence of Quiz and Ludo",
    "description": "Here is a fun-filled technical event involving Quizzes from different domains. But wait, there is more play the intriguing ludo game which plays a critical role in determining the winner.",
    "round_title_1": "Round 1",
    "round_desc_1": "Quiz - Each participant is given 20 questions to answer in 20 minutes.",
    "round_title_2": "Round 2",
    "round_desc_2": "The participants will be divided into four groups for the second round. The first question will be asked to the participant 1 with a time limit of one minute; if the participant does not know or answers incorrectly, the question will be open to other members of the team with a time limit of ten seconds. Two marks will be awarded for correctly answering the question, and one mark will be awarded for correctly answering questions that are passed. The participant receives 5 points for reaching the top of ludo",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0019",
    "contact_name_1": "Yuvakrishna S",
    "contact_mobile_1": 8883594555,
    "contact_name_2": "Mohamed Afsar A",
    "contact_mobile_2": 9095705511,
    "hall": "G601",
    "eventRules": "The rules of the Ludo game will apply and should be strictly followed.\nThe Decision of the judges will be final.\nFor each correct answer, 2  points  will be awarded and no points will be awarded for wrong answer.\nIn case where the question is not answered, it will be passed on to the next participant and 1 point will be given for correct answer of the passed question. ",
    "teamSize": "1",
    "date": "25",
    "timing": "1:30 PM - 4:00 PM",
    "closed": true
  },
  {
    "eventName": "CRYPTIQUE",
    "category": "Coding",
    "one_line_desc": "The biggest puzzle here is not the problem but the solution.",
    "description": "Show off your problem-solving skills by solving puzzles. Keep your senses sharp to pick any clues to figure your way out to reach the destination. If you and your buddy are comfortable with Command-Line and willing to challenge yourselves, grab a cup of coffee and figure your way out.",
    "round_title_1": "Capture The Flag Style game",
    "round_desc_1": "The game is comprised of 5 levels \nEach level has a goal and completetion of each level is required to proceed to the next \nThe team that completes all 5 levels quickest wins",
    "round_title_2": "",
    "round_desc_2": "",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0020",
    "contact_name_1": "Naresh Parkav A",
    "contact_mobile_1": 9500322233,
    "contact_name_2": "Ashwin K",
    "contact_mobile_2": 9087079672,
    "hall": "IS Lab ( K Block 4th Floor )",
    "eventRules": "Maximum of two members per team.\nInternet Access will be provided.\nThe decision made by the faculty judge is final.",
    "teamSize": "1 - 2",
    "date": "24",
    "timing": "1:00 PM - 4:30 PM",
    "closed": true
  },
  {
    "eventName": "The Startup challenge",
    "category": "Management",
    "one_line_desc": "Pitch in your exhilarating business idea",
    "description": "The way to get started is to quit talking and begin doing.-Walt Disney. We are here to create a spark in the young entrepreneurs who wish to pursue their career in fashion sector. Present your business concept and compete against other entrepreneurs.",
    "round_title_1": "Round 1",
    "round_desc_1": "All the teams participating will present their business pitch along with their logo before a panel of judges.\nA maximum duration of 1 hour is given for the preparation of 1st round. \nLogo creation carries valid mark in 1st round, it can be done using Adobe illustrator, canva or any designing software. \nPresentation will be held in PPT format for minimum of 10 minutes per team. \n7 minutes for presentation and 3 minutes for questions which will be asked by the judges.",
    "round_title_2": "Round 2",
    "round_desc_2": "A maximum duration of 1 hour is given for the preparation. \nThe detailed 2nd Presentation will also be held in PPT format for minimum of 10 minutes per team. \nThe best pitches will be selected and a detailed presentation of their product/session should be given. \nThe pitches will be evaluated based on certain criteria and the team who scores the highest points will be the winner.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0021",
    "contact_name_1": "Sneha M.",
    "contact_mobile_1": 9944960771,
    "contact_name_2": "Sri Gurunandan R.",
    "contact_mobile_2": 6382784499,
    "hall": "M block 2nd Floor CAFD lab",
    "eventRules": "This is a team event \nEach team can comprise of 2-3 participants \nEach team will have to present their business idea related to engineering field. The ideas can be related to not only apparel but also jewelry design, branding, marketing service, arts and crafts. \nA maximum duration of 1 hour is given for the preparation of 1st round \n  Logo creation carries valid mark in 1st round, it can be done using Adobe illustrator, canva, or any designing software. \nPresentation will be held in PPT format for minimum of 10 minutes per team \n7 minutes for presentation and 3 minutes for questions which will be asked by the judges. \n The detailed 2nd Presentation will also be held in PPT format for minimum of 10 minutes per team. \n Each member in the team should present a part of the content. Content should be divided equally between them. \n A panel of judges will allot points based on certain criteria's such as clarity on idea and innovation, strategy planning, marketing strategy, financial management planning and creativity in pitching \n  The team with best business pitch will be chosen as winners. \n A business Pitch template will be shared with the participants for reference. They should follow the template for uniformity.",
    "teamSize": "2 - 3",
    "date": "25",
    "timing": "9:00 AM- 3:00 PM",
    "closed": false
  },
  {
    "eventName": "FightByte",
    "category": "Coding",
    "one_line_desc": "",
    "description": "FightByte is a 3 round, team based technical event for the coders among you. Starting with a chilling Rapid Quizz for the first round, participants will be tested on the basics of different languages.The first round being a warm up round, the second round will test the participant's intuition and confidence in their coding skill on a fast-paced blind coding battle. For the finale, it will be an epic CSS battle in which their reverse engineering skill to re-create PNGs with minimal code will be tested. Come join us and have fun making memories with your friends!",
    "round_title_1": "Rapid Quizz",
    "round_desc_1": "Rapid Quizz is a MCQ based event where the participants will be tested on various programming languages. An incomplete question is given to the students to predict the missing code in order to obtain the specified output. This warm up round will help the participants relax and boost them up for the further rounds. The conditions are as follows \n 1. The teams that solve the maximum questions will be considered. \n 2. Each question will be timed individually. \n 3. In case of tie, time taken to complete will be considered.",
    "round_title_2": "Blind Code",
    "round_desc_2": "Blind coding is an event where the participant will not get to look at their code for the entirity of the round. The monitors will be turned off and they will be required to code a given statement. The judging criteria to win this round will be based on the following conditions.\n1. The team with zero errors will be given the highest preference \n 2. The second preference will be given to the team with least number of errors. \n 3. In case of tie, time taken to complete will be considered.",
    "round_title_3": "CSS Battle",
    "round_desc_3": "Put to test your Front-end Skills in this glorious battle where you will be competing with the other battlers on the common objective of writing the HTML/CSS code to replicate the given target image in the least code possible.\nIn order to achieve the maximum score in this game, you need to write the HTML/CSS code to achieve the given target design with the least amount of code. The given design can be written with different combinations of CSS concepts you know, but to be the victor, you have to think differently and come up with the appropriate HTML/CSS code for the target that beats the enemy battlers code length.\nWhen you enter the battle, you will be in an editor page, where you can start coding in the editor area onone side of the page.as you start typing, the output area adjacent to it, will start rendering your code. When you're confident that the output matches the target image, hit the Submit button to see your score. You all will be ranked based on the length and the victor of the battle will be announced from it.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0022",
    "contact_name_1": "Swasthika Raksambikai",
    "contact_mobile_1": 7373516516,
    "contact_name_2": "Fredrick John J",
    "contact_mobile_2": 9952660011,
    "hall": "IT Main Lab",
    "eventRules": "Use of mobile phones is not allowed after a round starts.\nThere are round specific rules that will be provided to the participants when the round begins. This is to not reveal more about the rounds themselves.\nTeam size should not exceed 3 members.\nComputers will be provided, so use of own laptop inside the event grounds without supervision is prohibited.\nNot following the above rules will result in instant disqualification of the team.",
    "teamSize": "2 - 3",
    "date": "26",
    "timing": "9:30 AM - 2:30 PM",
    "closed": true
  },
  {
    "eventName": "AQUAJET",
    "category": "Gold",
    "one_line_desc": "Explore your Aerodynamics Skills",
    "description": "Aqua Jet, an entertaining event that requires both interest and skills in fabrication with a basic knowledge in aerodynamics, whereby one has to build plastic soft drink bottle that thrust water as a result of pressurized air to propel the rocket upwards.",
    "round_title_1": "Round 1",
    "round_desc_1": "The range of the rocket is tested and it has to travel a minimum of 80m. This round is eliminative whereby, only the top teams will proceed to the next stage. Points to be awarded according to the following relation:Total points = range (in metres)/5",
    "round_title_2": "Round 2",
    "round_desc_2": "This round tests the stability of rocket. Two chances will be provided for launching the rocket.\n There will be three circular regions in the arena, having P points for hitting, \n 1. Region A (4 meter radius region): P-50 points \n 2. Region B (6 meter radius region): P-25 points \n 3. Region C (8 metre radius region): P-15 points \n Otherwise No points \n Total points P+ (10 x Time taken)    ",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0023",
    "contact_name_1": "A. R. ARUN",
    "contact_mobile_1": 9789589682,
    "contact_name_2": "R. SUNDAR JACOB",
    "contact_mobile_2": 7358541682,
    "hall": "N BLOCK GROUND",
    "eventRules": "A team can consist of 2 or 3 members of same college.\nWater rocket can be designed with multiple stages. Parachute and other booster mechanisms are allowed.\nParticipants should use only identically designed water rocket for same round. But for different round they can use different water rocket.\nTwo chances will be provided to each team and best of two will be accounted.\nThe teams will be disqualified if model is found dangerous in anyway.\nParticipants should not use any electrical components and explosives which will lead to disqualification.\nThe rocket should be made only with plastic aerated soft drinks bottles with maximum capacity of 2.5L and should be free of failures and defects. Total volume of the rocket should not be greater than 2.5L.\nParticipants should have their own launch pads/launcher and sharing of launch pads with other teams will lead to disqualification.\nMaximum pressure supported 60psi.\nMarks will also be based on Neatness and uniqueness of Design.\nIn case of tie, time taken will also be considered.\nThe foot pump provided will be compatible with common bicycle valves only and participants must use only the provided foot pump.\nDecision of judge is final.",
    "teamSize": "2 - 3",
    "date": "25",
    "timing": "9:00 AM - 3:00 PM",
    "closed": false
  },
  {
    "eventName": "Robo Rush",
    "category": "Gold",
    "one_line_desc": "Everyone get ready with your kitbags. Yeah, Robo Rush is a bot event. Let's hunt our hidden talents in us, This is the event where you can show your creativity and problem-solving skills to find the solutions for real-time problems, here's your chance to display it!",
    "description": "The goal of the contest is to construct your own robot that satisfies industrial needs. The contest is to be held in two parts. The first part is that the bot can pick up & carry blocks, pass through obstacles, and push the blocks. The winning criteria are based on the number of blocks carried, the distance successfully pushed, and the time taken. Bot 'dimensions': 30x30x30 cm. Bot weight: less than 10 kg. The second part is to automate the silver idol’s eye-marking process. The bot needs to pick the idols or they can be manually fed at single time. Then, the idol’s eyes were marked by any of the processes without damaging the product. After that, the finished products were collected/gathered along a single side. Automation of the process, marking efficiency, capacity, and weight of the bot, determines the winner.",
    "round_title_1": "Round 1",
    "round_desc_1": "As described, the robot should leave the start zone to pick up the block (5x5x5 cm) from the block area 1. Carrying the block, the robot must travel through the obstacles and irregular pathway (5 cm of ground clearance is preferable for the bot). After crossing the obstacles, the robot must travel over an inclined bridge, where it should place the block on the top flat surface of the bridge and push it down. Then, the robot must get down from the bridge through the other side for the next cycle. The number of blocks carried, the distance of the blocks pushed and the time taken are criteria for winning. The shortlisted participants can go for round 2.",
    "round_title_2": "Round 2",
    "round_desc_2": "In round 2, the robot must pick up the blocks from the block area 2 which is at a height of 15 cm and carry it to the bridge by passing through the obstacles followed by pushing. The number of blocks carried from the block area, the distance of the blocks pushed, the time taken are criteria for winning. Incase of draw between two bots, the bot weight and dimensions would be considered for the winning condition.",
    "round_title_3": "Part 2",
    "round_desc_3": "It is the separate category of competition where the bot needs to pick the idols / they can be manually fed at a single time from the stacked up place at a height of 10cm. Then, the idol’s eyes were marked by any of the processes without causing any damage to the product. After that, the finished products were collected/gathered along one side. Automation of the process, marking efficiency, capacity, and weight of the bot, determines the winner.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0024",
    "contact_name_1": "Nandhagopal S",
    "contact_mobile_1": 9080905838,
    "contact_name_2": "Gokulharish M",
    "contact_mobile_2": 8610128273,
    "hall": "G-301",
    "eventRules": "Note: Participants can participate in both categories. Two teams will be chosen as the winners, one from category 1 and another from category 2.\nCategory 1:\nThe team can have a maximum of 5 members.\nThe robots in the contest must be built by the team members. \nIf the bot is wired control, the cable length is unlimited. However, be careful not to wind the cable on the facilities and game objects in the field.\nThe bots are designed in such a way that; it shouldn’t cause any damage to the game field. \nThe pneumatic system should not be provided. If the team required compressed air, they could be taken up by their own. \nAir pressure must not exceed 5 bar. \nAny power source deemed dangerous may be banned from use. \nBots are inspected before the event starts and checked for the event’s requirements. \nThe required components are brought on their own, it won’t be provided from the organizer’s side. \n Category 2:\nParticipants in this Category 2 should design the eye marking system for the given idol’s image. \nThe idol’s eye marking should be perfect and accurate.\nThe final decision will be decided by the judges. \nThe required components are brought on their own, it won’t be provided from the organizer’s side.",
    "teamSize": "1 - 5",
    "date": "25",
    "timing": "9.30 AM - 4.30 PM",
    "closed": false
  },
  {
    "eventName": "CAD - Enhance",
    "category": "Core Engineering",
    "one_line_desc": "Visualize the data using the CAD and Excel",
    "description": "Attention to all Automobile fanatics! Here the SOCIETY OF AUTOMOTIVE ENGINEERS brings you the event CAD enhance. The ideal event to unleash your knowledge and skills on data visualization and CAD modelling with 2 rounds of the event with great exposure. The event provides you an opportunity to learn the CAD and data visualization software. You will get hands-on experience in the CAD software during the event. Even if you don't have prior experience, you are most welcome to the event.",
    "round_title_1": "Round 1",
    "round_desc_1": "In this round, the participants are given with few sets of data related automotive industry. From that data set, the participants have to create visualizations. The participants will be filtered out for the next round based on the visualizations they created. MS Excel will be used as a tool for visualizations.",
    "round_title_2": "Round 2",
    "round_desc_2": "The filtered participants will be provided with 2D engineering drawings of CAD models. The participants have to create the 3D CAD models from the 2D engineering drawings using CAD software. The Participant who is producing the viable model will be announced as the winner of the event by the judges based on the marking criteria.",
    "round_title_3": "Tie Breaker Round ",
    "round_desc_3": "If the top scorers of round 2 get the same score, then an online quiz related to automobiles will be conducted on the quizizz platform. The one who get the top score on the quiz will be announced as the winner of the events. ",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0025",
    "contact_name_1": "Vigneshwaran M",
    "contact_mobile_1": 9942746948,
    "contact_name_2": "Parthiban M",
    "contact_mobile_2": 8778063573,
    "hall": "K-403",
    "eventRules": "Participants are not allowed to use the mobile phones during the course of event.\n Participants should not discuss with other participants. \n If the participants break the any of the above-mentioned rules it may lead to direct disqualification.",
    "teamSize": "1",
    "date": "25",
    "timing": "1:30 PM - 4:30 PM",
    "closed": false
  },
  {
    "eventName": "ELECTORAPTORS",
    "category": "Circuit",
    "one_line_desc": "Circuit branches,flow your remembrance and ideation faab like the flow of charge.",
    "description": "This is a technical event where participants are scrutinized for their memory and their capability is put to test with intriguing questions.",
    "round_title_1": "Episodic Memory",
    "round_desc_1": "This round contains 2 parts. In the first part, one participant from each team will be given a sheet which contains 25 elements and they will be given time constraints (90 seconds) to memorize them. They will reveal the elements to their partner who will in turn have to write it down on the sheet of paper provided within the left-out time.\n In the latter part the participants are shown 5 circuits, out of which they have to identify the additional components/elements which were not among the 25 elements given in the former part.\nFor the latter part of this round, we provide 3 lifeline common to all, which are Re-view - where participants can revisit all the 25 elements, check me 2 - where participants can check 2 components and verify whether it is an additional component or not and finally “Am I correct?”-participants can get to check their 1 circuit’s whole answer, where we will tell among them how many are correct and incorrect.",
    "round_title_2": "Reason the fault",
    "round_desc_2": "The teams will be given real time problems displayed via the projector and they have to give some basic solutions to the problems in order to test their innovative skills. Each team will be given 1 different question to which they have to exemplify reasonable solution to the problem. Participants are given 25 mins to make a ppt. The 1st slide should contain their respective question along with name and roll no., 2nd slide should contain their idea and 3rd slide should contain the implementation of their question in real life.\nFinally, a runner and winner will be selected by the judge based on the solutions given by the team in round 2.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0026",
    "contact_name_1": "M DIVYASHREE",
    "contact_mobile_1": 8554965245,
    "contact_name_2": "KARTHI KEYAN N",
    "contact_mobile_2": 7448452533,
    "hall": "G 305, G306",
    "eventRules": "In part 1 of round 1, each team will be provided a maximum of 4 minutes as a whole.\nFirst 90 seconds can be used to memorize the components and the left out 150 seconds can be utilized to reveal the elements to their partners who will in turn write down the same. \n Each component can only be repeated twice to the partner 2.\n Usage of lifeline in 1 circuit leads to reduction of marks i.e. If they secured 3 points in 1 circuit, it will be turned into 1.5 points.\n In round 2, preparation time is 25 minutes among which they have to make a ppt of their idea. Presentation time in-front of judge should not exceed more than 5 mins. A reminder will be given at 4 mins 30 sec.",
    "teamSize": "2",
    "date": "26",
    "timing": "9:00 AM - 12: 00 PM",
    "closed": false
  },
  {
    "eventName": "MECHANICAL Maestro V2.0",
    "category": "Core Engineering",
    "one_line_desc": "Exhibit your innercognitive skills about Mechanisms",
    "description": "Here we provide you an arena to showcase your intellectual skills and mastery in Mechanical engineering through ‘Mechanical Maestro’. If you are brave enough to venture out to showcase your expertise in solving real life problems and articulate the same in the best possible way, do sign up to prove your mettle.",
    "round_title_1": "The Language of Mechanical Engineers",
    "round_desc_1": "All the participants will receive a question paper consisting of 20 questions based on various concepts from Engineering Graphics. The candidates should answer the same within 20 minutes and another 20 minutes would be allotted for the evaluation of answer sheets. A certain number of participants who secure the highest scores would be filtered out and qualify for the second round. The participants can provide the answer in the question paper itself which would be provided by the organizers.The occurrence of a tie in the final score would be resolved based on questions with asterisk mark which will have extra weightage and considering the chronological order of submission i.e., the teams submitting earlier would receive extra points in comparison to the teams submitting later. ",
    "round_title_2": "Make-it-Mastero's",
    "round_desc_2": "The participants who qualify for this round should create any mechanism using the ‘Make-it-Master’ kit and provide a short presentation about the same without exceeding a duration of 5 minutes and the same would be evaluated by the panel of judges. The total time allocated for this round would be 45 minutes. There will be no elimination in this round.",
    "round_title_3": "Creative Manager",
    "round_desc_3": "A problem statement would be provided for all the participants and they are expected to submit their solutions in the form of a poster comprising of freehand sketches and necessary details for establishing a solid ground for the solution proposed. The participants are expected to prepare the posters manually without the aid of any software or other digital tools. Further, the participants should do an oral presentation without exceeding a time limit of 10 minutes. The total duration of this round would be 1.5 hours. The presentation would be evaluated by the panel of judges and the cumulative score of rounds 2 and 3 would be used to declare the winners",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0027",
    "contact_name_1": "Sriram A",
    "contact_mobile_1": 8754655235,
    "contact_name_2": "Vishnu P",
    "contact_mobile_2": 9361457231,
    "hall": "G 301",
    "eventRules": "The decision made by the judges would be final and the participants are devoid of the right to appeal against the same.\nThe participants are expected to make the submissions based on their own ideas and any form of plagiarism in the same would be scrutinized and the repective participants would be disqualified from the event.\nThe participants are expected to follow the schedule and the entry of participants after the commencement of the respective rounds shall not be entertained.\nBoth the participants constituting a team should be from the same institution.",
    "teamSize": "1",
    "date": "24",
    "timing": "9:30 AM - 1:00 PM",
    "closed": false
  },
  {
    "eventName": "The Darwinian game",
    "category": "Brainiac",
    "one_line_desc": "May the strongest mechanical engineer flourish!!",
    "description": "The Darwinian game is based on Charles Darwin's hypothesis, commonly referred to as 'Survival of the Fittest' which states that only the strongest among many species would endure until the end. As the rounds progress, the quiz's complexity will gradually evolve. The questions will be grounded in mechanical knowledge.",
    "round_title_1": "Round 1",
    "round_desc_1": "Consists of 10 questions with no lifelines. Out of 40 teams, 30 teams will be selected for the next round.",
    "round_title_2": "Round 2",
    "round_desc_2": "The selected 30 will undergo the next round of 10 questions with one lifeline (Phone-A-friend) in hand. If the lifeline was not used bonus points (two points) will be awarded. Out of 30, 20 will be selected to the next round.",
    "round_title_3": "Round 3",
    "round_desc_3": "The selected 20 will undergo the next round of 10 questions with two lifelines (Audience vote & Phone-a-friend) in hand. If the lifeline was not used bonus points (four points) will be awarded.",
    "round_title_4": "Round 4",
    "round_desc_4": "Final round (Knockout round), the selected 10 will undergo the next round of 10 questions with three lifelines (50-50, Audience vote, Phone-a-friend) in hand. If the lifeline was not used bonus points (six points) will be awarded.",
    "eventId": "EVNT0028",
    "contact_name_1": "Subash T",
    "contact_mobile_1": 6382516513,
    "contact_name_2": "Vasanth Raja K",
    "contact_mobile_2": 9894822279,
    "hall": "G-404 G-405",
    "eventRules": "Each question needs to be answered within one minute.\nEach correct answer scores one point.\nFor first two rounds, negative answers will not stop the teams to move on to the next question.\nIn the last round (Knockout round), a single negative answer will lead to straight knock out.\nFor all lifelines duration of one minute will be provided.\nFor 50-50, four options will be reduced to two options.\nFor Phone-a-friend lifeline, the teams can call their friend for the answer, if the first friend doesn’t pick up a provision for a call to a second friend is allowed in final round only, not for the previous rounds.\nFor Audience vote, answers from panel of ten volunteers will be given.\nIf the lifeline is not used in the allotted round, bonus points will be allotted.\nIn case of tie, a tie breaker round with buzzer will be conducted.",
    "teamSize": "2",
    "date": "25",
    "timing": "1:30 PM - 4:30 PM",
    "closed": false
  },
  {
    "eventName": "TECHORYX",
    "category": "Coding",
    "one_line_desc": "Innovation empowering society",
    "description": "“An invasion of armies can be resisted, but not an idea whose time has come.” We present to you TECHORYX, a hackathon to test your innovative thinking and creational skills! In this hackathon, participants will race against time to build a novel solution to the theme given, in order to claim their spots in the finals, where they will present their ideas to our eminent jury. This hackathon is not for the simple minded: the biggest and most enthusiastic minds can make use of this great opportunity to come together and create magic! Come on, let’s ideate, develop products and be the catalysts that bring innovation to the world!",
    "round_title_1": "Round 1",
    "round_desc_1": "Participants have to indulge in 5 hours of non-stop programming to develop either a web application or a mobile application based on the problem statement chosen, considering the event rules.",
    "round_title_2": "Round 2",
    "round_desc_2": "Shortlisted participants will have to do a 5 – 10-minute demonstration of the application, describing the planning process used to develop and design the application including a pitch for the solution.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0029",
    "contact_name_1": "Monisha G S",
    "contact_mobile_1": 9110460916,
    "contact_name_2": "Tharunkumar Dhanasekaran",
    "contact_mobile_2": 9380205535,
    "hall": "GRD Lab & Software Programming Lab",
    "eventRules": "Team size can range from 3 – 4 participants.\nParticipants is open to all engineering branches.\nThere are 5 themes identified for the hackathon\n->Banking\n->Shopping\n->Travel\n->Manufacturing\n->Hi – Tech\nParticipants have to choose a theme of their choice and need to attempt the problem statement (which will be provided based on the theme) in the given time.\nParticipants have to build applications around any one of the given problem statements in the given time.\nOn completion, participants are expected to upload the source files into given GitHub repository.\nThe evaluation is mostly based on the following parameters: functionality of the application, design aesthetics and the quality of the code written.",
    "teamSize": "3 - 4",
    "date": "24",
    "timing": "9:30 AM - 2:00 PM",
    "closed": false
  },
  {
    "eventName": "Quizpicable me",
    "category": "Brainiac",
    "one_line_desc": "Unchain the Binge Monster inside you!!",
    "description": "Quizpicable Me, an entertaining quiz competition on cinefest. The contestants must have both nerdical and fa(n)ctual knowledge about sci-fi Movies, TV series etc, to outshine others. This quiz tests the technical knowledge related to cinema as well. Gear up for a fun-filled trivia.",
    "round_title_1": "Prelims",
    "round_desc_1": "The prelims is conducted using Quizziz platform. Screenshots from different movies, series, anime will be shown, and the contestants must choose the movie from the given set of options. Top 8 teams will be selected based on the scores and are invited to the college for the Finals.",
    "round_title_2": "Finals",
    "round_desc_2": "The final consist of 5 rounds \nRound 1: “The Order of the Screenings”\nThe contestants would be shown images of different movies, or screenshots within the same movies as the question. The team must find the correct sequence of the images. It could be the chronological order, release order, Box office, sequence of scenes within the same movie etc. \nRound 2: The Amateur Scientist\nThe contestants would be shown a scene from a sci-fi movie. The team must correctly name the scientific principle involved/discussed in the scene. Explaining about the principle will be awarded with bonus marks. \n Round 3: That's what she said!\nA dialogue from a movie/series would be displayed in the form of text in the slide. The contestants must name the character that said that dialogue. Correct answer will be provided with full marks. In case of no answer, the same dialogue will be played as an audio clip, if answered correct, will be provided with half of the marks. \nRound 4: GK Geek\nThis round consists of questions from GK, History and Current affairs related to Cinema. The contestants with strong technical knowledge will have an edge over the others in this round \n Round 5: Screenshot Saga\nRandom (4-5) pictures from different movies, series, anime would be shown, and the contestant must find the common connect between the shown images",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0030",
    "contact_name_1": "Abishek K R",
    "contact_mobile_1": 9952346262,
    "contact_name_2": "Pranav Ragav D U",
    "contact_mobile_2": 8220131208,
    "hall": "F202",
    "eventRules": "A team of 2 members can enroll in the contest.\nA single person cannot enroll themselves as a team\nThe selection round (Prelims), would be held in online mode to select top 8 teams for the finals. Only one enrolment must be done from a team to take up the prelims quiz\nThe top 8 teams qualifying to the finals must handle the buzzers provided to them with concern. Questions will be projected in the form of PowerPoint presentation in the finals.\nParticipants should not use smartphones or smartwatches to find answers.\nAll 5 rounds in the finals, contain a mandatory question for a team for which no negative markings would be awarded for a wrong answer. But negative marks would be given for the passed question obtained by the use of buzzer by another team, if the answer is wrong. But if the answer is correct, half of the marks would be provided.\nAfter the mandatory questions set, open-to-all questions would be displayed (for all rounds), where the team pressing the buzzer first, gets to answer. Correct answer is awarded with points while the wrong answers are given negative marks. In this set, the questions will not be passed to another team.\n Each team would be provided with 3 powerups such as question swap, 2x points, etc. It could be used in any of the 5 rounds in finals.\nIn case of tie, tie breaker would be implemented.\nDecision of judge is final.",
    "teamSize": "2",
    "date": "24",
    "timing": "9:30 AM - 12:30 PM",
    "closed": true
  },
  {
    "eventName": "Metaract",
    "category": "Management",
    "one_line_desc": "Hey Meta-minds get ready to explore your metallurgical knowledge through 'Metaract', an exciting event exclusively for you .",
    "description": "Metaract comprises of four rounds which includes technical puzzles, group discussion, timeline, and case studies. It mainly prioritizes the understanding of the facts of metallurgical domains. This event enhances the critical solutionizing, interpersonal skills, and competitive abilities amongst participants.",
    "round_title_1": "Interference Visuelle",
    "round_desc_1": "A set of five videos each with a maximum duration of 2 minutes will be played regarding any metallurgical processes and techniques. The standard set of six question will be projected for each video. The participants will be given 40 sec to answer a question. Based on the score participants will be taken to next round.",
    "round_title_2": "Discussion de Groupe",
    "round_desc_2": "The participants advanced to this round are split into teams of eight. Each team will be assigned a topic related to metallurgy and will be allowed to discuss for 10 mins. A faculty will be present at the time of discussion to evaluate their performance based on technical knowledge, way of expression (body language, interpersonal skill), tolerance. 80% weightage will be given to the technical knowledge and the remaining 10% is given to their way of expression and tolerance. Three participants from each team will be screened to proceed to the next level. Based on the score participants will be advanced to the next round.",
    "round_title_3": "Avancement",
    "round_desc_3": "This round demands the students to arrange a jumbled set of process in the timeline. Participants will be split into teams of three. Each team will be given a set of three questions and are expected to sequence it correctly. Each participant from a team will be selected to proceed to the next level. Based on the score participants will be advanced to the next round.",
    "round_title_4": "Scruter",
    "round_desc_4": "This is where the participants are given current problematic error overcoming situations. From which they must analyse the problem and get the idea to solve a circumstantial crisis. They will be given 10 min to think, 15 mins to document their solution and 5 mins to present their report. Based on the conceptual understanding, solution, presentation skills judges will select the suitable candidate as winner.",
    "eventId": "EVNT0031",
    "contact_name_1": "Kavya Maha Lakshmi A ",
    "contact_mobile_1": 6379532308,
    "contact_name_2": "Deepa Shree S",
    "contact_mobile_2": 9566823338,
    "hall": "G503, G504",
    "eventRules": "",
    "teamSize": "1",
    "date": "24",
    "timing": "1:30 PM - 4:30 PM",
    "closed": false
  },
  {
    "eventName": "Pro - Shopper",
    "category": "Kriyative",
    "one_line_desc": "“Unveil the Shopper inside You”",
    "description": "An event which evokes a sense of mystery, elegance, opulence and become the character of your dreams. Bring your shadow of the dark and showcase your creativity through mask styling. This would be a event which has creative rounds that will make you involved in creating your own fashion. Surf across various internet sources finds different style and create your own look by collaging them.",
    "round_title_1": "Round 1",
    "round_desc_1": "It is a quick quiz round (buzzer based), in which 40 questions will be displayed to the participants. The questions will be based on the fashion elements used on the garments, fashion styles and the fashion brands around the globe. Questions with star mark will contain more weight-age than the normal ones. Totally 20 teams will be selected for the next round. For tie breaker, separate round will be conducted for the teams (team’s star question’s answers will also be considered for this round).",
    "round_title_2": "Round 2",
    "round_desc_2": "In this round the participant should select a theme by themselves. In the given time start shopping across the various different online shopping sites. Makes sure that it is within the given the budget. Arrange the selected garments in the given template, also attach the price and link of the garment along with the template which will be given as a power point template or Canva template. The participants will be short-listed (around 10 teams) to the final round based on look and relevance of the garment to the theme. For example, if the theme is “beach”. The look can be of a loose fitted shirt with a boxers matched with a bright sunglasses.",
    "round_title_3": "Round 3",
    "round_desc_3": "10 selected teams will be provided with a plain A3 sized cardboard along with A3 sheets, scissors, glue, basic colours paint set and a brush. Participants can also use any other surface embellishments, colours (eg: acrylic/poster colours) for the mask creation. Mask can be created either in the form of full face mask or partial type mask (masquerade / breathing mask). All teams should complete the mask creation within an hour and it should be displayed at the end of the event. Judgement will be based on the creativity imparted in the design along with its complexity (design type, style complexity and the final look of the mask).",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0032",
    "contact_name_1": "Kamalesh K M",
    "contact_mobile_1": 8667765257,
    "contact_name_2": "Tej Asswin S",
    "contact_mobile_2": 8012326847,
    "hall": "G508",
    "eventRules": "It is an event of two \nPrelims (Buzzer based quiz round) based on fashion elements and brands will be conducted \nThe theme for the second round can be selected by yourself. \nA canva & powerpoint template will be provided to the teams for making collage of the collected pictures. \nParticipants can bring personal laptops to the event.(If required) \nAfter making the collage, it should be sent to the given mail id in ppt/pdf format. \nStudents should make a collage with its price taken from the respective site. The total price of attire should not exceed the given budget. \nFor the third round, A3 size plain cardboard along with A3 sheets and basic colour paints with a brush will be provided for mask creation. \nStudents can bring any material (paint, brush, colour paper, surface embellishments) to decorate the mask. \nAt the end of each round the participants will be filtered ( At the end of first round - 20 participants and at the end of second round - 10 participants.\nEvaluation will be based on the creativity , relevance and presentation and also the application of elements and principles of designs will be considered).",
    "teamSize": "2",
    "date": "24",
    "timing": "9:00 AM - 12:00 PM",
    "closed": true
  },
  {
    "eventName": "Tech - zap",
    "category": "Brainiac",
    "one_line_desc": "The battle for 3s for the 4 th.      1C - cogitation , 2C - creativity, 3C - careful analysis for the 4 C - Champion .",
    "description": "During the first round , all participants will be given a crossword puzzle to solve in 20 minutes while answering technical questions. The top twenty teams will advance to the next  round. Round 2 delves into matching of famous tag lines with the products. The top ten teams will advance to the next round. Round 3 delves into marketing strategies for effectively advertising a given product. Come and join with us for this event to demonstrate your puzzle solving abilities and creativity in handling the given task.  ",
    "round_title_1": "Round 1",
    "round_desc_1": "Round 1 is based on puzzle solving. The technical questions will be asked and then the participants need to fit the answers in the given boxes and he needs to come up with the same alphabet if the alphabets are overlapped by the consequent questions. Top twenty teams will be selected for second round. Each question carries 1 marks . ",
    "round_title_2": "Round 2",
    "round_desc_2": "Round 2 is based on finding tag line for the given products. Twenty products along with some famous tag line will be given to the participants. One who matches the tagline with the products will be qualified for next round . Top ten teams will be selected for third round . ",
    "round_title_3": "Round 3",
    "round_desc_3": "Round 3 is about how the participants find new marketing skills to the particular product give by us . The judge will decide the winners , one who gives the new way of advertisement to the particular product. ",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0033",
    "contact_name_1": "Dharanesh D",
    "contact_mobile_1": 8778591254,
    "contact_name_2": "Janani T",
    "contact_mobile_2": 6381996676,
    "hall": "Y 302",
    "eventRules": "Number of participants in the team should be two members.",
    "teamSize": "2",
    "date": "24",
    "timing": "1:30 PM - 4:00 PM",
    "closed": true
  },
  {
    "eventName": "FUTECH",
    "category": "Circuit",
    "one_line_desc": "FUTECH is an event based on electronics. This will test your analytic skill and hasty execution in that domain.",
    "description": "FUTECH has two technical and fun rounds, based on Electronics. This will test your analytic skill and hasty execution in that domain. 1st you gotta solve some simple tricky question for a cross word puzzle then do a quick dare in between. People who did well, welcome to the 2nd round of FUTECH! The real fun of exploring partnership, communication and critical thinking when facing a technical problem.",
    "round_title_1": "Round 1",
    "round_desc_1": "In this round, the participants/teams will be made to sit at a single desk and a question paper will be given to them with a time limit of half an hour. The first half of the questions will be given and the 2nd half of the questions will only be given once they complete a simple fun dare. They have to solve the crossword puzzles which have to be filled by using the answers (numbers or letters) they get after solving the given incomplete circuit diagram or one-word questions based on electronics given in the question paper. Participants will be shortlisted based on their response time, and the number of correct answers also the people who did the dare with less hesitation will enjoy a few extra bonus points to their total score",
    "round_title_2": "Round 2",
    "round_desc_2": "In this round, the participants will be tested on their analytical skills, communication and team spirit. First, the shortlisted participants will be paired with another fellow participant, making a team of two. One person from each team will be given a question according to which he/she has to build/draw an easy circuit based on the required output mentioned in the question paper. Then this circuit has to be conveyed to their respective teammate by physically mapping it on the floor (by walking in different directions marking the wires and placing the electronic components at a point/node by the given hand gestures). Then this mimed circuit map has to be closely analysed and drawn by the other teammate on the given pencil & paper. With the degree of closeness to the original circuit, the participants will be given marks and ranked accordingly",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0034",
    "contact_name_1": "Rahul Prashanth",
    "contact_mobile_1": 9101180943,
    "contact_name_2": "Thirumurugan S",
    "contact_mobile_2": 9894317044,
    "hall": "G506",
    "eventRules": "For Id verification, a college id card is required.\nParticipants should enter the allotted room after giving their attendance at the registration desk with their name and the last four digits of the Kriya ID..\nThe Participants must not make noise throughout the event.\nParticipants should come with a proper dress code.\nMalpractice is strictly prohibited.\nUsage of mobile phones is prohibited.\nThe time limit will be strictly adhered to.\nParticipants are supposed to be present on time.\nAt the end of the first round-10 teams will be filtered.\nJudge's decision will be final.",
    "teamSize": "2",
    "date": "24",
    "timing": "9:30 AM - 1:00 PM",
    "closed": false
  },
  {
    "eventName": "Scienza",
    "category": "Brainiac",
    "one_line_desc": "Increase your velocity of pleasure!!  The fast you act, the higher chances to top!",
    "description": "Do you have a keen interest in science? Then this event is yours!. The primary aim of the event is to put your critical thinking and general knowledge of Science to the test. Combat with the best minds and prove yourself to be the best out of them.",
    "round_title_1": "Round 1",
    "round_desc_1": "Each question is presented for 15 to 20 seconds approximately to the participants. Each participant is given 5 to 10 seconds approximately to solve a question. Each participant is given 20 to 25 questions approximtely. Framed in a video format with time limits for each questions to be displayed and time for participants to write down answers in sheet provided. Based on the score and no. of participants, the participants are shortlisted for Round2.",
    "round_title_2": "Round 2",
    "round_desc_2": "The shortlisted participants are given a case study (in a sheet), for which questions  will be asked based on the case study. Each participant is given 5 minutes to go through the case study and 10 minutes to answer the questions asked(questions can be of any type, not particularly MCQ). Accordingly they will be judged",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0035",
    "contact_name_1": "D Praneka",
    "contact_mobile_1": 8428865555,
    "contact_name_2": "Dhanushiri D",
    "contact_mobile_2": 6382234992,
    "hall": "G304",
    "eventRules": "The quiz consists of 2 rounds.\nThe points scored in the first round will be considered to select the finalists for the second round.\nUnanswered questions will be awarded no points.",
    "teamSize": "1",
    "date": "25",
    "timing": "2:00 PM - 4:00 PM",
    "closed": false
  },
  {
    "eventName": "ProTech",
    "category": "Brainiac",
    "one_line_desc": "This will be a technical competition that attempts to develop young people's tech knowledge over a series of three rounds that will grow progressively harder and more engaging.",
    "description": "This is a technical event that aims to bring out the tech savvy in young minds. The event comprises 3 rounds, which consecutively gets more challenging. All the rounds are engineered to accommodate participants from all technical departments, however prior knowledge in physical Sciences or Coding is a prerequisite to participate in the event.",
    "round_title_1": "Round 1",
    "round_desc_1": "Participants are given Multiple choice Questions which are divided into three different sections; namely Quantitative based, Aptitude based and Coding basics respectively. This is to be conducted in offline mode (Pen and Paper). This is going to be an elimination round, where the general crowd will be filtered to find the tech savvy.",
    "round_title_2": "Round 2",
    "round_desc_2": "In round 2 participants will have two options \nCoding question paper : A frivolous and inefficient code will be given and the participants have to optimize it to meet the criterion with the most effective code\n or \nTechnical question paper : The participants must simplify the given circuit such that it consumes the least power while also giving an optimal output.\nThis choice is given in order to make this competition all department friendly and enable the participants to pick their strong suit. However, both the options are equally challenging in their own field.",
    "round_title_3": "Round 3",
    "round_desc_3": "A list of inventions will be displayed and each participant has to choose 5 inventions. A sheet with facts about their respective selection will be given to the participants. Every participant is required to give 3 statements: 2 false and 1 fact with respect to that invention, while the rest of the participants will have to identify which is the fact among the three given statements. The winner is the one that has identified the most number of facts among all the statements given by the participants.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0036",
    "contact_name_1": "Dineash kumar B",
    "contact_mobile_1": 8870454809,
    "contact_name_2": "Abhishek M B",
    "contact_mobile_2": 9345472545,
    "hall": "G501",
    "eventRules": "Individual participation. \nNo mobile phones allowed.",
    "teamSize": "1",
    "date": "26",
    "timing": "1:00 PM - 4:00 PM",
    "closed": false
  },
  {
    "eventName": "Electroblitz",
    "category": "Circuit",
    "one_line_desc": "This will be a technical competition that attempts to develop young people's tech knowledge over a series of three rounds that will grow progressively harder and more engaging.",
    "description": "Electronic circuits play a big role in our day-to-day existence. Even the brightest are intimidated by the intricate working of an intelligent design. If you have a knack for working relentlessly with digital and analog, this is the spot for you. Electroblitz is the best platform to show off one's best talents if one is passionate about electronics. Come compete against the greatest in technical wizardry and decode basic yet dynamic day-to-day circuits. In electroblitz, you must steer through two levels with increasing intricacies, to win the prize",
    "round_title_1": "Elec-tricky",
    "round_desc_1": "Test your knowledge in basic Digital and Analog electronics concepts. Knock the inner chambers of your brain. Wake up your problem solving skills. Run the risk of solving the tricky questions from electronics. Each candidate will be provided with a set of questions and the top performers will be qualified for the next round. Each question has its own weight and marks will be awarded accordingly",
    "round_title_2": "Round 2",
    "round_desc_2": "Level 1 - behind the box \nA powerPoint presentation will be presented to the participants. Boxes shall be displayed, behind which there will be a problem statement. Participants should pick a box and solve the question behind it. If they get it right, +5 will be awarded, otherwise -2 marks will be provided. Unanswered questions will not be passed on. \nLevel 2 - bug the bug \nParticipants will be given a circuit with a missing component. They must find the missing component in the circuits within the stipulated time. If participants require clues, they can pick random chits provided to them and perform some funny technical tasks mentioned in it. This round is assesed based on the time taken and the closeness of the output obtained.Based on the level 1 and level 2 scores, the winner and runner will be decided.",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0037",
    "contact_name_1": "Adarsana G",
    "contact_mobile_1": 9789787099,
    "contact_name_2": "Navaneeshwar",
    "contact_mobile_2": 9843711171,
    "hall": "G501 G502",
    "eventRules": "Participants should strictly adhere to the time limit.\nParticipants are barred from using mobile phones and the internet. \nDecision of the judges shall be final. \nParticipants shall not indulge in any form of malpractice.",
    "teamSize": "2",
    "date": "24",
    "timing": "1:30 PM - 4:30 PM",
    "closed": false
  },
  {
    "eventName": "League of Drones",
    "category": "Gold",
    "one_line_desc": "A technical competition that attempts to develop young people's tech knowledge over a series of three rounds that will grow progressively harder and more engaging.",
    "description": "Build your own drone that travel from source point (starting point) to destination point (ending point) crossing various hurdles along the path of journey of laps. In this drone championship event, do you want to compete with others and become the best drone pilot champion. This is the place where you can show off your piloting skills. It is the game where the participants control drone's stability. In this event there will be totally three rounds. Each round consists of different points level. Based on the performance marks and lap timing the points will be awarded to the team. Finally, the winning team will be selected based on the points scored.",
    "round_title_1": "Race for stability",
    "round_desc_1": "There will be a track of different raddles. The participant must complete one lap. The points will be allocated to all the hurdles when they pass. The total points scored by the team will be selected to next round.",
    "round_title_2": "Time to prove best pilot",
    "round_desc_2": "In this round, each team should be complete the track (one lap). The lap timing will be noted. There will be negative points (time) if the quad hits the raddles. The pilot can travel with the drone. (LOS)",
    "round_title_3": "Chance to win the race",
    "round_desc_3": "In this round top 4 to 5 teams will be selected. In this round they should complete the lap. No negative points will be awarded. But the pilot should stand at one place and drive the drone, 1 of the team mate can move with drone to navigate.",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0039",
    "contact_name_1": "PRAGATHEESH R J",
    "contact_mobile_1": 8056920879,
    "contact_name_2": "SUBASH D",
    "contact_mobile_2": 6379003794,
    "hall": "N Block Ground",
    "eventRules": "Drone frame dimension should be in range of (210mm-350mm).\nEach Team can have maximum of 3 members.\nEach participated team should bring their own drone and fly. Drone pilot can not be changed once they started.\nDrone should be at good condition.\nParticipants should bring required spare parts required for the event.\nDrones cannot be exchanged with another team.\nOne drone cannot be driven with more than i pilot.\nQuad should not fly above 15 ft high.\nEvent judges reserve all the rights to disqualify in case of any misbehavior.\nEvent judges rules and are final.\nNo extra time will be allocated for any reasons, after every round there will be 2 hours break utilize those time for charging.\nJudges result is the final.",
    "teamSize": "2 - 3",
    "date": "25",
    "timing": "9:30 PM - 4:00 PM",
    "closed": false
  },
  {
    "eventName": "KRIYA OPEN QUIZ",
    "category": "Gold",
    "one_line_desc": "Unleash the Quizzer in you",
    "description": " Kriya open quiz is a signature event where the best quizzing minds compete to become the ‘best of the best'. Questions are hand picked and curated to give the best quizzing experience to the quizzers. The senior most and best quizzers of the club host the event as a convention which is followed every year. Come, join us during the event to give your brain some exercise and be a part of one among the most anticipated events of kriya !",
    "round_title_1": "Round 1",
    "round_desc_1": "The first round (Prelims) consists of 20 questions. Teams of 2 will take part in the preliminary round. Questions from all fields, starting from cinema to sports will be asked and in-built tie-breakers will be present. At the end of the round top 6 teams will make it to the finals. This round will not have any negative scoring and hence it is good to give a shot to every questions. ",
    "round_title_2": "Round 2",
    "round_desc_2": "The second round is the finals which consists of 5 rounds with each round consisting of 6 questions. Negatives and marks per question will be informed during the event. At the end of 5 rounds, the team with highest score will be adjudged the winner. The rounds will vary from infi-pounce, rapid fire and LVCs. Apart from the top 6 teams, numerous audience questions will be present amidst rounds and prizes will be given for the same. ",
    "round_title_3": "",
    "round_desc_3": "",
    "round_title_4": "",
    "round_desc_4": "",
    "eventId": "EVNT0038",
    "contact_name_1": "M. AHAMED UZAIR",
    "contact_mobile_1": 7305950137,
    "contact_name_2": "N. HARINI",
    "contact_mobile_2": 6384920066,
    "hall": "D-Block First Floor",
    "eventRules": "Teams of 2 are allowed \nNo googling answers ( It’s a waste of time don’t bother trying it !) \nNever discuss with your neighbors  \nQuiz masters decision is the final \nRound-wise rules will be informed during the event",
    "teamSize": "2",
    "date": "25",
    "timing": "9:30 AM - 12:30 PM",
    "closed": false
  }
]
