[
  {
    "eventName": "Aquajet",
    "category": "Gold",
    "one_line_desc": "Crafting Soars, Creativity Roars!",
    "description": "Take on the exhilarating Aqua Jet challenge, where competitors effortlessly combine a fundamental understanding of aerodynamics with their innovations and manufacturing talents. The goal is to build a high-performance rocket out of plastic bottles that will shoot water up a stunning vertical ascension using pressurized air. Boost your participation by combining creativity with basic aerodynamics concepts in this thrilling tournament.",
    "round_title_1": "RANGE TEST",
    "round_desc_1": "The rocket undergoes testing for distance, requiring it to cover a minimum of 80 meters. Only the top-performing teams progress to the next round, following an elimination-style format. The points awarded are based on the rocket's performance.",
    "round_title_2": "STICK TO THE ROUNDS",
    "round_desc_2": "Participants are required to launch the rocket perpendicular to the ground. They will be provided with a specified pressure range. The rocket, once launched, must land in close proximity to the launch pad. Marks will be higher for landings that are closer to the pad.",
    "round_title_3": "NO RUSH- REACH THE TARGET",
    "round_desc_3": "This round evaluates the rocket's accuracy during launch as well as its stability. There will be two opportunities to fire the rocket and the  arena will be divided into three circular areas, and points are awarded according to their hits.",
    "eventId": "EVNT0001",
    "contact_name_1": "Methun K",
    "roll_1": "20M618",
    "contact_mobile_1": 9677206757,
    "contact_name_2": "Akshai Lakshman K",
    "roll_2": "21M602",
    "contact_mobile_2": 7904457034,
    "hall": "N BLOCK GROUND",
    "eventRules": "Event rules\n->A team is limited to three members.\n->Other booster devices, such as parachutes, are permitted.\n->Only water rockets with the same design should be used by participants in the same round. \n->On the other hand, they can utilize a different water rocket for each round. \n->The foot pump provided wil be compatible with common bicycle and participants must use only the provided foot pump.\n->Every team will receive two opportunities, with the best of two being counted.\n->In any case, if the model is determined to be harmful, the teams will be eliminated.\n->Only plastic aerated soft drink bottles with a maximum capacity of 2.5 liters shall be used to construct the rocket, and it should be devoid of failures and faults. \n->Participants who utilize any electrical components or explosives risk being disqualified. The rocket's total volume should not exceed 2.5 liters and the maximum pressure permitted is 60 psi.\n->Launch pads should be provided by each participant; sharing launch pads with other teams will result in disqualification. \n->Marks are provided based on the neatness of the model and in case of tie the uniqueness and the time taken to complete the design",
    "teamSize": "2-3",
    "date": "24",
    "timing": "9.30 AM - 4.30 PM",
    "closed": false
  },
  {
    "eventName": "Asimo Bot ",
    "category": "Core Engineering",
    "one_line_desc": "Amplifying Electronics Expertise!",
    "description": "Join us for the ASIMO BOT event, a platform designed to showcase and enhance participants' problem-solving skills and electronics knowledge. This engaging event centers around the exploration of cutting-edge technology, inviting individuals to demonstrate their prowess in problem-solving within the realm of electronics. Your presence is eagerly anticipated for an immersive experience in the world of ASIMO BOT!",
    "round_title_1": " PLICKERQUEST CHALLENGE",
    "round_desc_1": "In This Round , the plicker cards are used to select the option for each questions and participants answers are recorded on their phones using the plicker scanner software.  Participants are given a specific amount of time to respond to each question. As an illustration, plicker cards 1 and 20 correspond to teams 1 and 20, respectively. There are twenty questions for each team. Teams with the highest score are advanced to the following rounds.",
    "round_title_2": "ISA SYMBOL QUEST",
    "round_desc_2": "The cards, which have ISA STANDARD symbols on them, are given in a box or jar. Each participant must select a card from the box or container, identify the symbols on it, and provide pertinent information about the symbols. The answer will determine how many points are awarded (the contest uses standard ISA symbols). They have a specific amount of time to respond to the questions.",
    "round_title_3": "ROBOBUILD SOCCER SHOWDOWN",
    "round_desc_3": "The disassembled robot-building kit, which includes the ESP8266, motors, drivers, and other components, is given to the participants.By putting the pieces together, the participants construct the robot. Next, the organizing team loads the software onto the controller. They are prepared to play the soccer match between the two teams after dumping the program, through the use of the robot they construct. The best teams advance to the semifinal and final stages after the elimination rounds are completed. The winner and Runner are determined in the final match. Prize announcement will be made based on that.",
    "eventId": "EVNT0002",
    "contact_name_1": "Vasu G ",
    "roll_1": "22U442",
    "contact_mobile_1": 6382033544,
    "contact_name_2": "Roshan J",
    "roll_2": "22U435",
    "contact_mobile_2": 6383044106,
    "hall": "Y -201",
    "eventRules": " Participants are instructed to assemble the robot withIn specific time.",
    "teamSize": 2,
    "date": "23",
    "timing": "9.30 AM - 4.30 PM",
    "closed": false
  },
  {
    "eventName": "Auto Minds mastery Challenge: Engine Craft Edition",
    "category": "Core Engineering",
    "one_line_desc": "Design and Dexterity in Harmony! ",
    "description": "Embark on a journey into the heart of automotive mastery! Join us for a unique hands-on experience where individual enthusiasts and dynamic teams come together to explore the intricacies of automotive engineering.It's an exhilarating display of speed, precision, and collaborative synergy, all converging in the relentless pursuit of automotive excellence.",
    "round_title_1": "DesignDash 3D Challenge",
    "round_desc_1": "In round 1, a component will be displayed or given in hand to the participants. The participants have to design a 3D model using creo for the given component. The participant who finishes the model the earliest is considered for round 2.",
    "round_title_2": "RevRapid Rally",
    "round_desc_2": "Participants will assemble and disassemble small 2-stroke and 4-stroke bike engines, testing their speed and precision. The \"RevRapid Rally\" is an adrenaline-fueled showcase of mastering engine intricacies, highlighting teamwork and efficiency. It's a thrilling competition that emphasizes speed, accuracy, and teamwork in the pursuit of automotive excellence. Participants must identify every engine component post-disassembly, with timing noted for both disassembly and assembly. The winner is the participant with the shortest overall timing and the most identified components, with a runner-up certificate for the second-lowest timing.",
    "eventId": "EVNT0003",
    "contact_name_1": "Prasanna Kumar M",
    "roll_1": "21A449",
    "contact_mobile_1": 6369755151,
    "contact_name_2": "Elngo J",
    "roll_2": "21A436",
    "contact_mobile_2": 8344299633,
    "hall": "AUTOMATIVE SIMULATION LABS AND 2+3 WHEELS LAB",
    "eventRules": "ROUND 1 RULES:\n->The only licensed program that is provided by the college's system to finish the round is Creo. \n->Participants can make their own arrangements by bringing their laptops if they are willing to use any other 3D modeling software.\n->For the round, a maximum of thirty minutes will be given.\n->No electronic devices should be brought by students to the event, like phones and smart watches.\n->The top five groups will advance to the following phase.\nROUND 2 RULES:\n->Every player must carefully follow the safety instructions that were given before the round starts.\n->For safety reasons, all participants must wear leather shoes.\n->Every participant is required to use the supplied gloves.\n->There should be no missing automotive part or tool that was provided to the teams.\n->It is advisable to notify someone as soon as possible if you need any technical or safety assistance.",
    "teamSize": 2,
    "date": "24",
    "timing": "9.30 AM -12.30 PM",
    "closed": false
  },
  {
    "eventName": "Auto-Mania",
    "category": "Management",
    "one_line_desc": "Celebrating Freedom on Wheels!",
    "description": "Get ready for an amazing display of automobile craftsmanship at Wheels & Thrills Auto Mania! This occasion is a celebration of flair, creativity, and the exhilaration of traveling freely. You won't want to miss this event if you're an enthusiast for cars, a potential buyer, or just someone who enjoys the beauty of exquisitely built cars.",
    "round_title_1": "Auto Auction",
    "round_desc_1": "Diverse cars with their specifications will be showcased. Teams will engage in bidding to acquire their preferred vehicles, earning credit points for each car. Teams with higher credit points and a substantial wallet balance will receive additional points.",
    "round_title_2": "Engine Insight",
    "round_desc_2": "Teams will be tasked with identifying various car components within the allotted time limit after they are revealed. The player who correctly identifies the greatest number of components wins the most points.",
    "round_title_3": "CAD it out !",
    "round_desc_3": "Teams will be required to design using any available software after receiving a set of cad drawings. Points will be awarded based on the number of components that are manufactured with the highest accuracy.",
    "eventId": "EVNT0004",
    "contact_name_1": "Achuthan S",
    "roll_1": "21A203",
    "contact_mobile_1": 9486036266,
    "contact_name_2": "Shobana Selvi S V",
    "roll_2": "21A232",
    "contact_mobile_2": 8190013570,
    "hall": "Automobile Simulation lab, k block (k-405)&k-503,k-504",
    "eventRules": "ROUND 1 RULES:\n->Three automobiles from each pool should be purchased by each team. Within the allotted budget, each team is expected to purchase 12 automobiles.\n->Teams that spend more than they have in their wallets will be eliminated.\n\nROUND 2 RULES:\n->Usage of phone are strictly prohibited.\n->Teams will only allow one member to respond.\n->Colleagues will be able to switch out the person answering for each of the two components.\n\nROUND 3 RULES:\n->There will be laptops available.\n->Software options include Solidworks and Autocad.\n->The part must be manufactured accurately.\n->Teams are able to divide up and work as needed.",
    "teamSize": "2-3",
    "date": "24",
    "timing": "1:30 PM - 4:30PM",
    "closed": false
  },
  {
    "eventName": "Bounty Hxnt",
    "category": "Coding",
    "one_line_desc": "Crack the code to claim the Crown",
    "description": "Join us for the thrilling \"Bounty Hxnt\" event—a two-round technical challenge designed to test your adaptability and problem-solving skills in the dynamic world of cybersecurity. Showcasing your comprehensive understanding of computational thinking is key to excel in this round. Your success will significantly impact the overall standings, highlighting your team's adaptability and depth of cybersecurity skills. Don't miss the chance to be a part of this exciting journey!",
    "round_title_1": "Bug Bounty",
    "round_desc_1": "The first round is a Bug Bounty-style challenge where teams fix intentional bugs in given programs. They must then successfully run the corrected programs to earn points. Time management is crucial as they aim to fix and execute as many programs as possible within a specific timeframe.",
    "round_title_2": "Cipher Trail",
    "round_desc_2": "In the second round, teams engage in a unique cybersecurity challenge, reminiscent of a Capture The Flag (CTF) format but with a twist. This round assesses team's cybersecurity knowledge through various question formats, including deciphering secret codes related to encryption and identifying cybersecurity terms. Instead of flags, participants uncover passwords to advance. The challenges involve decoding messages and matching terms with their definitions.",
    "eventId": "EVNT0005",
    "contact_name_1": "Aaditya Rengarajan",
    "roll_1": "21Z202",
    "contact_mobile_1": 9444511430,
    "contact_name_2": "Swetha M",
    "roll_2": "21Z362",
    "contact_mobile_2": 9843192749,
    "hall": "PROGRAMMING LAB",
    "eventRules": "ROUND 1:\n-> Task and format of Task:\n-> This round will be held on a proprietary platform built in house by members of the club.\n-> The participants will be given various questions riddled with bugs difficulty wise.\n-> Participants are not allowed to use the internet or any other sources during this round.\n-> Time Limit: 1 to 2 hours, based on our discretion.\n->Submission Guidelines:\n->The participants will have to submit the fixed code in the proprietary platform which will run the code in a series of test cases to award them with points.\n->Judging Guidelines:\n->The team with the maximum number of points will be crowned the winners of this round.\n ROUND 2:\n->Task and format of Task:\n-> This round will be held on a proprietary platform built in house by members of the club.\n-> The participants will be given various puzzles with points awarded difficulty wise.\n-> The participants are not allowed to use the internet unless explicitly stated by the puzzle to do so.\n-> Time Limit: 1 to 2 hours, based on our discretion.\n->Submission Guidelines:\n-> The participants will have to submit the answers to each puzzle in the proprietary platform which will verify whether the answer is correct.\n->Judging Guidelines:\n->The team with the maximum number of points will be crowned as the winners of this round.",
    "teamSize": "2-4",
    "date": "24",
    "timing": "9.30 AM - 4.30 PM",
    "closed": false
  },
  {
    "eventName": "Chromaquest ",
    "category": "Amuse",
    "one_line_desc": "Labyrinth Expertise Display",
    "description": "Come experience Chromaquest: The Maze of Hues with us! Explore a maze of obstacles, sort through chromatic chaos, and work toward becoming the Maze Master in this thrilling adventure of cunning, dexterity, and colour matching proficiency. Please come along and wear bright colours for this thrilling trip!\"       ",
    "round_title_1": "Maze-o-mania.",
    "round_desc_1": "Embark on a suspenseful maze journey, unlocking tasks testing intelligence and agility. Overcome challenges against time for the coveted title of Maze Master. Race through real-time obstacles, solving tasks for an immersive test of skill and strategy. An exhilarating adventure awaits participants in this gripping experience. Hone abilities for victory in the labyrinth.",
    "round_title_2": "Chromasort",
    "round_desc_2": "In the captivating ChromaSort Challenge, success hinges on a blend of strategy and precision. Amidst a vibrant chaos, players wield cups holding an array of colored balls, aiming to skillfully arrange them against the ticking clock. Demonstrate color matching expertise and nimble dexterity in this exhilarating sorting showcase. Only those with keen eyes and swift hands will emerge victorious in this thrilling competition. Participants receive various colored balls to organize into separate cups, tasked with placing identical colors together, with only one additional empty cup allowed for ball transfer.",
    "eventId": "EVNT0006",
    "contact_name_1": "Hemalekha S K",
    "roll_1": "21Z308",
    "contact_mobile_1": 9488527631,
    "contact_name_2": "Aashish T",
    "roll_2": "21M601",
    "contact_mobile_2": 9597070562,
    "hall": "G BLOCK (501,502)",
    "eventRules": "Participants must form a team of 2, with one blindfolded (Person 1) and the other guiding (Person 2).\n->If Person 1 touches the maze more than 3 times, they will be asked small, fun aptitude questions.\n->After answering, they can continue.\n->Maximum time allowed for completing the maze is 5 minutes.\n->Participants will receive 6 transparent tubes/glasses containing shuffled colored balls and one empty transparent tube/glass.\n->They can transfer balls between tubes, but the topmost color must be the same in both tubes.\n->Maximum time allowed for Chromasort is 3 minutes.\n->At the end, each tube should contain only one color (e.g., Tube 1 with all green balls, Tube 2 with all red balls).",
    "teamSize": 2,
    "date": "24",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Civil showdown",
    "category": "Kriyative",
    "one_line_desc": "Think, Build, Elevate",
    "description": "Join us for a joyous gathering with three thrilling rounds: Hint and Hunt, Quiz and Build, and Towering Triumphs. Collaborate as a team, race against the clock, and aim for victory! Enjoy the thrilling and enjoyable experience!",
    "round_title_1": "Hint and Hunt",
    "round_desc_1": "With the few hints provided by other team members, one person on the team is supposed to predict the material. The next step is for the guesser to retrieve the material from the lot. There will be a fifteen-minute time restriction. The points will be distributed according to how many materials each team collected.",
    "round_title_2": "Quiz and build",
    "round_desc_2": "A deck of cue cards will be distributed to each team. The cue card they chose will determine the questions that are asked. In light of their responses, Ice cream sticks will be allocated as points for every inquiry. Each team must use sticks and glue to construct a bridge at the conclusion of all the problems. Total points will be awarded based on the quantity of sticks and the stability of the bridge.",
    "round_title_3": "Towering Triumphs",
    "round_desc_3": "Every team will receive a  number of newspapers, and they will have fifteen minutes to use these newspapers and glue to construct a tower. The tower ought to hold till the very end. Depending on the tower's height, points will be given out.",
    "eventId": "EVNT0007",
    "contact_name_1": "Ramya S",
    "roll_1": "21C121",
    "contact_mobile_1": 8667804852,
    "contact_name_2": "Karthi P T ",
    "roll_2": "21C110",
    "contact_mobile_2": 8825783310,
    "hall": "J BLOCK (J313,314)",
    "teamSize": 2,
    "date": "23",
    "timing": "1.30 PM-4.30 PM"
  },
  {
    "eventName": "Civilphilia",
    "category": "Core Engineering",
    "one_line_desc": "Click, Build, Create",
    "description": "The event features three rounds: CAD Craft, challenging participants to showcase digital design skills; Elevate Experience, encouraging creative enhancement of creations; and Plan Talks, evaluating effective communication of design significance.",
    "round_title_1": "CAD craft.",
    "round_desc_1": "A line sketch of (G+1) residential building will be provided with all thedimensions, and the participants will have to prepare 2D plan in AutoCAD. The marks will begiven based on the accurate dimensioning and use of layers. Decorative blocks are not necessarybut may be provided for appearance. A time limit of 1 hour will be given.",
    "round_title_2": "Elevate experience.",
    "round_desc_2": "The participants must prepare the cross-sectional elevation and front elevation of their (G+1) residential building plan. Marks will be awarded for detailing doors, windows, columns, staircase, beam depth, and walls. The time limit is 1 hour 30 minutes.",
    "round_title_3": "Plan Talks.",
    "round_desc_3": "Participants will act as consultants and will be questioned regarding the provided building plan. They must address client problems effectively as consulting engineers. A 5-minute time limit will be given for plan analysis, followed by a 30-minute question session.",
    "eventId": "EVNT0008",
    "contact_name_1": "LakshmiPriya R",
    "roll_1": "21C211",
    "contact_mobile_1": 9344124899,
    "contact_name_2": "Sudhakkaran L",
    "roll_2": "21C125",
    "contact_mobile_2": 7708821174,
    "hall": "K BLOCK ( 2 ROOMS ) + CIVIL LAB & SEMINAR HALL",
    "eventRules": "Participants are advised to come with laptop, if not computers with Autocad version 2013will only be provided.",
    "teamSize": "2-3",
    "date": "24",
    "timing": "9.30 AM - 4.30 PM"
  },
  {
    "eventName": "Codebuster",
    "category": "Coding",
    "one_line_desc": "Make it work, make it right, make it fast!",
    "description": "CODEBUSTER is an exciting event that challenges participants to showcase their creativity and observational skills. It consists of two technical and intellectual rounds. The first round showcases the participants general knowledge about C and SQL languages.Selected participants will be moving on to the second round that tests the participants error detection and bugging skills. It is an event that is guaranteed to be exciting and challenging for all participants.",
    "round_title_1": "ELIMINATION MCQ",
    "round_desc_1": "The event begins with the first round, which consist of several MCQs based on general coding in C and SQL language. Participants will be given a G-form full of technical questions to challenge them and to showcase their knowledge and coding skills. The participants who have the maximum marks will be advancing to the next round.",
    "round_title_2": "DEBUGGING",
    "round_desc_2": "In the final round, participants will be made to analyse a buggy code designed using C program and find the errors and along with it complete few incomplete SQL codes. The main theme of this round is to find the bugs present in the code by without changing its logic. Based on the most correct answers participants will be declared as the winners of CODEBUSTER.",
    "eventId": "EVNT0009",
    "contact_name_1": "Sanjay J S",
    "roll_1": "21U216",
    "contact_mobile_1": 8754666233,
    "contact_name_2": "Shiva Shabari R M",
    "roll_2": "21U236",
    "contact_mobile_2": 8072570045,
    "hall": "G-509",
    "eventRules": "Round 1: \n->Using internet for answers is strictly prohibited.\n->Participants must complete their test within 15 minutes.\n->Participants need to wait until the results are released.\n->Participants need to have their phones within them to access the G-forms.\nRound 2: \n->Using internet for answers is strictly prohibited.\n->Participants must complete their test within 30 minutes.\n->Not allowed to use any compiler to debug the given code.\n->Time taken by the participant also plays a role during evaluation.",
    "teamSize": 1,
    "date": "24",
    "timing": "9:30 AM - 12:30 PM"
  },
  {
    "eventName": "Critical Thinker",
    "category": "Management",
    "one_line_desc": "Forge your success bridge.",
    "description": "This event aims to provide an arena for showcasing your intellectual skills and mastery in mechanical engineering. If you are brave enough to venture out, demonstrating your expertise in solving real-life problems and articulating the same in the best possible way, do sign up to prove your mettle.",
    "round_title_1": "Mind fizz",
    "round_desc_1": "It is a rapid-fire round consisting of technical questions related to mechanical engineering. We will judge the teams based on their correct answers and the timing of their responses to shortlist candidates for the final round.Rules:1. All contestants will participate in a rapid-fire quiz round. Participants will be evaluated based on the time and correctness of their answers, and shortlisted for the next round.2. The questions, totaling 50, will primarily cover the domain of strength of materials and kinematics of machinery in the mechanical stream.",
    "round_title_2": "Create the connectors",
    "round_desc_2": "This round is centered around the construction of a bridge. Participants are tasked with constructing a bridge structure that will be tested by hanging weight. Additionally, they are required to provide a description of the bridge's principle and application. The judges will then evaluate the entries, and the results will be disclosed.Rules:1. Participants can construct a bridge using ice sticks and glue. Evaluation is based on weight-bearing capacity, efficient use of materials to withstand the load, and an explanation of practical applications, including any necessary calculations.",
    "eventId": "EVNT0010",
    "contact_name_1": "Bharath V",
    "roll_1": "22M909",
    "contact_mobile_1": 9345582770,
    "contact_name_2": "Deepak Arjun K",
    "roll_2": "22M439",
    "contact_mobile_2": 9894530185,
    "hall": "G-401",
    "eventRules": "Round 1: \n->Using internet for answers is strictly prohibited.\n->Participants must complete their test within 15 minutes.\n->Participants need to wait until the results are released.\n->Participants need to have their phones within them to access the G-forms.\n\nRound 2: \n->Using internet for answers is strictly prohibited.\n->Participants must complete their test within 30 minutes.\n->Not allowed to use any compiler to debug the given code.\n->Time taken by the participant also plays a role during evaluation.",
    "teamSize": "2-4",
    "date": "25",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Dimensions in Design ",
    "category": "Kriyative",
    "one_line_desc": "Tech Harmony, Artistry Blend.",
    "description": "Dimensions In Design welcomes students across disciplines to compete in crafting avant-garde, futuristic garments. The competition challenges participants to step beyond their comfort zones, fusing technology seamlessly with fashion for both runway appeal and everyday wear. Judged on creativity, concept, inspiration, and effective articulation, the designs can revolve around themes like moving elements, AI integration, 3-dimensional aspects, color-changing features, and transforming/mutating/deforming elements. This platform encourages engineers and designers to unleash their ingenuity, producing unique and sci-fi-inspired clothing that captivates both on and off the runway.",
    "round_title_1": "DESIGN SHOWDOWN",
    "round_desc_1": "Participants create at least three CAD designs presented to judges within a 2-hour-15-minute timeframe. Alongside the designs, they provide a brief on inspiration, materials, and functionality. Project themes are chosen freely within provided options, with selections for the next round based on design originality and relevance. Designs may cater to men, women, or children, showcasing the participant's preference. The judging panel assesses the ingenuity of the designs and inclusion of design elements.",
    "round_title_2": "QUESTIONNAIRE",
    "round_desc_2": "The participants chosen for this round will be questioned based on their designs, material usage, overall concept and the feasibility of recreating the design in real life.  The same criteria will be used for final judging. ",
    "round_title_3": "nil",
    "eventId": "EVNT0011",
    "contact_name_1": "Logitha Varshini Ramesh",
    "roll_1": "21IF001",
    "contact_mobile_1": 9585524279,
    "contact_name_2": "Dhanya ",
    "roll_2": "21PF03",
    "contact_mobile_2": 9384360089,
    "hall": "A & F CAD LAB",
    "eventRules": "Round 1:\n->Participants can bring their own devices if possible.\n->3 designs must be done by a team.\n->Adobe Illustrator and Photoshop are the softwares allowed.\n->Maximum 3 people per team.",
    "teamSize": "2-3",
    "date": "23",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "DrapeTales : Where Every Creator Tells A Tale",
    "category": "Kriyative",
    "one_line_desc": "Where every drape tells a tale",
    "description": "The participants in this event will be competing based on their knowledge of textile and fashion. The preliminary two rounds would test their knowledge about fashion, textile and their knowledge on fabrics. The main part of this event is the draping of the fabric on the dummy in accordance within the rules provided.",
    "round_title_1": "Hue Match",
    "round_desc_1": "Participants earn square paper pieces of slightly varying hues based on points from a fashion and textile quiz. The quiz, conducted via group polling, rewards correct answers with shaded papers. The hue variations, ranging from 8-12, match the expected participants. Upon receiving the papers, participants arrange them to test color analysis skills. Teams closest to the actual hue scale gain higher points.",
    "round_title_2": "Find The Fabric",
    "round_desc_2": "In this round, participants receive five out of ten different fabrics. Their task is to analyze each fabric and correctly match it to its fabric structure, testing their knowledge of various fabrics and analytical skills. Additionally, participants are provided with various parameters to analyze, and they must provide accurate answers, further assessing their comprehension of fabric characteristics.",
    "eventId": "EVNT0012",
    "contact_name_1": "Shanruthi  H ",
    "roll_1": "21H224",
    "contact_mobile_1": 8754377560,
    "contact_name_2": "Mughul B ",
    "roll_2": "21H217",
    "contact_mobile_2": 6380402699,
    "hall": "G BLOCK (604,605)",
    "eventRules": "Round 1:\n->Online polling method will be used for the answering.\n->The scores obtained from the activities will be used to scrutinize the participants for the next round.\n->In case of tie in filtering the teams, the teams that complete the task in minimal time will have an added advantage.\n->Indulging in any malpractice, if found will result in the disqualification of the team.\nRound 2:\n->The fabric shall be analysed and the right structure shall be found answering the required parameters.\n->Fabric can be unraveled and analysed for the identification.\n->Once the fabric has been given it can't be changed.\n->This should be carried out only within the given time.\n->The teams with the highest score will be filtered to the next rounds; if a tie arises, the score of the answers to the parameters and their respective time of submission will also be taken into account.\n->Indulging in any malpractice, if found will result in the disqualification of the team.",
    "teamSize" :"2-3",
    "date": "25",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Dynamix",
    "category": "Management",
    "one_line_desc": "Power up to conquer together",
    "description": "Calling all dynamic duos! Grab your partner in physics and join us to unleash your combined physics genius. Are you ready to embark on a thrilling journey of knowledge and collaboration?The rounds focus on testing the participant’s individual abilities along with their coordination with their respective partner.",
    "round_title_1": "SYNERGY",
    "round_desc_1": "Individually brilliant, collectively unstoppable! Teams, split into Player A and Player B, showcase synergy in physics harmony. Player A of all the teams ar combined to form Group A and same with Group B. Group A will receive a set of questions based on the topic-\"physics Phenomena\" and they are expected to write down the number of letters in the answer. Group B will be given MCQs based on the same topic and the should strike out the 2 least probable options out of the 4 given.  After 25 minutes, the question sets are swapped and Group A has to identify the correct answer out of the unstriked ones, and  Group B has to identify the answer for the question gven to Group A.",
    "round_title_2": "BID BASH",
    "round_desc_2": "Bet on your partner's physics prowess in this thrilling auction challenge! Each team starts with 1500 points, bidding on images representing various physics concepts. Group-A bids on their partner's ability to explain, with the highest bidder requiring their partner in Group-B to articulate the phenomenon. Successful explanations earn points, while unsuccessful ones result in point deductions. The bidding and explaining alternate for each image in a cycle, with specific time limits for responses. Three images complete one cycle, showcasing teamwork and strategic bidding in this dynamic physics competition.",
    "eventId": "EVNT0013",
    "contact_name_1": "Devarishigan  V S",
    "roll_1": "21L208",
    "contact_mobile_1": 9944676750,
    "contact_name_2": "Saswatha K A",
    "roll_2": "21L242",
    "contact_mobile_2": 9487336688,
    "hall": "G BLOCK (506,507)",
    "eventRules": "Round 1 Rules:\n->No usage of electronic gadgets.\n->If malpractice is found, the team will be disqualified.\nRound 2 Rules:\n->No usage of electronic gadgets.\n->If a team doesn’t make at least one bid in 2 consecutive cycles, the team would be disqualified.",
    "teamSize": 2,
    "date": "24",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Eco couture Canvas - Sustainable Creation",
    "category": "Management",
    "one_line_desc": "Elevate Discarded Threads.",
    "description": "This competition revolves around crafting a sustainable product using materials provided by the Apparel and Fashion Design department. Students are tasked with creating a practical kids' wear garment that embodies sustainability principles, including zero waste, durability, absence of plastic, climate and environmental friendliness, and the use of recycled or upcycled materials. The end product should be a functional upcycled garment, with participants evaluated on their creativity and the practicality of the garment in real-time use.",
    "round_title_1": "Design storm",
    "round_desc_1": "Different topics will be given to each team. The contestants need to create a garment out of material provided by the department and draw up a strategy for their garment process. Designs can be done for kids wear only (boy or girl). The participants will be given 45 minutes to brain-storm their ideas.",
    "round_title_2": "MAKING IT A REALITY",
    "round_desc_2": "The contestants must prepare a single workable garment, which is to be presented in front of a panel of judges. Garments would be judged based on their creativity, how well they can be used in real-time, how sustainability has been implemented and the functional aspect of it. The participants will be given 2 hours and 40 minutes for the creation of their garment. They have to explain their idea, thought process and creation of the garment to the panel of judges.",
    "round_title_3": "nil",
    "eventId": "EVNT0014",
    "contact_name_1": "Nimisha Kamakshi R",
    "roll_1": "20PF14",
    "contact_mobile_1": 6374641261,
    "contact_name_2": "Madhumithaa R T",
    "roll_2": "21PF08",
    "contact_mobile_2": 9363011141,
    "hall": "M BLOCK 2ND FLOOR LAB",
    "eventRules": "ROUND 1 RULES:\n->Extra time will not be provided.\nROUND 2 RULES:\n->Extra time will not be provided.\n->Outside materials cannot be used.",
    "teamSize": "2-4",
    "date": "24",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Ethereal Cosmos",
    "category": "Amuse",
    "one_line_desc": "Discover celestial wonders.",
    "description": "Embark on an enchanting cosmic realm within our celestial exhibition, where the elegance of unidentified cosmic gateways, the intricate pathways of cosmic achievements, and the timeless allure of celestial treasures converge in a captivating narrative. \nExplore the artistic wonders of our student audience corner, adorned with poetic verses, awe-inspiring artworks, and dreams that stretch beyond the stars. \nMarvel at the cosmic achievements of Nobel Prize winners, tracing their celestial footprints in the vastness of our showcase. Immerse yourself in vibrant astropalettes that paint the cosmos with a spectrum of imagination. \nNavigate the nebulous pathways shaped by the remarkable missions of NASA and ISRO, witnessing the unfolding cosmic dance guided by pioneers in space exploration. \nJoin us on this cosmic odyssey, where the wonders of the universe and the brilliance of human achievement come alive in a symphony of discovery, creativity, and limitless potential beyond the cosmic horizon.",
    "round_title_1": "",
    "round_desc_1": "It is an exhibition event , open to everyone",
    "round_title_2": "",
    "round_desc_2": "",
    "eventId": "EVNT0015",
    "contact_name_1": "Dharun V S",
    "roll_1": "21L211 ",
    "contact_mobile_1": 8778630200,
    "contact_name_2": "Sreevana T P",
    "roll_2": "21E148.",
    "contact_mobile_2": 6380588041,
    "hall": "G-302",
    "teamSize": "",
    "date": "24, 25",
    "timing": "9.30 AM - 4.30 PM"
  },



  {
    "eventName": "Forensicist",
    "category": "Kriyative",
    "one_line_desc": "Unearth the Untold",
    "description": "The Forensicist event, designed for 3-4 players, unfolds in two captivating rounds. In the initial stage, teams meticulously explore the killer's room, tackling tasks to test their observational skills. Successful teams advance to the second round, immersing themselves in the role of detectives assigned to a crime case. Analyzing evidence, interrogating suspects, and consulting eyewitnesses, teams aim to unveil the killer within a specified time limit.",
    "round_title_1": "Unravelling Secrets: The Challenge",
    "round_desc_1": "\"Unraveling Secrets: The Challenge\" unveils an enthralling team event where participants step into the role of detectives solving a captivating mystery. The adventure begins with an exploration of the killer's room, gathering essential clues and scientific evidence. As participants progress, they encounter a series of tasks related to questions linked to the killer's room, determining their advancement to the next round.",
    "round_title_2": "Inquisitive Sleuth: Unmask the Guilty",
    "round_desc_2": "Step into the role of an investigator, tasked with solving a murder case using a comprehensive case file, including suspect and witness statements, crime scene details, and descriptions. Visit the actual crime scene for deeper insights and engage in a re-investigation, employing cross-examination techniques. After a thorough analysis, identify the true killer among suspects. The top investigator, accurately deducing the killer and articulating the motive, will be recognized as the winner.",
    "eventId": "EVNT0016",
    "contact_name_1": "Priyadharshini J M ",
    "roll_1": "21B235",
    "contact_mobile_1": 8667598100,
    "contact_name_2": "Karishma Priyadharshini R",
    "roll_2": "21B215",
    "contact_mobile_2": 8807842297,
    "hall": "J BLOCK (411-15)",
    "eventRules": "Round 1 Rules :\n->A team of three to four members will participate in this round.\n->A killer theme-based room will be set up, where participants will be given to observe the details in the room for 10 minutes.\n->The team that answers the questions according to their observation and gains points.\n->Participants with high points are qualified for the next round.\n->Participants are expected to maintain decorum or else will be eliminated.\nRound 2 Rules : In this round, the participants are provided with a case file of a crime and are allowed to observe the crime site for 2 minutes.\n->They are allowed to interrogate various suspects and eye witnesses for 10 minutes. The participants are allowed to discuss within themselves and come up with the criminal (the killer) with an agreeable reason.\n->The final answer should be reported by completing the case file with all the necessary details.\n->Teams guessed the correct killer should provide suitable reasons for accusations of that person (killer).\n->Participants are expected to maintain decorum or else will be eliminated.",
    "teamSize": "3-4",
    "date": "24",
    "timing": "9.30 AM - 4.30 PM"
  },
  {
    "eventName": "Futuristic Techo",
    "category": "Amuse",
    "one_line_desc": "Enchanting Eco-Adventure!",
    "description": "This event promises not just a challenge but an adventure through the diverse landscape of energy resources. Prepare to unravel the mysteries, connect the dots, and showcase your expertise in the dynamic field of sustainable energy. Join us for an exhilarating experience where knowledge meets excitement, and only the sharpest minds prevail!",
    "round_title_1": "FUNZEE",
    "round_desc_1": "Join us for an exhilarating intellectual showdown! Experience mind-bending challenges in the \"Crossword, PictoQuiz, and Scrambled\" rounds, testing your knowledge on energy resources. In the Crossword phase, solve wordplay puzzles related to renewable, conventional, and non-conventional energy. The Picto-Quiz engages visual acumen, linking images to energy resources. The Scrambled round tests linguistic prowess in unveiling relevant words. Top-scoring teams proceed to the next round.",
    "round_title_2": "FAB FIVE",
    "round_desc_2": "Dive into an event with visual puzzles and rapid thinking! This segment combines visual acuity and quick reflexes, testing both observation and speed. In the first division, discern the common thread connecting two intriguing images. It's a race of perception where keen eyes and astute minds shine. Transitioning to the second division, burst colored balloons to earn the chance to swiftly answer questions related to five diverse pictures, each representing a fragment of a concept. Get ready for an electrifying blend of visual intrigue and rapid-fire responses, racing against time and fellow participants.",
    "eventId": "EVNT0017",
    "contact_name_1": "Kishore K",
    "roll_1": "21E121",
    "contact_mobile_1": 9787074343,
    "contact_name_2": "Narmadha M ",
    "roll_2": "21E130",
    "contact_mobile_2": 9600722637,
    "hall": "G BLOCK(508,509)",

    "eventRules": "RULES FOR ROUND 2:\n->Set a specific time limit for each round to keep the game moving at a good pace.\n->Participants need to announce the common connection or similarity between the two pictures after observing them.\n->When the five pictures representing different parts of the world are displayed, participants should burst the balloon of the color they think corresponds to the correct answer.\n->The participant or team that bursts the correct color balloon first gets the opportunity to answer the question.\n->Have tiebreaker questions prepared in case two or more participants or teams have the same score.",

    "teamSize": "1-2",
    "date": "25",
    "timing": "9.30 AM  - 4.30 PM"
  },
  {
    "eventName": "InnovateX",
    "category": "Brainiac",
    "one_line_desc": "Ignite the Technical Duel!",
    "description": "Each team will be given two sets of questions. All the questions in this round are technical. Only top 10 teams will be shortlisted for the second round. In this each team has to select either circuit-based or coding-based question and they will be provided respective lab-facilities based on the question they have selected. For circuit-based they will be given respective components and the output they are expected to produce.",
    "round_title_1": "Techsphere ",
    "round_desc_1": "The quiz consists of two sets of technical questions. In the first set, a main question and 5 sub-questions offer 5 and 2 points, respectively. The main question's answer is the first letter of each sub-question's answer. In the second set, participants decode technical-related answers from 5 images accompanied by clues. The top 10 teams advance to the next round. All questions are technical in nature.        ",
    "round_title_2": "Codepulse",
    "round_desc_2": "The competition features two sets of questions: one focused on circuits and the other on coding. Participants choose either a coding or circuit-based question. In the coding section, they must generate a specified output within constraints. For the circuit segment, participants use lab components to build and produce the output. The top team and runner-up are selected from the 10 participating teams.",
    "eventId": "EVNT0018",
    "contact_name_1": "Bharath K",
    "roll_1": "21L106",
    "contact_mobile_1": 9597956168,
    "contact_name_2": "Sai Prasath A",
    "roll_2": "21L240",
    "contact_mobile_2": 9344993481,
    "hall": " H-201, Device and circuit lab,2nd floor,E block & GRD lab,2nd floor,E block",
    "eventRules": "Round 1:\n->Points will be awarded to the main question only if the answer is completely correct, and points will not be given for partial filling of the answers.\nRound 2:\n->Coding-part:\n->Violation of the constraints will result in a reduction of points.\n->Participants are allowed to use only the C language.\n->In case no participant produces the target output, it will be evaluated based on the efficiency of the program and its implementation.\n->Circuit-part:\n->All the components given must be used.\n->Extra components will be provided if he/she has valid reasons.\n->In case no participant produces the target output, it will be evaluated based on efficient design and implementation.",
    "teamSize": 2,
    "date": "24",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Innovation Forge ",
    "category": "Kriyative",
    "one_line_desc": "Fuel Your On-the-Spot Imagination!",
    "description": "Participants will be handed unique and surprise mechanisms at the event kickoff, testing their adaptability and ingenuity. Armed with these mystery components, teams must collaboratively design and construct a compelling 3D model within a specified timeframe. Immerse yourself in the thrill of quick thinking, problem-solving, and teamwork as you navigate the uncharted waters of spontaneous innovation. Let your imagination soar and bring your on-the-spot creations to life in this dynamic and exhilarating design challenge!",
    "round_title_1": "Rapid 3 D Modelling Challenge",
    "round_desc_1": "In the Rapid 3D Modelling Challenge, participants will demonstrate their expertise in spontaneous 3D modeling using Creo Parametric 6.0. This round aims to evaluate their capability to swiftly and accurately interpret engineering drawings, all while showcasing a profound understanding of real-world challenges, including material shrinkage in 3D printing.The competition promises an intense showdown as participants race against the clock to craft impeccable 3D model assemblies. Get ready for a high-octane showcase of skill and precision!",
    "round_title_2": "Innovation Unleashed",
    "round_desc_2": "Experience an exciting engineering challenge with surprise mechanisms using Creo Parametric 6.0. Participants design, assemble, and simulate models on dedicated systems, showcasing quick thinking and simulation skills. Expert judges assess virtual simulations, recognizing inventive and functional designs. Unleash your creativity and engineering acumen in this spontaneous journey of design excellence! Computers with pre-installed Creo software will be provided.",
    "eventId": "EVNT0019",
    "contact_name_1": "Tharun Balaji V S ",
    "roll_1": "21P636",
    "contact_mobile_1": 9342352371,
    "contact_name_2": "Dheeban S",
    "roll_2": "21P608",
    "contact_mobile_2": 9791752308,
    "hall": "MECH DESIGN LAB",
    "eventRules": "Participants must not use their mobile phone (as to refer) while designing the model.\nParticipants must design only the mentioned mechanism.\nThey will be assessed based on the innovation for this round.\n->Drawing Interpretation (10 points):\nParticipants will be provided with diverse engineering drawings representing different components. They must swiftly and accurately interpret these drawings to begin the 3D modelling process.\n->Speed and Efficiency (15 points):\nTime is of the essence in this round. Participants will be allotted a fixed time to complete the 3D model assembly. Points will be awarded based on the speed and efficiency of their modelling process.\n->Accuracy (20 points):\nPrecision is paramount. The accuracy of the final 3D model assembly will be closely scrutinized. Points will be deducted for any discrepancies or deviations from the provided engineering drawings.\n->Material Shrinkage Consideration (15 points):\nA key challenge in 3D printing is material shrinkage. Participants must demonstrate an understanding of this phenomenon and make necessary adjustments in their 3D models to compensate. Points will be awarded for implementing effective solutions.\n->Creativity and Innovation (10 points):\nWhile accuracy is crucial, participants are encouraged to showcase their creativity and innovative problem-solving skills. Bonus points will be awarded for unique and efficient modelling approaches.\n->Documentation (10 points):\nParticipants must provide concise documentation outlining their modelling process, challenges faced, and solutions implemented. Clear and comprehensive documentation will earn them additional points.\n->Presentation (10 points):\nEach participant will have a brief moment to present their 3D model assembly to the judges. Clarity, confidence, and the ability to articulate design decisions will be evaluated.\n->Adherence to Creo Parametric 6.0 Features (10 points):\nParticipants must utilize the features and functionalities of Creo Parametric 6.0 effectively. Points will be awarded for the adept use of the software.\n->Judges' Discretion (10 points):\nJudges may allocate additional points based on exceptional performance, problem-solving skills, or any other outstanding aspects observed during the round.",
    "teamSize": 1,
    "date": "23",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Kriya Open Quiz",
    "category": "Gold",
    "one_line_desc": " A trivial battle for the bravest",
    "description": "Kriya Open Quiz: A dynamic, two-round quiz battle merging diverse topics, UNO card strategy, and rapid-fire challenges for teams to showcase their intellect and agility.\"",
    "round_title_1": "KRIYATE QUIZ ",
    "round_desc_1": "Questions will be displayed on a screen covering various topics and teams must write their answers for each question within the given time limit. Each question will incorporate built-in tiebreakers, ensuring a thrilling competition and encouraging accuracy and depth of knowledge.",
    "round_title_2": "QUIZ QUADRANT",
    "round_desc_2": "In the Direct and Pass Round, teams take turns either answering displayed questions or passing them to another team, earning full points for direct answers and half points for passed questions.\nIn the UNO Cards Challenge, teams face questions displayed on screen and strategically use UNO cards to determine point values, selecting from numbers 1 to 9 and special cards like Skip, 2 Plus, and 4 Plus.\nThe Theme-based Round follows, where teams with higher scores gain priority in choosing themes, answering questions related to their selected themes for points, with zero points awarded for every wrong answer.\nIn the Rapid Fire Round, teams navigate a series of fast-paced questions, buzzing in quickly to earn points for correct answers, while every wrong answer results in negative points.\nIn the event of a tie, the Tie Breaker Round involves teams facing a set of 5 rapid-fire questions, buzzing in quickly to answer, and the team with the highest score at the end emerges as the winner.",
    "eventId": "EVNT0020",
    "contact_name_1": "SREENITHI R",
    "roll_1": "-",
    "contact_mobile_1": "9487525890",
    "contact_name_2": "PRITHIV VIJAY U G",
    "roll_2": "-",
    "contact_mobile_2": "8525969400",
    "hall": "F BLOCK ASSEMBLY",
    "eventRules": "Each Correct answers: 1 point \n Wrong answers :0 point(only for round 1)",
    "teamSize": "1-2",
    "date": "23",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Load Glider",
    "category": "Management",
    "one_line_desc": "Glider payload carrier",
    "description": "Take on the Glider Challenge, a thrilling competition with two thrilling rounds! Pilots will test their knowledge of aircraft and aeromodelling in the first quiz round. Then, in Round 2, the competitors who made the short list will fly with cardboard or foam gliders. The top three gliders with the longest trip times will soar to victory, transforming this challenge into an exciting fusion of practical innovation and aeronautical knowledge!",
    "round_title_1": "AERO QUIZ",
    "round_desc_1": "The PILOTS  (participants) will “take off” on a quiz in the first round related to aircraft and aeromodelling . Those who are shortlisted will proceed to round 2. ",
    "round_title_2": "GLIDER BINDER",
    "round_desc_2": "The pilots shortlisted from round 1 will start making gliders with a wingspan not exceeding 1 meter. The glider can be made with foam or card board material and should carry a 50 gram payload (payload will be provided). The top 3 that cover the most distance will be selected and awarded.",
    "eventId": "EVNT0021",
    "contact_name_1": "Lokeshwaran B",
    "roll_1": "21P913",
    "contact_mobile_1": 9894359939,
    "contact_name_2": "Dhakshnamoorthy K",
    "roll_2": "21M606",
    "contact_mobile_2": 9384194466,
    "hall": "CAE (K BLOCK) & N BLOCK GROUND ",
    "eventRules": "Round 1:\n->Participants will attend the quiz on the Kahoot website. Each question will carry one mark, and the participants should choose the option within the allotted time for each question.\nRound 2:\n->Glider should be built only with the provided material.\n->Glider’s main wing should not exceed 1 meter in length.\n->Payload of 50 grams should be carried when the glider is airborne.",
    "teamSize": 1,
    "date": "23",
    "timing": "9.30 AM - 4.30 PM"
  },
  {
    "eventName": "Locked & Loaded ",
    "category": "Amuse",
    "one_line_desc": "Beat the clock and escape",
    "description": "Dive into an adventure blending Connections, Family Feud, and Escape the Room! Unleash your strategic prowess, solve intriguing puzzles, and outsmart challenges for an unforgettable experience. Join us in a dynamic event where excitement knows no bounds!",
    "round_title_1": "Connections",
    "round_desc_1": "In the opening round, immerse yourself in the cinematic world! Unravel the plot as sequences of pictures from iconic movies unfold before you. Get ready for a visual challenge that tests your movie knowledge like never before!",
    "round_title_2": "Face-Off",
    "round_desc_2": "Gear up for face-off battles in this thrilling round, mirroring the excitement of Steve Harvey's Family Feud! Teams clash in an epic showdown, and only the victorious ones will advance to the next exhilarating adventure. It's a showdown where strategy meets excitement—don't miss the chance to be part of the action!",
    "round_title_3": "Chamber Of Secrets",
    "round_desc_3": "Embark on a sophisticated and intellectually stimulating experience within intricately themed escape rooms. Navigate through a series of challenging puzzles, meticulously designed to unlock the room's door. Engage in a cerebral adventure, unraveling mysteries and showcasing your problem-solving acumen in an environment that exudes sophistication and suspense.",
    "eventId": "EVNT0022",
    "contact_name_1": "Vidhul Praveen ",
    "roll_1": "20PC38",
    "contact_mobile_1": 9843670696,
    "contact_name_2": "Samyuktha Balasubramanian",
    "roll_2": "20PC29",
    "contact_mobile_2": 9345139836,
    "hall": "H BLOCK (201,202,203)",
    "teamSize": "1-2",
    "date": "23",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Mechmaniacs",
    "category": "Brainiac",
    "one_line_desc": "Burst into Mechanical component",
    "description": "Engage in three rounds, articulate your thoughts with precision, and unleash the engineer within to showcase your ideas effectively!",
    "round_title_1": "Connectionzz",
    "round_desc_1": "Discover the names of mechanical components by making connections through visual cues in the pictures.",
    "round_title_2": "Puzzle matching",
    "round_desc_2": "Embark on a captivating puzzle challenge, matching mechanical parts to their correct names within a set time frame for an engaging experience!",
    "round_title_3": "Express yourself",
    "round_desc_3": "Participants choose a component by matching it with its corresponding counterpart. Once a component is selected, the team is tasked with delivering a comprehensive lecture on that particular component, elucidating its functioning and construction details.",
    "eventId": "EVNT0023",
    "contact_name_1": "Chottramizhl M",
    "roll_1": "21M106",
    "contact_mobile_1": 9944849603,
    "contact_name_2": "Pradeep G",
    "roll_2": "21M623",
    "contact_mobile_2": 9344420916,
    "hall": "J - 314",
    "eventRules": "EVENT RULES:\n->Registered Participants must come with a Laptop.\n->Judges' Decisions are final.\n->Students must attend the event with their College ID Card.\n->Usage of Mobile phones is strictly prohibited during the conduction of the event.\nROUND 1 RULES:\n->25 participants are selected for Round 2.\nROUND 2 RULES:\n->10 participants are selected for Round 3.\nROUND 3 RULES:\n->Lecture will be given about 5 minutes.",
    "teamSize": 1,
    "date": "25",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Mid Day Madness",
    "category": "Management",
    "one_line_desc": "Craft plans that resonate",
    "description": "‘Mid-day Madness’ is a management event which stimulates the idea about the budget planning and sales skills. Students will be tested with their effective planning of the available resources and their effective communication to sell a product.",
    "round_title_1": "BUDGET PROPOSAL",
    "round_desc_1": "In this round a team will be given a budget where they must establish a business proposal within the given budget. In this round the list of domains will be given to the participants. Time will be given for them to brain storm and present their plans.  The teams which give out the best proposals without wasting the budget or the resources and which communicates effectively will be moving for the final round.",
    "round_title_2": "SOLD OUT",
    "round_desc_2": "In the final round, each team will be called to the dias. The product can be collected through a treasure hunt by each team using clues. He/she are asked to sell the product to the panel of judges. Based on the skills on how effectively he/she convinces the customer to buy their product the winners will be selected.",
    "eventId": "EVNT0024",
    "contact_name_1": "Nasrin M S ",
    "roll_1": "21Y116",
    "contact_mobile_1": 9486232388,
    "contact_name_2": "Ajay Kumar K",
    "roll_2": "21Y102",
    "contact_mobile_2": 8248890149,
    "hall": "G - 301",
    "eventRules": "Each team should have a maximum of 2 members.\n->Answers submitted after the time limit will not be considered for marks.",
    "teamSize": 2,
    "date": "24",
    "timing": "9:30 AM - 12:30 PM"
  },
  {
    "eventName": "Mystery Quest",
    "category": "Amuse",
    "one_line_desc": "Pattern it, Tune it!",
    "description": "Mystery Quest is an exciting event that challenges participants to showcase their creativity and observational skills. It consists of two Amusenical fun rounds. The first round showcases the participants' time managing and memory skills. Selected participants will be moving on to the second round of MYSTERY QUEST that tests the participants observation skills. ",
    "round_title_1": "BRAINDECO",
    "round_desc_1": "In the first round, the participants will be given a bowl which consists of folded papers of some animated images. The participants are made to organize those images to form a meaningful picture. The participants with fast arrangement of a given puzzle have the better chances of advancing to the next round.",
    "round_title_2": " TRIVIA CHALLENGE",
    "round_desc_2": "In the ultimate round, contestants will partake in a trivia challenge, drawing from the puzzle they adeptly assembled during BrainDeco. The questions will pertain to the images arranged, putting participants' observational skills to the test. The victors of Mystery Quest will be those with the highest number of accurate answers.",
    "eventId": "EVNT0025",
    "contact_name_1": "Lakshmi Priya G",
    "roll_1": "21U211",
    "contact_mobile_1": 6374263410,
    "contact_name_2": "Kanishga R",
    "roll_2": "21U217",
    "contact_mobile_2": 8072060956,
    "hall": "G-505",
    "eventRules": "For ID verification, a college ID card is required.\nParticipants should enter the allotted room on time.\nParticipants must not make noise throughout the event.\nParticipants should come with a proper dress code.\nMalpractice is strictly prohibited.\nThe time limit will be strictly adhered to.\nParticipants are supposed to be present on time.\nAt the end of the first round, 10 teams will be filtered.\nJudge’s decision will be final.",
    "teamSize": 2,
    "date": "24",
    "timing": "1.30PM - 4.30PM"
  },
  {
    "eventName": "NexTech - Shaping tomorrow, today",
    "category": "Gold",
    "one_line_desc": "Crafting the Future, Here and Now.",
    "description": "\"NexTech invites students to a one-day hackathon focusing on Smart Campus Solutions. Participants engage in challenges spanning Smart Parking, Enhanced Campus Resources, Sustainable Operations, and Inclusive Environments. The goal is to emPower students to apply technical skills, address real-world campus issues, and foster innovation and collaboration. Teams of 2-4 members can ideate, prototype, and present solutions for more efficient, sustainable, and inclusive college campuses.\"",
    "round_title_1": "“BrainStorm Blitz”",
    "round_desc_1": "NexTech Hackathon starts with a 1.5-hour ideation sprint, generating innovative solutions in Smart Parking, Enhanced Campus Resources, Sustainable Operations, and Inclusive Environments. Teams then embark on a 2.5-hour prototyping marathon, translating ideas into practical solutions. This dynamic round emphasizes teamwork, strategic thinking, and showcases technical prowess, laying the foundation for groundbreaking concepts to enhance campus life.",
    "round_title_2": "HackXpress",
    "round_desc_2": "During the final round, participants will be given a time of 10 minutes per team to present theirwell-prepared prototypes. Each team will showcase its innovative solutions, emphasizing how itcan improve campus efficiency, sustainability, and overall experience. This session will providestudents with an opportunity to express their ideas clearly and effectively, which can impress thejudges and peers. The teams will be evaluated based on their technical proficiency showcasedthrough their prototypes, as well as their creativity, innovation, and overall execution of the idea.",
    "eventId": "EVNT0026",
    "contact_name_1": "Mithilesh E N",
    "roll_1": "21Z229",
    "contact_mobile_1": 8883912299,
    "contact_name_2": "Sheryl A G",
    "roll_2": "21Z348",
    "contact_mobile_2": 7530070802,
    "hall": "CC lab,programming lab(E block- 1st floor)    ",
    "eventRules": "ROUND 1:\n->Teams: Teams of 2-4 individuals can participate in the event.\n->Concept Selection: Each team selects one concept related to the themes given for further development.\n->Design Thinking: Teams must incorporate design thinking principles for and build practical and user-centric solutions.\n->Working Prototype: Teams must build a practical prototype in the given short period of time which would be presented during the final round.\n->Documentation: Teams should document their progress and their prototyping work during this round.\nROUND 2:\n->Presentation Timings: A strict 10-minute limit is allotted for each team presentation.\n->Content Focus: Participants must showcase the proposed innovative solution and the corresponding prototype. They should clearly demonstrate how the solution enhances campus efficiency.\n->Evaluation: Teams will be assessed based on technical proficiency, creativity, innovation, and overall execution.\n->Documentation Submission: Teams are required to submit documents and presentations prepared during the first round for evaluation purposes",
    "teamSize": "2-4",
    "date": "23",
    "timing": "9.30 AM  - 4.30 PM"
  },
  {
    "eventName": "Nowornever Nexus",
    "category": "Management",
    "one_line_desc": "Forge the Connections",
    "description": "Teams compete to win card sets by showcasing technical knowledge, matching them in the \"Clothing Science\" round. Participants analyze product features on the fly, while one player spins cotton into yarn, and another organizes multi-colored fabric. The overall score reflects precision in these dynamic tasks.",
    "round_title_1": "CARD RIFT RUMBLE",
    "round_desc_1": "In this stage, teams secure a set of cards by winning games, followed by a matching process. The alignment is based on their technical expertise, and the assessment hinges on the accuracy and timing of the match.",
    "round_title_2": "IMPROMPTU",
    "round_desc_2": "Clothing science is the basis for this round. A product will be handed out or shown, andparticipants will engage in an on-the-spot discussion where they must describe the features andattributes of the product. The evaluation will take place in accordance with the validity of thepoints.",
    "round_title_3": "TWIST AND HUE",
    "round_desc_3": "In this round,one player will be given cotton fiber, which they must spin into yarn usingtheir hands in the allotted time and the another player must maintain the orderliness of the shadewhen they receive fabric with varying colors . The average score will be determined based on bothpieces.",
    "eventId": "EVNT0027",
    "contact_name_1": "Mouniga Sri N M ",
    "roll_1": "21T114",
    "contact_mobile_1": 8056460400,
    "contact_name_2": "Roja P",
    "roll_2": "21T123",
    "contact_mobile_2": 9944819829,
    "hall": "H BLOCK (206,207)",
    "eventRules": "RULES OF ROUND 1:\n->One player has to play the task and the other to match the cards.\n->Limited time only allotted to complete the tasks.\nRULES OF ROUND 2:\n->A picture will be projected.\n->Only 5 minutes will be given for discussion.\n->One player has to give the points within two minutes.\nRULES OF ROUND 3:\n->One player has to do hand spinning and the other one for shade matching.\n->Limited time only allotted for hand spinning.\n->Based on the strength and twist of yarn, marks will be evaluated.",
    "teamSize": 2,
    "date": "23",
    "timing": "9.30 AM  - 4.30 PM"
  },
  {
    "eventName": "Pixel To Prototype",
    "category": "Coding",
    "one_line_desc": "Code, Create, Conquer",
    "description": "Welcome to our thrilling Frontend Development Challenge! Unleash yourcoding prowess in two exhilarating rounds. Round one beckons participants to mirror a simple yet elegantUI design into a stunning application. For the finalists, round two poses a daring task: replicate a complexUI, showcasing your technical finesse and creativity. Teams of up to three can join forces to conquer thischallenge. Do you have what it takes to transform designs into captivating frontends? Join us for a chanceto showcase your skills, win exciting prizes, and leave your mark in the world of frontend development!",
    "round_title_1": "A Quick Gaze",
    "round_desc_1": "In this round, participants will showcase their ability to translate a provided simple UI design into a fully functional frontend application. This round aims to test basic frontend development skills and attention to design detail.",
    "round_title_2": "Web-Weaver Showcase",
    "round_desc_2": "This round presents a more challenging task where finalists showcase advanced frontenddevelopment skills by replicating a complex UI design into a fully functional frontend application. Thisround delves deeper into creativity and technical expertise.",
    "eventId": "EVNT0028",
    "contact_name_1": "Aadil Arsh S R",
    "roll_1": "21Z201",
    "contact_mobile_1": 7092449377,
    "contact_name_2": "Amruth K Warrier",
    "roll_2": "21Z302",
    "contact_mobile_2": 9488200354,
    "hall": "CC LAB 1 & 2",
    "eventRules": "ROUND 1:\n->Task Description:\n-> Design Specification: Participants will receive a basic UI design consisting of essential elements like buttons, forms, basic layouts, etc. This design will be straightforward, focusing on fundamental frontend components.\n-> Technology Freedom: Participants are free to choose their preferred frontend technologies, frameworks, or libraries they deem fit for the task.\n-> Functionality: The replicated application must accurately reflect the provided design in terms of layout, color scheme, fonts, and overall aesthetics.\n-> Interactivity: Basic functionalities such as form submissions, button actions, or simple animations, if included in the design, should be implemented.\n-> Time Limit: A specified time frame will be provided for participants to complete and submit their projects.\n-> Submission Guidelines:\n-> Plagiarism and use of UI to code conversion tools will lead to immediate disqualification.\n-> Submissions must be made within the allocated time to qualify for evaluation.\n\n-> ROUND 2:\n-> Task Description:\n-> Design Complexity: Participants will receive a more intricate and elaborate UI design compared to Round 1. This design will encompass multiple elements, intricate layouts, dynamic content, and potentially advanced functionalities.\n-> Technological Freedom: Similar to Round 1, participants have the freedom to choose their preferred frontend technologies, frameworks, and libraries to execute the task effectively.\n-> Attention to Detail: Accuracy in replicating the design's intricacies, including complex layouts, responsiveness across devices, animations, and any dynamic components, will be crucial.\n-> Advanced Functionalities: The replicated application should go beyond basic features and may include advanced interactions.\n-> Time Limit: A defined time frame will be provided for finalists to complete and submit their projects.\n-> Submission Guidelines:\n-> Finalists must submit their source code along with their obtained output.\n-> Submissions must adhere to the allocated time frame to be considered for evaluation.\n-> Candidates must adhere to the rules and regulations of the event.",
    "teamSize": "1-3",
    "date": "24",
    "timing": "9.30 AM - 4.30 PM"
  },
  {
    "eventName": "Quotient",
    "category": "Brainiac",
    "one_line_desc": "The calculus of creativity",
    "description": "The event unfolds in three rounds, offering a comprehensive test of mathematical acumen and problem-solving skills. From unscrambling math-related words to deciphering pictorial questions and solving equations, contestants showcase their diverse math skills.",
    "round_title_1": "CHRONOID",
    "round_desc_1": "In this round, pairs of participants can choose from four levels: Math Scramble, Math Series Puzzle, Engimath, and Nummath. In Math Scramble, teams unscramble letters to form a math-related word. Math Series Puzzle involves continuing mathematical series. Engimath presents pictorial questions where teams match images to mathematical concepts. Nummath requires solving equations based on given instructions. Answer sheets are collected, evaluated, and qualifying teams are announced.",
    "round_title_2": "STACK WITH MATH",
    "round_desc_2": "Each participant will be given 21 paper cups. Each paper cup will be written with operands and operators. He/She has to perform those simple operations and form a stack using those cups in ascending order. The ascending order should be from bottom to top and from left to right as well. Participants who finish the task sooner will be selected for next rounds.",
    "round_title_3": "FACT WITH FACTORS",
    "round_desc_3": "Participants will be assigned some 3 or 4-digit numbers and the association members will be assigned 1 or 2-digit numbers. Participants will have to find the factors of the number assigned to them.They have to reach out to the corresponding association member and solve simple puzzles given by them to move to the next factor. The sequence of factors followed by the participant should be in descending order. It should neither be ascending nor in random order. And there's a catch, if the factor \"2\" is occupied with any participant, then the other should wait until he/she finishes the task. This is all about how fast the participant solves the puzzles given by those factors.The top three participants who finish the cycle first will be announced as winners.",
    "eventId": "EVNT0029",
    "contact_name_1": "Akshara K R",
    "roll_1": "21L103",
    "contact_mobile_1": 8300185840,
    "contact_name_2": "Kaviya R",
    "roll_2": "21L125",
    "contact_mobile_2": 8754360930,
    "hall": "G BLOCK (304,308)",
    "eventRules": "ROUND RULES:\n-> Participants are not allowed to interact with other teams.\n-> Participants are not allowed to use their mobile phones.",
    "teamSize": "2-3",
    "date": "24",
    "timing": "9.30 AM - 4.30 PM"
  },
  {
    "eventName": "RC Grand Prix",
    "category": "Gold",
    "one_line_desc": "Hurdles race between wheeled bots",
    "description": "In this competition, three teams of 3-4 members each race RC-controlled wheeled bots on a track with hurdles. Bots must adhere to specified dimensions, and each team brings its bot, controller, and tools. Team members take turns controlling the bot, overcoming hurdles to reach the finish line. Races are conducted in batches, with winners advancing to the finals. Cash prizes await the winner and first runner-up.",
    "round_title_1": "PLAYOFFS",
    "round_desc_1": "In the playoff kickoff, six teams undergo registration and inspection for their RC bots, ensuring compliance with size and technical specifications. Random pairings lead to three matchups on a specially designed track with simple hurdles. Teams independently navigate their bots through challenges, aiming to reach the finish line. Winners are determined by bot performance and race time.",
    "round_title_2": "FINALE",
    "round_desc_2": "In the final round, the finalist teams enhance their RC bots based on insights from the playoffs. A meticulously designed track with advanced hurdles awaits, intensifying the competition. In the grand finale, teams navigate the challenging course, aiming for the shortest completion time. ",
    "eventId": "EVNT0030",
    "contact_name_1": "Yuvan R S",
    "roll_1": "21R256",
    "contact_mobile_1": 9087143912,
    "contact_name_2": "Eshwar Ram T M ",
    "roll_2": "21R413",
    "contact_mobile_2": 9942663989,
    "hall": "G - 601",
    "eventRules": "ROUND 1 RULES:\n-> The RC controlled bot should be within the size limitation (25x15 cm).\n-> Participants should bring their own bots, controller, and required components.\n-> During the race, if the bot tumbles, halts, or goes off the track, only the individual controlling it for that round is allowed to lift it and place it at the nearest checkpoint behind that point.\n-> Unless there is a need to touch the bot as stated above, it must be fully remote controlled throughout the race.\n-> Teams must refrain from intentionally damaging the bots of other teams; any such actions, if found guilty, the team will be disqualified.\n-> Teams will be randomly selected for each round, adherence to the schedule is mandatory.\nROUND 2 RULES:\n-> Only one member from the team can be present near the track.\n-> During the race, if the bot tumbles, halts, or goes off the track once, then only the individual controlling it for that round is allowed to lift it and place it at the nearest checkpoint behind that point only once. If it happens again, the team is out of the race.\n-> Unless there is a need to touch the bot as stated above, it must be fully remote controlled throughout the race.\n-> If the bot is struck or hit by a hurdle/obstacle, points will be reduced for each hurdle accordingly.\n-> Teams must refrain from intentionally damaging the bots of other teams; any such actions, if found guilty, the team will be disqualified.",
    "teamSize": "2-4",
    "date": "24",
    "timing": "9.30 AM - 4.30 PM"
  },
  {
    "eventName": "Robot Grand Prix",
    "category": "Gold",
    "one_line_desc": "Collision of Mechanical Titans!",
    "description": "The Robot Grand Prix dazzles spectators with cutting-edge robotics as teams from around the state showcase their autonomous creations in a thrilling race of speed and precision. This high-tech competition pushes the boundaries of artificial intelligence, engineering, and innovation, defining the future of robotics in a dynamic and electrifying spectacle.",
    "round_title_1": "Heats",
    "round_desc_1": "The race will take place on the designated arena, featuring obstacles along the path. The top three bots that successfully complete the circuit without colliding with obstacles will progress to the finals.",
    "round_title_2": "Finals",
    "round_desc_2": "The competition will unfold on the designated circuit, presenting more challenging obstacles along its path. To secure victory, the first three bots that navigate the circuit without colliding with obstacles will be adjudged as the winners.",
    "eventId": "EVNT0031",
    "contact_name_1": "Nitis Prabhu M ",
    "roll_1": "21P115",
    "contact_mobile_1": 9791947147,
    "contact_name_2": "Vikashini B",
    "roll_2": "21P604",
    "contact_mobile_2": 8220881320,
    "hall": "G - 401",
    "eventRules": "ABOUT THE ARENA:\n-> The Arena will consist of a starting point, ending point, and two checkpoints on its path.\n-> Obstacles such as ropes, tires, mud, etc., will be placed on its path.\n-> In case of the robot moving out of the track or clashing with an obstacle, it has to re-start from the nearest checkpoint.\n-> The first 3 robots completing the race will be adjudged as the winner of the respective rounds.\n-> The Arena for the “Heats” will be revealed 1 hour before the round starts, and the Arena for the “Final” will be revealed immediately after the first round.\nABOUT THE ROBOT:\n-> Bot dimensions: 30x30x30 cm.\n-> Bot weight: Less than 10 kg.\n-> The robots in the contest must be built by the team members.\n-> If the bot is wired control, the cable length is unlimited. However, be careful not to wind the cable on the facilities and game objects in the field.\n-> The bots are designed in such a way that it shouldn’t cause any damage to the game field.\n-> The pneumatic system should not be provided. If the team requires compressed air, they could be taken up by their own.\n-> Air pressure must not exceed 5 bar.\n-> Any Power source deemed dangerous may be banned from use.\n-> Bots are inspected before the event starts and checked for the event’s requirements.\n-> The required components are brought on their own; it won’t be provided from the organizer’s side.",
    "teamSize": "2-4",
    "date": "24",
    "timing": "9.30 AM - 4.30 PM"
  },
  {
    "eventName": "Robowars",
    "category": "Core Engineering",
    "one_line_desc": "Craft, Clash, Conquer!",
    "description": "\"RoboWars\" is an adrenaline-pumping and strategically intense robotic combat game that brings the excitement of battle and the thrill of technology together in a futuristic arena. In this immersive competition, participants design and build their combat-ready robots to face off against each other in a series of intense battles.",
    "round_title_1": "The Bolt Brawl",
    "round_desc_1": "The first Round is an electrifying round that pits five formidable bots against each other in an enclosed arena. The primary objective is survival, as the bots vie for dominance and the last two standing secure qualification for the next round. With rounds that are time-limited and a strict set of rules governing movement and disqualification, the battles are intense and action-packed.",
    "round_title_2": "Cyber Crown Finale",
    "round_desc_2": "The Ultimate Showdown Arena marks the pinnacle of the Robowars competition. It brings together the most resilient and skillful bots that have qualified from previous rounds for the ultimate battle of supremacy. The arena is set for an epic showdown, where the last remaining operational bot will emerge as the ultimate victor, showcasing unmatched resilience, strategy, and technological prowess.",
    "round_title_3": "NIL",
    "eventId": "EVNT0032",
    "contact_name_1": "Gowtham M ",
    "roll_1": "21I216",
    "contact_mobile_1": 9042306304,
    "contact_name_2": "Midhun Ramanujam R",
    "roll_2": "21I331",
    "contact_mobile_2": 7812827300,
    "hall": "J-314",
    "eventRules": "Each round starts with five formidable bots positioned at different corners of the arena.\n->Bots must remain stationary until the referee signals the start of the round.\n->Rounds are time-limited to ensure the battles are action-packed and thrilling.\n->The referee announces the start and end of the round, enforcing a strict timeframe for the bots to prove their mettle.\n->Bots can be disqualified if they:\n->Exit the arena bounds.\n->Sustain irreparable damage.\n->Fail to demonstrate any movement for an extended period (more than 30 secs).\n->No specific scoring system is applied during the rounds.\n->The focus is on survival, with the last two bots remaining being the sole criteria for qualification.\n->The qualified bots from the previous rounds are positioned strategically within the arena, ready for the ultimate battle.\n->All rules from the earlier rounds still apply here.\n->The battle continues until only one bot remains operational inside the arena, and it will be declared as the winner.\nBOT DESIGN SPECIFICATIONS:\nDIMENSIONS AND FABRICATIONS:\nSIZE:\n->The robot should be compact enough to fit within 30cm x 30cm x 20cm( L x B x H )\n->However, during a match, the robot may expand or extend its parts to any extent, allowing for maximum maneuverability and performance.\nWEIGHT:\n->Under 5kg\n->The external device used to control the robot is excluded from the weight calculation.\n->The battery is included in the measurement of the robot's dimensions and weight.\n->The mechanism used should be such that only one person will control the bot.\n->No lifting or flipper mechanism can be used.\nPOWER SUPPLY:\n->Robots must be powered solely by electricity. The use of internal combustion engines is prohibited. The powersource should be on the bot or kept outside the arena\n->Each team must prepare its own power sources.\n->Change of battery will not be allowed during the match.\n->No provision will be provided for the charging of batteries. Teams are advised to have extra, charged batteries on hand for the competition.\n->All connections should be made safe to prevent short circuits and battery fires.\nMOBILITY :\n->Mode of Transport - Land\n->Methods of mobility may include:\n->Rolling (wheels, tracks, or the whole robot).\n->Walking (linear actuated legs with no rolling).\n->Flying (using aerofoil, helium balloons, ornithopters, etc.) is not allowed.\n->Any other method of mobility which leads the robot to lose contact with the ground is not allowed.\n->The robot should not secure itself on the arena surface by using suction cups, diaphragms,sticky threads, glue, or other such devices.\nROBOT CONTROL REQUIREMENTS:\n->Dual Control Modes: Manual and Autonomous (AI/ML-based)\n->Wireless remote controls are allowed in the event.\n->Teams must pair the wireless remote with the robot before entering the arena. No extra time will be given for this once the robots are in the arena.\nWEAPON SYSTEMS:\n->Robots can have any kind of cutters, flippers, saws,lifting devices, spinning hammers, etc. as weapons with the following exceptions and limitations are not allowed:\n->Any kind of inflammable liquid / liquid projectiles (foam/ liquefied gases).\n->Smoke and light-based weapons impair the viewing of robots by entrants or judges or viewers (smoke or dust, lights such as external laser and bright strobe lights).\n->Flame-based weapons.\n->Any kind of explosive or intentionally ignited solid or potentially ignitable solid.\n->Nets, tape, glue, or any other entanglement device.\n->High-power magnets or electromagnets.\n->Radio Jamming, Tasers, Tesla coils, or any other high-voltage devices. Tethered or untethered projectiles.\nOTHERS:\nSPEED:\n->1 metre per second\n->SENSORS:\n->No Restriction on Sensor Types\n->AI & ML Integration:\n->AI and ML code can be integrated",
    "teamSize": "3-5",
    "date": "25",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Sci - Fiesta ",
    "category": "Kriyative",
    "one_line_desc": "Decode DNA, navigate neurons",
    "description": "Dive into the excitement of our card challenge, where quick thinking and strategy earn points for set identification and card reordering. Then, experience a twist with a Snake and Ladder game using creatively cut cardboard pieces, featuring questions for bonus points and penalties. Spin the wheel for your first move, and let the dual thrill of intellect and chance unfold!",
    "round_title_1": "UNCHARTED",
    "round_desc_1": "A collection of card sets, each comprising up to 10 cards, will be arranged on the table. Every set is labeled, for instance, \"Card Set 1 - Halogens.\" Participants will receive three clues to identify the correct card set. Following this, they have 60 seconds to arrange the cards within the identified set. Points are awarded for both accurate set identification and successful card reordering, with consideration given to the number of clues used and the time taken.",
    "round_title_2": "Ups and Downs",
    "round_desc_2": "The cardboard pieces are intricately cut into shapes to align with the Snake and Ladder game. Each box contains questions categorized into 2 to 3 different sets. Players must select one set and respond within the given time frame to earn marks. Stepping on a snake incurs a penalty, adding another question, while landing on a ladder results in bonus points for the corresponding question. To initiate the game, players spin a wheel, and the arrow must point to 1, 2, or 3 for the first move. ",
    "eventId": "EVNT0033",
    "contact_name_1": "Muthukkani S R",
    "roll_1": "21S015",
    "contact_mobile_1": 6380531826,
    "contact_name_2": "Eniyan K",
    "roll_2": "21S004",
    "contact_mobile_2": 8098628770,
    "hall": " G BLOCK (401,402,403)",
    "teamSize": 1,
    "date": "23",
    "timing": "1.30PM - 4.30PM"
  },
  {
    "eventName": "Speed Drifters",
    "category": "Gold",
    "one_line_desc": "Dust, Drice, Conquer ",
    "description": "Embark on a mesmerizing journey at the Mini RC Car Spectacular, where innovation and excitement collide. The event kicks off with a captivating demo, unveiling the cutting-edge technology and sleek design of these miniature Powerhouses. Following this showcase is the Small Distance Acceleration Event, a heart-pounding spectacle as the tiny cars compete for speed supremacy. The intensity peaks in an endurance challenge, separating the champions from the rest, as they face the ultimate test of stamina. The winners, crowned in this miniature world of speed, innovation, and competitive spirit, will be celebrated in a crescendo of excitement",
    "round_title_1": "off-grid show",
    "round_desc_1": "In the preliminary round, present your RC car before the judge, delivering a comprehensive overview of its construction and specifications. Demonstrate the intricate details that make your creation stand out, highlighting the innovation and engineering behind its design. This is your chance to impress and showcase the unique features that set your RC car apart from the competition. Make every detail count as you aim to capture the judge's attention and secure your place in the spotlight. It's not just about speed; it's about the craftsmanship and ingenuity that make your RC car a true standout.",
    "round_title_2": "SpeedThrash",
    "round_desc_2": "In this round, your RC car's acceleration takes center stage as it propels along a linear track for a defined distance. Showcase the speed and precision of your creation, emphasizing its ability to accelerate with efficiency. The assessment will focus on the car's performance during this dynamic trial, highlighting its responsiveness and speed capabilities. Make sure your RC car is finely tuned for this challenge, as the judges evaluate its acceleration prowess on the linear track. It's a test of both Power and control as your car aims to impress in this exhilarating acceleration event.",
    "round_title_3": "Endurance Test",
    "round_desc_3": "In this stage, your RC car's endurance faces scrutiny as it navigates a challenging off-road track, resembling rugged terrain. The evaluation emphasizes the durability and resilience of your creation as it conquers obstacles and rough terrain. This endurance test is a true measure of your car's capability to withstand and overcome the challenges posed by the off-road environment. Ensure your RC car is ready for this rugged adventure, showcasing its endurance and robust design for a chance to emerge victorious.",
    "eventId": "EVNT0034",
    "contact_name_1": "Kaviranjan R",
    "roll_1": "21A214",
    "contact_mobile_1": 9087061434,
    "contact_name_2": "Tamil Selvan K M",
    "roll_2": "21A236",
    "contact_mobile_2": 8072645447,
    "hall": " N BLOCK",
    "eventRules": "PRIMARY RULES:\n-> The teams must design a purely wireless remote-controlled machine.\n-> The RC car shouldn’t stop in the middle of the track which will reduce the points of the team.\n-> A marked space will be provided for drivers to control their vehicles. Drivers are prohibited from running around the track along with the car.\n-> The participants are requested to bring suitable spare tyres to counter wet track conditions.\nROUND1 RULES:\nReadymade versions of gears, differential gear, engine, springs, shock absorbers, servo motors (non-propulsion purposes only), batteries and wheels can be used.\nChassis and suspension (excluding the upper suspension arm, suspension spring and shock absorbers) must be built by the participants themselves.\nMaximum Dimensions: l=20cm, b=15cm, h=15cm.\nName of the team, name of the captain, number of members in the team, length of the car, width of the car, the diameter of the tires, height of the car from top to ground, ground clearance: all these details should be mentioned in the presentation.\nROUND 2 RULES:\n->The test will take place in a linear path hence the wheel alignment of the wheels is to be maintained for the continuous straight path of the vehicle, any vehicle deviating from the path will receive lower points.\n->The acceleration test will be an individual test.\n->The team shouldn’t change the battery of the car in the middle of the test.\n->Service Time: (After Acceleration test)\n->A max of 15 minutes will be given as a service time to service the car and change the batteries but no parts should be replaced or removed.\n->The batteries should be changed in presence of a convenor or volunteer and 2 times only throughout the whole event.\n ROUND 3 RULES:\n->The track will be an off-road dirt track with sharp turns and big jumps that will be designed in a way to test both the speed and control of the machine.\n->Most parts of the track will be made up of soil; however, at few places, pebble-like materials and bumps may be used to create obstacles.\n->The track will have continuous turns.\n->A car should successfully complete 2 laps with shorter period gains more points.\n->A race will have a single car running on the track as it is an individual event.\n->The design of the track will be disclosed on the day of the event itself.",
    "teamSize": "2-4",
    "date": "23",
    "timing": "9.30 AM  - 4.30 PM"
  },
  {
    "eventName": "SPO - (R) - TI - FY",
    "category": "Amuse",
    "one_line_desc": "Hop the adventure with magic ",
    "description": "Experience the thrill of two rounds packed with engaging activities and questions related to the basics of Electrical and Electronic Engineering (EEE). Dive into a world of fun-riched challenges that promise excitement and learning in equal measure. Join us for an electrifying event where knowledge meets entertainment, making it a celebration of intellect and unforgettable fun!",
    "round_title_1": "ZEPPELIN",
    "round_desc_1": "Participants will encounter Electrical and Electronic Engineering (EEE) questions with corresponding numerical answer choices. The challenge involves jumping onto the correct numbered platforms while holding a balloon to prevent it from touching the ground. There will be 6 to 8 rows, and for each incorrect jump or if the balloon is left on the ground, participants must take a step backward. The winner is determined by the person who reaches the finish line in the shortest time with correct answers.",
    "round_title_2": "MAZE RUNNER",
    "round_desc_2": "The initial stage involves a collection of Electrical and Electronic Engineering (EEE) questions presented on paper. Using static electricity generated by rubbing a balloon against woolen cloth, teams of two must attract the balloon to the question paper, allowing them to answer it. Concurrently, a maze is set up where one team member, blindfolded, relies on guidance from the other team member who, based on correct answers, instructs the blindfolded teammate to navigate the maze.",
    "eventId": "EVNT0035",
    "contact_name_1": "Arjun M ",
    "roll_1": "21E106",
    "contact_mobile_1": 6383480206,
    "contact_name_2": "Monis",
    "roll_2": "22E904",
    "contact_mobile_2": 6374079771,
    "hall": "G- 601",
    "teamSize": 2,
    "date": "25",
    "timing": "9.30 AM  - 4.30 PM"
  },
  {
    "eventName": "Tech - O - Mate",
    "category": "Core Engineering",
    "one_line_desc": "Fun guessing, decoding clues- pure excitement!",
    "description": "Immerse yourself in our three-round extravaganza! This fun-filled technical event is a dynamic showcase where participants undergo scrutiny for their memory prowess and have their capabilities put to the test with intriguing questions. Join us for an engaging experience that combines the thrill of competition with the excitement of challenging your intellect. It's a unique blend of fun and technical prowess that promises an unforgettable journey of discovery and excitement!",
    "round_title_1": "MEMORY MATRIX",
    "round_desc_1": "In this challenge, one participant per team is presented with 20 electrical/electronic components. They must quickly identify and memorize the components within 90 seconds. Subsequently, they convey technical clues to their partner, who has 120 seconds to identify and write down the components. The teams with the highest number of correctly identified components advance to round 2.",
    "round_title_2": "STRIKE A BINGO",
    "round_desc_2": "This round features 25 electrical and electronics questions (+10 for correct, -5 for incorrect) and bonus questions (+20 for correct, +0 for incorrect). Teams, using A4 sheets with a 5x5 table, take turns selecting numbers. All teams mark the chosen numbers to answer displayed questions. The game concludes after all 25 questions, with the top five teams advancing to round 3 based on points.",
    "round_title_3": "RESOLVE RAPID",
    "round_desc_3": "The shortlisted teams will be given real time problems in electrical and electronics field based on lottery system in order to test their innovative skills. The teams are required to gives one basic solution to the problems.. Participants will be given 20 mins to make a ppt and 7 mins to present the ppt and 3 minutes for answering the queries. Finally, winners will be selected by the judge based on the solutions given by the team.",
    "eventId": "EVNT0036",
    "contact_name_1": "Krishna Priya A M ",
    "roll_1": "21E124",
    "contact_mobile_1": 9487672438,
    "contact_name_2": "Rithisri R",
    "roll_2": "22E913",
    "contact_mobile_2": 9384563020,
    "hall": "G BLOCK (408,409)",
    "eventRules": "ROUND1:\n->Use of the internet is not allowed.\n->Participants should follow the given time for completing the round.\nROUND2:\n->Use of the internet is not allowed.\n->Participants should follow the given time for completing the round.\nROUND3:\n->Participants can have laptops with them.\n->Participants should complete preparation and presentation within the given time.",
    "teamSize": 2,
    "date": "23",
    "timing": "9.30 AM  - 4.30 PM"
  },
  {
    "eventName": "Tech Quest",
    "category": "Coding",
    "one_line_desc": "Discover to Dominate the Digital Adventure!",
    "description": "Embark on a cybernetic quest where digital clues and virtual challenges pave the way to unveil the elusive prize. In TechQuest Forge, there are clues that must be unlocked using everything from straightforward sorting algorithms to sophisticated decryption strategies. And the combination of all these hints, cunningly placed, will produce one coherent story",
    "round_title_1": "Digital Quest",
    "round_desc_1": "It would be a one-hour digital quest round; the participants would be asked from one of 3 streams(Web development, Data analytics, Cyber security). Depending on the stream, the teams would go on a digital quest looking for clues in the digital world, and hold the revealed clues for the final round. The top 2 teams will qualify for the next round.",
    "round_title_2": "TechForge",
    "round_desc_2": "This will be a two-hour round where teams receive a final coding challenge to solve using clues obtained in the first round. Teams will be presented with a problem tailored to their stream.",
    "eventId": "EVNT0037",
    "contact_name_1": "Dharunraj R",
    "roll_1": "20PT06",
    "contact_mobile_1": 8637695350,
    "contact_name_2": "Tejas Srinivas",
    "roll_2": "20PT37",
    "contact_mobile_2": 9790049089,
    "hall": "SIL M-block first floor ",
    "eventRules":"Participants Requirements:\n->Webd: Basic web development knowledge\n->Data analytics: Basic knowledge on pandas, SQL, Power BI/Tableau\n->Cyber Security: Basic knowledge on Cybersecurity and CTF. Personal laptop(with Linux. If not, can be installed at the venue) if the team qualifies for the second round.",
    "teamSize": "2-3",
    "date": "24",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Tech Spark",
    "category": "Brainiac",
    "one_line_desc": "Orchestration of inventive ideas ",
    "description": "Tech spark circuit challenge is an electrifying competition that blends the artof circuit building with strategic problem-solving. This event is designed to pushparticipants into the realm of practical application,encouraging creativity and innovation in the world of electronics.",
    "round_title_1": "Circuit Explorer",
    "round_desc_1": "The main motive of this round is to bring innovative solutions for a problemstatement that improves the problem analysis and solving skills..The participants are expected to solve 4 questions. The answers forthe above four questions will be the clue for solving the problem statement. A specialquestion will also be given initially and upon solving that question within thetime limit, the participants will get an additional clue to solve theprimary problem statement. Based on their answers 10 teams will be shortlisted forthe next round.",
    "round_title_2": "Circuit Rush",
    "round_desc_2": "Each team receives a question paper presenting a real-world problem with an output and three lifelines mentioned in the top right corner. To arrive at the output, participants must choose components (limited to 15). Lifeline 1 allows the exchange of one component, Lifeline 2 clears one doubt about the circuit, and the final lifeline, available after 30 minutes, aids in identifying the circuit if the team faces uncertainty. Volunteers will strike out each used lifeline on the spot.",
    "eventId": "EVNT0038",
    "contact_name_1": "Hariprasath B M ",
    "roll_1": "21L217",
    "contact_mobile_1": 9489682003,
    "contact_name_2": "Sumant B R",
    "roll_2": "21L251",
    "contact_mobile_2": 9677445822,
    "hall": " IC laboratory,ECE department,E block-2nd floor",
    "eventRules": "Round 1 Rules:\n->Time limit must be strictly followed.\n->If any malpractices, the team will be eliminated on the spot.",
    "teamSize": 2,
    "date": "24",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Techvisions",
    "category": "Brainiac",
    "one_line_desc": "Assess the market's technical textiles.",
    "description": "In this event, competitors are required to analyze and evaluate a recently developed technical textile product available in the market. They should explore various aspects related to its production line, GSM, features, specifications, testing, and more. The presentation should follow the format of a paper presentation.",
    "round_title_1": "Technivisions",
    "round_desc_1": "Present your ideas and convince the judges to showcase your talents and show your expertise",
    "eventId": "EVNT0039",
    "contact_name_1": "Thanusri S",
    "roll_1": "21T224",
    "contact_mobile_1": 9566894004,
    "contact_name_2": "DeviSoundharya J",
    "roll_2": "21T102",
    "contact_mobile_2": 8778445761,
    "hall": "H-207",
    "eventRules": "Abstract should not exceed more than 250 words.\n->Presentation should not exceed more than 7-8 minutes.\n->The deadline for submitting an abstract is one week before the competition.\n->Each team consists of a maximum of 2 members.",
    "teamSize": "1-2",
    "date": "24",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Traditional Games Galore",
    "category": "Kriyative",
    "one_line_desc": "Beyond a game, unveiling nostalgia",
    "description": "Traditional Games Galore event promises a dynamic celebration of both intellect and agility, bringing together the best of two worlds.The following event is dedicated to reviving the charm of games that have been cherished across generations. Participants will find themselves transported to a vibrant arena. It seamlessly blends the excitement of a technical quiz with the everlasting thrill of traditional games which will provide diverse experiences and create a memorable journey that resonates with participants from all the years.",
    "round_title_1": "TECHGRID CHALLENGE",
    "round_desc_1": "TechGrid Challenge is an engaging game that blends the strategic gameplay of Dots and Boxes with the intellectual challenge of answering technical questions. Players aim to create boxes on the grid by connecting dots while strategically answering technical questions to gain an edge over their opponents.",
    "round_title_2": " TECH HOP CHALLENGE and PALLANGUZHI CLASH",
    "round_desc_2": "Pallanguzhi Clash is an innovative game merging the intellectual challenge of technical questions with the strategic gameplay of Pallanguzhi, a traditional Indian board game. The game is played on a specially designed board that incorporates the essence of both elements\n\nThe TechHop Challenge is a unique fusion of intellectual prowess and physical agility, combining the structure of a traditional  Hopscotch game with the challenge of answering technical questions. The game is played on a marked-out Hopscotch court, each section representing a different level of difficulty. ",
    "round_title_3": "KOTHAN KALLU",
    "round_desc_3": "“Kothan Kallu” is an inventive game that merges the thrill of answering technical questions with the traditional gameplay of Kothan Kallu, a popular South Asian stone-throwing game. Players aim to score points by correctly answering technical questions and demonstrating accuracy in their stone-throwing skills.",
    "eventId": "EVNT0040",
    "contact_name_1": "Kruthi T P",
    "roll_1": "21P210",
    "contact_mobile_1": 9963427530,
    "contact_name_2": "Mukesh Kumar R",
    "roll_2": "20P617",
    "contact_mobile_2": 9092444505,
    "hall": "G BLOCK (401,402)",
    "eventRules": "Round 1 Rules:\n->A square grid is drawn on the playing surface, creating an array of dots. Each intersection of dots represents a potential connection point.\n->A set of technical question cards are prepared, featuring questions related to technical subjects.\n->Each team is assigned a unique marker or color to connect dots and create boxes on the TechGrid.\n->Two teams take turns in answering a technical question. The difficulty level determines the number of lines (connections) they can make on the TechGrid.\n->After answering the technical question, the player from a team connects two adjacent dots by drawing a line. The objective is to strategically form a square by completing the fourth side.\n->Whenever a team completes a square by connecting the fourth side, they write their first alphabet of their team’s name inside the box and earn a point. The player gets an additional technical question card for each completed box.\n->Special challenges may be introduced, where players can claim a bonus box or hinder opponents by correctly answering advanced technical questions.\n->The Team with the most completed boxes and points at the end of the game, combining strategic dot connections and successful technical challenges, wins the \"TechGrid Challenge.\"\nRound 2 Rules: \n->Players aim to accumulate points by successfully answering technical questions while strategically managing the seeds in their Pallanguzhi pits. \n->The game consists of two rows of small pits (representing Pallanguzhi pits) and a central area for technical questions. \n->A set of technical question cards is prepared, each card containing a question related to tech related topics.\n->Small game seeds or tokens (sozhi) represent the traditional Pallanguzhi game pieces. \n->Players use these shells to play both Players take turns drawing a technical question card. If the answer is correct, they receive a chance to play the game where the player distributes the collected seeds among their pits following traditional Pallanguzhi rules. \n->Players strategically move seeds between pits to capture their opponent's seeds, incorporating the traditional Pallanguzhi tactics. \n->Players score points based on the number of seeds in their pits, with bonus points awarded for correctly answered technical questions. \n->The player with the highest combined score from strategic Pallanguzhi moves and successful technical challenges wins the round \n->A set of technical questions is prepared, ranging in difficulty.\n->Each player receives a pebble to toss onto the court one by one from square 1 to 8.\n->Teams take turns throwing their tokens onto the Hopscotch court. The number on the square where the token lands corresponds to a technical question.\n->The Team must answer the question correctly to advance to the next level.\n->Players hop through the court following traditional Hopscotch rules. However, their team must recite the correct answer to the technical question associated with the square they land on.\n->Successfully answering the question allows the player to progress to the next level. Failure results in the player facing a penalty, which is going back a square.\n->The first team to successfully navigate the entire Hopscotch court by answering all the technical questions wins the \"TechHop Challenge.\"\nRound 3 Rules:\n->A set of technical question cards is prepared, featuring questions related to tech-related subjects.\n->Players take turns drawing a technical question card. After answering the technical question, players attempt to throw their Stones and catch them.\n->Based on the number of stones they collect and the correct answers they give, players earn points. Players must balance accurate stone-throwing with their technical proficiency to maximize their overall score.\n->Special Challenges may be introduced, where players attempt specific stone-throwing tasks related to technical concepts.\n->The team with the highest combined score from technical questions and accurate catching of the stone throws wins the “Kothan Kallu” Challenge.",
    "teamSize": 2,
    "date": "25",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Try and triumph",
    "category": "Brainiac",
    "one_line_desc": "Reflex fast to conquer",
    "description": "The faster you act, the more will be your conquer. Join us in experiencing the mystery unravel, during the battle of wits. The puzzles might seem ordinary and simple for a battle but only the quick-witted can work through it. Gear up with your team. Let's wait and celebrate the survivors.",
    "round_title_1": "The Da Vinci decode",
    "round_desc_1": "Each team will have a 10-minute window to showcase their puzzle-solving skills . Teams will receive a set of clues. Using the provided clues teams can successfully unlock the designated locks .Teams must rely on their problem-solving abilities to decipher the hints and conquer the locks presented to them. Only those teams that effectively crack the code will advance to the next round . Are you up for the challenge?",
    "round_title_2": "Trivia Titans",
    "round_desc_2": "Engage in a day-long strategic conquest to build empires. Teams begin with small provinces and expand by completing assigned tasks. Challenges between teams determine the fate of lands, with victors claiming defeated territories. The dynamic play continues until one team conquers the maximum land, testing strategy, teamwork, and resilience in an epic battle.",
    "eventId": "EVNT0041",
    "contact_name_1": "Bavana Yalini L",
    "roll_1": "21B208",
    "contact_mobile_1": 9791833878,
    "contact_name_2": "Shwetha Chandrasekaran ",
    "roll_2": "21B247",
    "contact_mobile_2": 9600366039,
    "hall": "J BLOCK(411,412,413,414,415)",
    "eventRules": "Round 1 Rules:\n->The teams are expected to maintain decorum.\n->The teams are expected to play fair and not use unnecessary means.\nRound 2 Rules:\n->Each team will be given a set a province to conquer.\n->To conquer a province, a team will have to play a game and win.\n->The team with the maximum province will be declared as the winner.\n->The teams are expected to maintain decorum.\n->The teams are expected to play fair and not use unnecessary means.",
    "teamSize": "3-4",
    "date": "23",
    "timing": "9.30 AM  - 4.30 PM"
  },
  {
    "eventName": "Witty Mindz",
    "category": "Amuse",
    "one_line_desc": "Stratergic exchange yields victory!",
    "description": "Are you a play-based learner? Are you a quick thinker? then this is the right platform to show case your talent. Grab your partner and show off your witty minds.",
    "round_title_1": "VerboVibe",
    "round_desc_1": "Team consisting of 2 members chooses one chit, which contains two alphabets in which each member chooses one alphabet. The total duration is 5 minutes. Every minute, players switch letters within a team and start writing in the switched alphabet. There is no discussion between team members. If both players write the same word, it will be counted as one. The top-scoring teams will be selected for the next round.",
    "round_title_2": "DecodeDrama",
    "round_desc_2": "This round includes both cracking a jumbled word that will be related to computer science and \"charades.\" One team member has to crack the jumbled word, and after cracking it, he/she has to act it out to the other team member. It is similar to \"charades.\" The total duration is 10 minutes.",
    "eventId": "EVNT0042",
    "contact_name_1": "Roshini E",
    "roll_1": "22MX121",
    "contact_mobile_1": 9585657946,
    "contact_name_2": "Subashini R",
    "roll_2": "22MX126",
    "contact_mobile_2": 9942552425,
    "hall": "K BLOCK (501,502)",
    "eventRules": "Round 1 Rules:\n->Mobile phones are strictly prohibited.\n->No discussion among the teammates.\nRound 2 Rules:\n->No lip synching.",
    "teamSize": 2,
    "date": "25",
    "timing": "9.30 AM -12.30 PM"
  }
]
