[
  {
    "wid": "WKSP0011",
    "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop11",
    "alteredFee": 849,
    "actualFee": 849,
    "assnName": "American Society of Mechanical Engineers",
    "workName": "Sensor Interface and Integration",
    "date": "24",
    "hall": "Sensorics Lab (1st Floor, G-Block)",
    "time": "9.30 AM - 04.30 PM",
    "c1Name": "Tarun Kumar P K",
    "c1Num": "7200083054",
    "c2Name": "Somesh S",
    "c2Num": "9445230494",
    "maxCount": "70",
    "desc": "We offer aspiring engineers the opportunity to explore the future work environment through our workshop. This program serves as an introduction to the realm of sensorics and sensor integration using Virtual Instrumentation (VI) software. Participants will engage in hands-on training sessions, gaining practical experience in acquiring data and implementing control actions with VI software (LabVIEW) and Data Acquisition cards. Additionally, the workshop provides training on the development of robots using LEGO kits and sensors. This comprehensive learning experience aims to equip participants with valuable skills for their future endeavors.",
    "agenda": [
      [
        {
          "time": "9:45 AM - 11:15 AM",
          "description": ["Introduction to Sensorics and Virtual Instrumentation"]
        },
        {
          "time": "11:30 AM TO 12:30 PM",
          "description": ["Hands-on Training I"]
        },
        {
          "time": "1:30 PM - 2:30 PM",
          "description": ["Hands-on Training II"]
        },
        {
          "time": "3:00 PM - 4:30 PM",
          "description": ["Hands-on Training III"]
        }
      ]
    ]
  },
  {
    "wid": "WKSP0001",
    "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop1",
    "alteredFee": 399,
    "actualFee": 399,
    "assnName": "IEEE EMBS Students Branch",
    "workName": "Immersive Reality - AR",
    "date": "25",
    "hall": "MI Lab (A Block)",
    "time": "9.30 AM - 04.30 PM",
    "c1Name": "Manu Dhanu Sri R A ",
    "c1Num": "6379029343",
    "c2Name": "Abina Sree S J",
    "c2Num": "9514230992",
    "maxCount": "50",
    "desc": "Dive into the future with our 'IMMERSIVE REALITY - AR' workshop! Explore cutting-edge augmented reality technologies, acquire hands-on development skills, and gain valuable insights into its diverse applications. Engage in this informative session and leave empowered to create captivating AR experiences. Unleash your creativity in this dynamic learning environment, and discover the limitless possibilities of augmented reality. Join us for an enlightening experience that will propel you into the forefront of this rapidly evolving technological landscape.",
    "agenda": [
      [
      {
        "time": "9:30 AM - 10:30 AM",
        "description": ["Augmented Reality - Theoretical Background and Applications"]
      },
      {
        "time": "10:45 AM - 11:30 AM",
        "description": ["Google AR - Examples (Surface)"]
      },
      {
        "time": "11:30 AM - 12:30 PM",
        "description": ["Augmented Reality - Theoretical Background and Applications"]
      },
      {
        "time": "1:30 PM - 3:30 PM",
        "description": ["Types of Marker Creation Based on Surface Marker"]
      },
      {
        "time": "3:45 PM - 4:30 PM",
        "description": ["Demo of Created AR Examples and other Software Tools"]
      }
    ]
  ]
  },
  {
    "wid": "WKSP0005",
    "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop5",
    "alteredFee": 600,
    "actualFee": 600,
    "assnName": "Institute of Electrical & Electronics Engg. (IEEE) (Students Chapter)",
    "workName": "Spatial AI in Mobile Robotics",
    "date": "24",
    "hall": "Y-202",
    "time": "9.30 AM - 04.30 PM",
    "c1Name": "Santhya S",
    "c1Num": "8056595086",
    "c2Name": "S Sakthisree",
    "c2Num": "7200696604",
    "maxCount": "80",
    "desc":"The workshop's theme is to enlighten participants with knowledge of perception stacks and devices, specifically in the context of autonomous navigation, with a special emphasis on Atman series robots. Atman series robots offer seamless material handling and transportation with fully automated intelligence systems that ensure high efficiency in productivity. These robots are compact, durable and safe, featuring various payload capacities and security features. They are optimized in various ways, making them highly affordable. The platform easily integrates with various open-source robots and modules available globally. It can function as both an industrial robot and an educational research platform, providing an exceptional learning experience and knowledge in platforms such as ROS, OpenCV, Nvidia Jetson Nano and Arduino, including 2D and 3D AI-based stereo vision systems.During the workshop, participants will be educated on the aforementioned topics through a real-time demonstration using a mobile robot brought by the speaker. They will have the opportunity to work with the mobile robot hands-on. At the workshop's conclusion, participants will grasp autonomous navigation concepts, with a focus on the features of Atman series robots. Knowledge on fully automated intelligence systems and optimization strategies will be acquired. Participants will learn to integrate the platform with open-source robots, gaining versatility for both industrial and educational applications.",
    "prerequisites": "Laptops have to be brought by the participants",
    "agenda": [
      [
      {
        "time": "9:30 AM - 12:30 PM",
        "description": ["Intorduction, Perception and Sensing, Spatial Mapping "]
      },
      {
        "time": "1:15 PM - 2:15 PM",
        "description": ["Simultaneous Localization and Mapping (SLAM)"
        ]
      },
      {
        "time": "2:15 PM - 4:00 PM",
        "description": ["Path Planning and Autonomous Navigation"]
      },
      {
        "time": "4:10 PM - 4:30 PM",
        "description": ["Final Demonstration"]
      }
    ]
  ]
  },
  {
    "wid": "WKSP0002",
    "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop2",
    "alteredFee": 500,
    "actualFee": 500,
    "assnName": "Biotechnology Association",
    "workName": "Digital Forensics",
    "date": "25",
    "hall": "CC Lab (E-Block 3rd Floor)",
    "time": "9.30 AM - 04.30 PM",
    "c1Name": "Janani PS",
    "c1Num": "8870314034",
    "c2Name": "Pooja Shree M",
    "c2Num": "93455 51741",
    "maxCount": "80",
    "desc": "Forensic science entails the meticulous analysis of DNA data derived from crime scenes, suspects, victims and various sources, offering critical evidence for legal cases. Our comprehensive workshop is designed to immerse participants in practical exercises and case studies, showcasing the practical application of DNA analysis tools in real-world scenarios. Through engaging hands-on experiences, attendees will acquire the skills and knowledge necessary for the adept utilization of forensic tools. This workshop is tailored to empower participants with the expertise required for effective DNA analysis in forensic contexts, providing a valuable foundation for their professional development.",
    "agenda": [
      [
      {
        "time": "9:30 AM - 10:30 AM",
        "description": ["SESSION 1 – Introduction to Digital Forensic's Importance, Current Trends and Challenges"]
      },
      {
        "time": "10:45 AM - 12:00 PM",
        "description": ["SESSION 2 - Understanding Digital evidence Collection, Preservation and Analysis of Digital Evidence"]
      },
      {
        "time": "1:00 PM - 3:20 PM",
        "description": [
          "SESSION 3 - Introduction and Demonstration of forensic tools and techniques"
        ]
      },
      {
        "time": "3:30 PM - 4:30 PM",
        "description": [
          "SESSION 4 - Hands-on exercises on real-world case studies with Q&A session"
        ]
      }
    ]
    ]
  },
  {
    "wid": "WKSP0009",
    "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop9",
    "alteredFee": 601,
    "actualFee": 601,
    "assnName": "Information Technology Association",
    "workName": "Bitflow Fiesta",
    "date": "24",
    "hall": "IT Main Lab(E block 4th floor)",
    "time": "9.30 AM - 04.30 PM",
    "c1Name": "Sreenitti S",
    "c1Num": "8122020985",
    "c2Name": "S Shakthi",
    "c2Num": "9677843335",
    "maxCount": "60",
    "desc": "This workshop seamlessly integrates theoretical insights with hands-on exploration, delivering participants a comprehensive understanding of crucial artificial intelligence (AI) concepts and tools. The agenda commences with an introduction to AI, followed by a detailed discussion on OneAPI. Participants will gain practical insights into utilizing the Intel Developer Cloud through a live demonstration. The workshop further explores GenAI and prompt engineering, providing practical examples in image-to-image and text-to-image processing. Additionally, it delves into machine learning (ML) with OneAPI, ensuring participants acquire both theoretical knowledge and practical skills applicable across a spectrum of AI applications.",
    "agenda": [
      [
      {
        "time": "9:30 AM - 12:30 PM",
        "description": ["AI Introduction, OneAPI - an exploratory discussion, Intel developer cloud - usage and demo, GenAI "]
      },
      {
        "time": "1:30 PM - 4:30 PM",
        "description": ["Prompt engineering, Image to image, text to image examples, ML with oneAPI "]
      }
    ]
    ]
  },
  {
    "wid": "WKSP0007",
    "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop7",
    "alteredFee": 499,
    "actualFee": 499,
    "assnName": "Indian Institution of Industrial Engineering (Students Chapter)",
    "workName": "IOT for Mechanical Applications",
    "date": "24",
    "hall": "G-Block (G-405)",
    "time": "9.30 AM - 04.30 PM",
    "c1Name": "Subash C",
    "c1Num": "8056408335",
    "c2Name": "Sriganesan G C ",
    "c2Num": "8838307678",
    "maxCount": "50",
    "desc": "The workshop focuses on the basic conceptual ideas behind the characteristics, challenges and network configurations of IoT along with Data Collection, Data Processing and Data Analytics including Cloud Computing and Big data. It also focuses on the MQTT usage of various embedded systems (Aurdino, Raspberry Pi). The final part of the workshop will be the hands-on training with embedded systems which will be provided to the participants.",
    "prerequisites": "Laptops have to be brought by the participants",
    "agenda": [
      [
      {
        "time": "9:30 AM - 10:30 AM",
        "description": ["Introduction to the basic concepts of IOT, its features and implementations"]
      },
      {
        "time": "10:45 AM - 12:15 PM",
        "description": ["A brief description on Data Collection(Sensor Module)"]
      },
      {
        "time": "01:15 PM - 02:15 PM",
        "description": ["About the MQTT protocol using Data Processing followed by the Data Analytics techniques"]
      },
      {
        "time": "02:30 PM - 04:30 PM",
        "description": ["An interactive hands-on training with IoT kits"]
      }
    ]
    ]
  },
  {
    "wid": "WKSP0004",
    "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop4",
    "alteredFee": 449,
    "actualFee": 449,
    "assnName": "COMPUTER APPLICATIONS ASSOCIATION",
    "workName": "Data Analytics using R",
    "date": "24",
    "hall": "IS Lab (K Block 4th Floor)",
    "time": "9.30 AM - 02.30 PM",
    "c1Name": "Anu Varshini T",
    "c1Num": "9360041156",
    "c2Name": "Kavin",
    "c2Num": "9384397477",
    "maxCount": "50",
    "desc": "R is a straightforward programming language, highly favored as an open-source option for data analytics. Widely embraced by statisticians and data scientists globally, it excels in various tasks such as simple and matrix calculations, differential equations, optimization, statistical analysis, and graph plotting. The intrinsic power of the R Language positions it as an indispensable tool for data analysts worldwide, catering to those engaged in extensive statistical computations and data visualization. This one-day, hands-on workshop is designed to introduce participants to utilizing R programming tools for effective data analytics.",
    "agenda": [
      [
      {
        "time": "9.30 AM - 10.30 AM",
        "description": ["Introduction to R, R Basics"]
      },
      {
        "time": "10.45 AM - 12.30 PM",
        "description": ["Data Structures and Operands in R, Control Structures & Functions"]
      },
      {
        "time": "1:30 PM - 2.30 PM",
        "description": ["Statistical Computations"]
      }
    ]
  ]
  },

  {
    "wid": "WKSP0003",
    "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop3",
    "alteredFee": 350,
    "actualFee": 350,
    "assnName": "Industrial(Alumni) Interaction Forum",
    "workName": "5G Wireless Technologies for various applications",
    "date": "25",
    "hall": "SKAVA Lab(E block 3rd floor)",
    "time": "10:30 AM - 03:00 PM",
    "c1Name": "Vibin Nagaraj",
    "c1Num": "9597307683",
    "c2Name": "Hasmithraa V P",
    "c2Num": "8270110008",
    "maxCount": "50",
    "desc": "Discover the transformative potential of 5G Wireless Technology by joining us for an enlightening exploration into its world. Delve into the myriad applications that are reshaping industries and revolutionizing the way we connect, communicate, and collaborate. Our cutting-edge event promises to showcase the unparalleled speed, reliability, and low latency that 5G brings to the forefront. Be part of this immersive experience, gaining insights into the future of connectivity and staying at the forefront of technological advancements. Elevate your understanding with us as we unravel the revolutionary impact of 5G across diverse sectors.",
    "prerequisites": "Basic knowledge of wireless systems",
    "agenda": [
      [
      {
        "time": "10:30 AM - 12:00 PM",
        "description": ["SESSION 1 – Theory on 5G wireless technologies"]
      },
      {
        "time": "1:30 PM - 3:00 PM",
        "description": ["SESSION 2 - Practical session on 5G networks "]
      }
    ]
  ]
  },
  {
    "wid": "WKSP0006",
    "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop6",
    "alteredFee": 599,
    "actualFee": 599,
    "assnName": "Fashion Technology",
    "workName": "Fashion Communication",
    "date": "24",
    "hall": "FT CAD Lab (K Block 3rd Floor)",
    "time": "9.30 AM - 12.30 PM",
    "c1Name": "Sibin V",
    "c1Num": "8189926657",
    "c2Name": "Vibin Kumar S V",
    "c2Num": "9025636682",
    "maxCount": "80",
    "desc": "In the initial segment of this exclusive event, participants will be expertly guided through the intricacies of fashion styling, creative direction, shoot curation, and conceptualization. Our sessions will provide valuable insights into editing and photography, fostering a comprehensive understanding of the multifaceted world of fashion communication. The latter half of the event introduces an engaging challenge, where teams of four will apply their newfound knowledge by styling a person from head to toe. This hands-on experience encompasses styling, photography, editing, makeup, and hairdressing, enabling each team to showcase their creativity. Teams are required to submit their work in a designated folder, demonstrating the practical application of the workshop principles.",
    "agenda": [
      [
      {
        "time": "9:30 AM - 11:00 AM",
        "description": ["Fashion communication-lecture about styling, photography and editing."]
      },
      {
        "time": "11:00 AM - 12:30 PM",
        "description": ["Practical implementation - Participants will be practically implementing the things learned during the lecture session using the material provided by us."]
      }
    ]
  ]
  },  
  {
    "wid": "WKSP0008",
    "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop8",
    "alteredFee": 450,
    "actualFee": 450,
    "assnName": "Astronomy Club",
    "workName": "Orionize",
    "date": "24",
    "hall": "Y-301, Y-302",
    "time": "9.30 AM - 04.30 PM & 6.00 PM - 8.00 PM",
    "c1Name": "Dharun V S",
    "c1Num": "8778630200",
    "c2Name": "Sreevana T P",
    "c2Num": "6380588041",
    "maxCount": "100",
    "desc": "Embark on a celestial exploration with our workshop,'Orionize'. Immerse yourself in the intricacies of the Diffusion Cloud Chamber experiment and delve into the art of simulating exoplanet physics. Engage in astronomical data analysis utilizing SAOImage DS9 and be enlightened by a captivating lecture from Obuli Chandran, CEO of Mango Foundation. Adventure beneath the night sky with a Skywatch experience, seamlessly blending experiments, cutting-edge technology, and the timeless wisdom of astronomical discovery. Join us for a cosmic journey that transcends boundaries, expanding the horizons of celestial understanding.",
    "prerequisites": "Laptops have to be brought by the participants",
    "agenda": 
    [
      [
      {
        "time": "9:30 AM - 12:10 PM",
        "description": ["Hands on experiment with diffusion cloud chamber experiment and detection of exo-planets and theory"]
      },
      {
        "time": "1:40 PM - 4:30 PM",
        "description": ["Tutorial on SAODS9 software and guest lecture by the speaker"]
      },
      {
        "time": "6:00 PM - 8:00 PM",
        "description": ["Skywatch and hands on sessions on how to handle the telescopes"]
      }
    ]
  ]
  },
  {
    "wid": "WKSP0010",
    "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop10",
    "alteredFee": 400,
    "actualFee": 400,
    "assnName": "Metallurgical Engineering Association",
    "workName": "Thermo-Mechanical simulations for manufacturing processes",
    "date": "24",
    "hall": " G-503, Centre of Excellence in Welding",
    "time": "10:00 AM - 4:00 PM",
    "c1Name": "Kavya Maha Lakshmi S ",
    "c1Num": "6379532308",
    "c2Name": "Kavin Kumar ",
    "c2Num": "8838269364",
    "maxCount": "52",
    "desc": "The Gleeble 3500 represents a fully integrated digital closed-loop control thermal and mechanical testing system. The user-friendly interface, facilitated by Windows-based computer software and a suite of powerful processors, allows for seamless creation, execution, and analysis of data. This workshop endeavors to offer a comprehensive introduction to material testing and thermo-mechanical simulation. It precisely replicates the thermal and mechanical processes that materials undergo during the manufacturing process within a laboratory setting.",
    "agenda": 
    [
      [
      {
        "time": "10:00 AM - 12:00 PM",
        "description": ["Lecture on the basics of Gleeble 3500, material testing and thermo-mechanical simulation"]
      },
      {
        "time": "1:30 PM - 4:00 PM",
        "description": ["Live demonstration of Gleeble 3500"]
      }
    ]
  ]
  },
  {
    "wid":"WKSP0012",
    "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop12",
    "alteredFee": 401,
    "actualFee": 401,
    "assnName": "Society of Manufacturing Engineers - Students' Chapter",
    "workName": "Transformational Manufacturing - 4.0",
    "date": "23",
    "hall": "D-Block conference hall (Ground floor)",
    "time": "10:30 AM - 4:30 PM",
    "c1Name": "Arun K",
    "c1Num": "9003585358",
    "c2Name": "Shanmugam S",
    "c2Num": "6383261299",
    "maxCount": "150",
    "desc": "The Society of Manufacturing Engineers (SME) hosts a dynamic workshop on Transformational Manufacturing 4.0, featuring experts from leading industries such as Larsen & Toubro (L&T) and Flipkart. This exclusive workshop is meticulously tailored for core engineering students, providing invaluable insights into cutting-edge topics, including  Digital Design from L&T, and Digital Operations Management from Flipkart.\n\n Attendees will have the unique opportunity to learn directly from industry leaders, gaining practical knowledge and a deeper understanding of the latest advancements in manufacturing technology. The workshop aims to elucidate the transformation of manufacturing and production areas into increasingly digital domains. Additionally, it strives to bridge the gap between academia and industry experts, fostering a collaborative environment that prepares students for the evolving landscape of digital manufacturing in the future era.\n\n Participants are encouraged to showcase their valuable ideas during the workshop. They are instructed to prepare their own insights on how the manufacturing field is transitioning from conventional to a digitalized area. This can be presented in the form of a flow chart or through compelling content related to the workshop. The ideas or content can be created in a poster format and printed on an A3 sheet, to be showcased in front of the industrial speakers.",
    "agenda": [
      [
      {
        "time": "10.30 AM - 12:30 PM",
        "description": ["Digital Design in Manufacturing. The industry expert from L&T is going to demonstrate how the design field in all manufacturing sectors is getting updated through digitalization, aiming to make the work smarter."]
      },
      {
        "time": "1.30 PM - 3:00 PM",
        "description": ["Digital Operations Management. In this session, the speaker from Flipkart-Bangalore is going to explain operations management and how it can be transitioned into the digital realm. This may bridge the gap in problem-solving skills within digital operations management, thereby linking it to Production and Operations Management (POM)."]
      }
    ]
  ]
  },
  {
    "wid":"WKSP0013",
    "image": "https://res.cloudinary.com/disd40wdk/image/upload/v1708326450/oeeisfu3i2kczlld9viz.jpg",
    "alteredFee": 449,
    "actualFee": 449,
    "assnName": "Artificial Intelligence and Robotics Club",
    "workName": "Mixed Reality",
    "date": "25",
    "hall": "Y - 202",
    "time": "9:30 AM - 4:30 PM",
    "c1Name": "Aswin C",
    "c1Num": "7200052823",
    "c2Name": "Mahizha N S",
    "c2Num": "9629666039",
    "maxCount": "75",
    "desc": "Join us for an insightful Kickstarter session on Reality Technologies, encompassing Augmented, Virtual, and Mixed Reality. This session will explore the seamless integration of reality technologies into multi-disciplinary fields, including Robotics and IoT. Participants will have the unique opportunity for hands-on experience with Virtual Reality headsets. Moreover, attendees will actively engage in the development of an Augmented Reality (AR) app during the workshop. Do not miss this exclusive chance to delve into and contribute to the evolving landscape of Reality Technologies.",
    "prerequisites": "Hardware requisites: Laptop with NVIDIA GTX 1060 / AMD Radeon RX 480 or greater with 8GB+ RAM. (Integrated webcam will be appreciated. \n\nAndroid Mobile phone with respective charging cable (recommended) \n\nSoftware Prerequisties: Unity 2022.3.16f1 Vuforia SDK",
    "agenda": [
      [
      {
        "time": "9.30 AM - 11.00 AM",
        "description": ["Introduction to Reality technologies (Augmented Reality, Virtual Reality, Mixed Reality)"]
      },
      {
        "time": "11.00 AM - 1.30 PM",
        "description": ["Real-world usages of AR, VR technologies in various industries and Development Stages"]
      },
      {
        "time": "1.30 PM - 3.45 PM",
        "description": ["AR App development"]
      }
    ]
  ]
  }
]
  

